
    ,
    {
      "titleDisplay": "17 Again",
      "titleFilter":  "17 Again",
      "editedFlag":   false,
      "toEditFlag":   true,
      "imgPath":      "img/17Again.png",
      "genre":        "Comedy",
      "runTime":      "1:45:00",
      "summary":      "At 17 Mike O'Donnell is on top of the world: he's the star of his high school basketball team, is a shoo-in for a college scholarship, and is dating his soul-mate, Scarlet. But at what's supposed to be his big game where a college scout is checking him out, Scarlet reveals that she's pregnant. Mike decides to leave the game and asks Scarlet to marry him, which she does. During their marriage, Mike can only whine about the life he lost because he married her, so she throws him out. When he also loses his job, he returns to the only place he's happy at, his old high school. While looking at his high school photo, a janitor asks him if he wishes he could be 17 again and he says yes. One night while driving he sees the janitor on a bridge ready to jump, and goes after him. When he returns to his friend Ned's house, where he has been staying, he sees that he is 17 again. He decides to take this opportunity to get the life he lost.",
      "rating":       "PG-13",
      "releaseYear":  "2009",
      "trailer":      "https://www.youtube.com/watch?v=UQK5Hh0L1Sg"
    }
    ,
    {
      "titleDisplay": "A Christmas Story",
      "titleFilter":  "A Christmas Story",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/AChristmasStory.png",
      "genre":        "Holiday, Comedy",
      "runTime":      "1:34:00",
      "summary":      "Christmas is approaching and 9 year-old Ralphie wants only one thing: a Red Ryder Range 200 Shot BB gun. When he mentions it at the dinner table, his mother's immediate reaction is that he'll put his eye out. He then decides on a perfect theme for his teacher but her reaction is like his. He fantasizes about what it would be like to be Red Ryder and catch the bad guys. When the big day arrives he gets lots of present under the tree including a lovely gift from his aunt that his mother just adores. But what about the BB gun?",
      "rating":       "PG",
      "releaseYear":  "1983",
      "trailer":      "https://www.youtube.com/watch?v=sMJJNdO36MA"
    }
    ,
    {
      "titleDisplay": "A Little Princess",
      "titleFilter":  "A Little Princess",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/ALittlePrincess.png",
      "genre":        "Drama, Kids",
      "runTime":      "1:40:00",
      "summary":      "When her father enlists to fight for the British in WWI, young Sara Crewe goes to New York to attend the same boarding school her late mother attended. She soon clashes with the severe headmistress, Miss Minchin, who attempts to stifle Sara's creativity and sense of self-worth. Sara's belief that 'every girl's a princess' is tested to the limit, however, when word comes that her father was killed in action and his estate has been seized by the British government.",
      "rating":       "G",
      "releaseYear":  "1995",
      "trailer":      "https://www.youtube.com/watch?v=Bmqm3_oMK2M"
    }
    ,
    {
      "titleDisplay": "A Man For All Seasons",
      "titleFilter":  "A Man For All Seasons",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/AManforallSeasons.png",
      "genre":        "Drama",
      "runTime":      "2:00:00",
      "summary":      "The story takes place in 16th century England. But men like Sir Thomas More, who love life yet have the moral fiber to lay down their lives for their principles, are found in every century. Concentrating on the last seven years of English chancellor's life, the struggle between More and his King, Henry VIII, hinges on Henry's determination to break with Rome so he can divorce his current wife and wed again, and good Catholic More's inability to go along with such heresy. More resigns as chancellor, hoping to be able to live out his life as a private citizen. But Henry will settle for nothing less than that the much respected More give public approval to his headstrong course.",
      "rating":       "G",
      "releaseYear":  "1966",
      "trailer":      "https://www.youtube.com/watch?v=zbZfh-5QsAw"
    }
    ,
    {
      "titleDisplay": "A Night at the Museum",
      "titleFilter":  "Night at the Museum 1",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/ANightattheMuseum.png",
      "genre":        "Fantasy, Comedy",
      "runTime":      "1:48:00",
      "summary":      "In New York, unemployed and divorced Larry Daley is a complete loser. His son Nick is very disappointed with his father who is going to be evicted. Larry accepts the job of night watchman in the Museum of Natural History and takes the place of three old security guards that have just retired in order to raise some money and pay his bills. On his first shift, Larry soon realizes that everything at the museum is not as it seems as the statues begin to come to life after the sun sets. The Museum transforms into complete chaos with the inexperienced Larry in charge as he learns that an old Egyptian stone that came to the Museum in 1950 brings these statues to life until dawn. When Larry brings his son to spend a night with him, the three old guards break into the Museum to try to steal the magical stone. Larry organizes all the historic characters to help him stop the criminals and save the museum.",
      "rating":       "PG",
      "releaseYear":  "2006",
      "trailer":      "https://www.youtube.com/watch?v=jWDwJIBqjSU"
    }
    ,
    {
      "titleDisplay": "A Walk in the Clouds",
      "titleFilter":  "A Walk in the Clouds",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/AWalkintheClouds.png",
      "genre":        "Romance, Drama",
      "runTime":      "1:42:00",
      "summary":      "A Walk in the Clouds depicted a story about a young-married US military soldier, named Paul, who returned home after the World War II. In the middle of the way back home, he accidentally met a girl named Victoria who finished her master's degree. She has not married yet but got pregnant by accident. During the journey they talked a lot. Due to her pregnancy, Victoria was afraid of her father who respected old Mexican tradition. Thus, Paul proposed to pose as her husband to help her face her dad. Paul was not intended to cheat on his wife by pretending to be Victoria's husband. However, when Paul decided to come back to his home and left Victoria, he found his wife cheating on him. Paul then headed back to Victoria's house 'Las Nubes' and confessed his true love to Victoria.",
      "rating":       "PG-13",
      "releaseYear":  "1995",
      "trailer":      "https://www.youtube.com/watch?v=cULvtpaIK9I"
    }
    ,
    {
      "titleDisplay": "The Abyss",
      "titleFilter":  "Abyss, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Abyss,The.png",
      "genre":        "Suspense, Action, Fantasy",
      "runTime":      "2:51:00",
      "summary":      "An American nuclear submarine encounters an alien species, which coincidentally causes massive electrical and hydraulic malfunctions, causing the sub to crash into an underwater cliff and sink. The navy asks the workers of a nearby underwater oil rig who are joined by a number of navy SEALS to locate and investigate the cause of the crash. As the crew embark on their mission, they encounter a number of difficulties and discover that they may not be alone. There is something else down there.",
      "rating":       "PG-13",
      "releaseYear":  "1989",
      "trailer":      "https://www.youtube.com/watch?v=4zbpL3LeW7k"
    }
    ,
    {
      "titleDisplay": "Aladdin",
      "titleFilter":  "Aladdin",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Aladdin.png",
      "genre":        "Disney, Romance",
      "runTime":      "1:31:00",
      "summary":      "Aladdin is a street-urchin who lives in a large and busy town long ago with his faithful monkey friend Abu. When Princess Jasmine gets tired of being forced to remain in the palace that overlooks the city, she sneaks out to the marketplace, where she accidentally meets Aladdin. Under the orders of the evil Jafar (the sultan's advisor), Aladdin is thrown in jail and becomes caught up in Jafar's plot to rule the land with the aid of a mysterious lamp. Legend has it that only a person who is a 'diamond in the rough' can retrieve the lamp from the Cave of Wonders. Aladdin might fit that description, but that's not enough to marry the princess, who must (by law) marry a prince.",
      "rating":       "G",
      "releaseYear":  "1992",
      "trailer":      "https://www.youtube.com/watch?v=U8XtRQ5yOVE"
    }
    ,
    {
      "titleDisplay": "All Dogs go to Heaven",
      "titleFilter":  "All Dogs go to Heaven",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/AllDogsGotoHeaven.png",
      "genre":        "Disney, Romance, Music",
      "runTime":      "1:29:00",
      "summary":      "When a casino owning dog named Charlie is murdered by his rival Carface, he finds himself in Heaven basically by default since all dogs go to heaven. However, since he wants to get back at his killer, he cons his way back to the living with the warning that doing that damns him to Hell. Once back, he teams with his old partner, Itchy to prep his retaliation. He also stumbles on to an orphan girl who can talk to the animals, thus allowing him to get the inside info on the races to ensure his wins to finance his plans. However, all the while, he is still haunted by nightmares on what's waiting for him on the other side unless he can prove that he is worthy of Heaven again.",
      "rating":       "G",
      "releaseYear":  "1989",
      "trailer":      "https://www.youtube.com/watch?v=UUQ-jmJcWN8"
    }
    ,
    {
      "titleDisplay": "Amazing Grace",
      "titleFilter":  "Amazing Grace",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/AmazingGrace.png",
      "genre":        "Drama",
      "runTime":      "1:58:00",
      "summary":      "In 1797, William Wilberforce, the great crusader for the British abolition of slavery, is taking a vacation for his health even while he is sicker at heart for his frustrated cause. However, meeting the charming Barbara Spooner, Wilberforce finds a soulmate to share the story of his struggle. With few allies such as his mentor, John Newton, a slave ship captain turned repentant priest who penned the great hymn, 'Amazing Grace,' Prime William Pitt, and Olaudah Equiano, the erudite former slave turned author, Wilberforce fruitlessly fights both public indifference and moneyed opposition determined to keep their exploitation safe. Nevertheless, Wilberforce finds the inspiration in newfound love to rejuvenate the fight with new ideas that would lead to a great victory for social justice.",
      "rating":       "PG",
      "releaseYear":  "2006",
      "trailer":      "https://www.youtube.com/watch?v=Q6Cv5P9H9qU"
    }
    ,
    {
      "titleDisplay": "Ant-Man",
      "titleFilter":  "Ant-Man",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Ant-Man.png",
      "genre":        "Fantasy, Action, Comedy",
      "runTime":      "1:57:00",
      "summary":      "Armed with the astonishing ability to shrink in scale but increase in strength, con-man Scott Lang must embrace his inner-hero and help his mentor, Dr. Hank Pym, protect the secret behind his spectacular Ant-Man suit from a new generation of towering threats. Against seemingly insurmountable obstacles, Pym and Lang must plan and pull off a heist that will save the world.",
      "rating":       "PG-13",
      "releaseYear":  "2015",
      "trailer":      "https://www.youtube.com/watch?v=pWdKf3MneyI"
    }
    ,
    {
      "titleDisplay": "Antz",
      "titleFilter":  "Antz",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Antz.png",
      "genre":        "Disney, Comedy, Romance",
      "runTime":      "1:24:00",
      "summary":      "In an anthill with millions of inhabitants, Z 4195 is a worker ant. Feeling insignificant in a conformity system, he accidentally meets beautiful Princess Bala, who has a similar problem on the other end of the social scale. In order to meet her again, Z switches sides with his soldier friend Weaver - only to become a hero in the course of events. By this he unwillingly crosses the sinister plans of ambitious General Mandible (Bala's fiancé, by the way), who wants to divide the ant society into a superior, strong race (soldiers) and an inferior, to-be-eliminated race (the workers). But Z and Bala, both unaware of the dangerous situation, try to leave the oppressive system by heading for Insectopia, a place where food paves the streets.",
      "rating":       "PG",
      "releaseYear":  "1998",
      "trailer":      "https://www.youtube.com/watch?v=6kqGO1c70ak"
    }
    ,
    {
      "titleDisplay": "Arachnophobia",
      "titleFilter":  "Arachnophobia",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Arachnophobia.png",
      "genre":        "Suspense",
      "runTime":      "1:50:00",
      "summary":      "A large spider from the jungles of South America is accidently transported in a crate with a dead body to America where it mates with a local spider. Soon after, the residents of a small California town disappear as the result of spider bites from the deadly spider offspring. It's up to a couple of doctors with the help of an insect exterminator to annihilate these eight legged freaks before they take over the entire town.",
      "rating":       "PG-13",
      "releaseYear":  "1990",
      "trailer":      "https://www.youtube.com/watch?v=4aQ6vg3JB2U"
    }
    ,
    {
      "titleDisplay": "The Avengers 1",
      "titleFilter":  "Avengers 1, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Avengers,The.png",
      "genre":        "Fantasy, Action",
      "runTime":      "2:23:00",
      "summary":      "Nick Fury is the director of S.H.I.E.L.D., an international peace-keeping agency. The agency is a who's who of Marvel Super Heroes, with Iron Man, The Incredible Hulk, Thor, Captain America, Hawkeye and Black Widow. When global security is threatened by Loki and his cohorts, Nick Fury and his team will need all their powers to save the world from disaster.",
      "rating":       "PG-13",
      "releaseYear":  "2012",
      "trailer":      "https://www.youtube.com/watch?v=eOrNdBpGMv8"
    }
    ,
    {
      "titleDisplay": "The Avengers 2 - Age of Ultron",
      "titleFilter":  "Avengers 2 - Age of Ultron, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Avengers2AgeofUltron.png",
      "genre":        "Fantasy, Action",
      "runTime":      "2:22:00",
      "summary":      "Tony Stark creates the Ultron Program to protect the world, but when the peace-keeping program becomes hostile, The Avengers go into action to try and defeat a virtually impossible enemy. Earth's mightiest heroes must come together once again to protect the world from global extinction.",
      "rating":       "PG-13",
      "releaseYear":  "2015",
      "trailer":      "https://www.youtube.com/watch?v=tmeOjFno6Do"
    }
    ,
    {
      "titleDisplay": "Back to the Future 1",
      "titleFilter":  "Back to the Future 1",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/BacktotheFuture1.png",
      "genre":        "Fantasy, Comedy",
      "runTime":      "2:00:00",
      "summary":      "Marty McFly, a typical American teenager of the Eighties, is accidentally sent back to 1955 in a plutonium-powered DeLorean 'time machine' invented by a slightly mad scientist. During his often hysterical, always amazing trip back in time, Marty must make certain his teenage parents-to-be meet and fall in love - so he can get back to the future.",
      "rating":       "PG",
      "releaseYear":  "1985",
      "trailer":      "https://www.youtube.com/watch?v=JWyOC4n4qSc"
    }
    ,
    {
      "titleDisplay": "Back to the Future 2",
      "titleFilter":  "Back to the Future 2",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/BacktotheFuture2.png",
      "genre":        "Fantasy, Comedy",
      "runTime":      "1:48:00",
      "summary":      "Marty McFly has only just gotten back from the past, when he is once again picked up by Dr. Emmett Brown and sent through time to the future. Marty's job in the future is to pose as his own son to prevent him from being thrown in prison. Unfortunately, things get worse when the future changes the present.",
      "rating":       "PG",
      "releaseYear":  "1989",
      "trailer":      "https://www.youtube.com/watch?v=rRrSp6Pqlz4"
    }
    ,
    {
      "titleDisplay": "Back to the Future 3",
      "titleFilter":  "Back to the Future 3",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/BacktotheFuture3.png",
      "genre":        "Fantasy, Comedy",
      "runTime":      "1:59:00",
      "summary":      "Stranded in 1955, Marty McFly receives written word from his friend, Doctor Emmett Brown, as to where can be found the DeLorean time machine. However, an unfortunate discovery prompts Marty to go to his friend's aid. Using the time machine, Marty travels to the old west where his friend has run afoul of a gang of thugs and has fallen in love with a local schoolteacher. Using the technology from the time, Marty and Emmett devise one last chance to send the two of them back to the future.",
      "rating":       "PG",
      "releaseYear":  "1990",
      "trailer":      "https://www.youtube.com/watch?v=UQXOx2lYnA4"
    }
    ,
    {
      "titleDisplay": "Baptists at our Barbecue",
      "titleFilter":  "Baptists at our Barbecue",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/BaptistsatOurBarbecue.png",
      "genre":        "Comedy, Romance, Doc/Rel",
      "runTime":      "1:33:00",
      "summary":      "'Baptists at Our Barbecue' is the comedic story of the small town of Longwinded, USA, a divided, feuding town of 262 Mormons and 262 Baptists. It's also a love story, about one man who will try anything to end the ridiculous feud, bring the town together, and keep the peace-loving girl of his dreams from leaving town.",
      "rating":       "PG",
      "releaseYear":  "2004",
      "trailer":      "https://www.youtube.com/watch?v=X5Hs90lQ5Uw"
    }
    ,
    {
      "titleDisplay": "The Berenstein Bears Movie",
      "titleFilter":  "Berenstein Bears Movie, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/BerensteinBearsMovie,The.png",
      "genre":        "Kids",
      "runTime":      "",
      "summary":      "",
      "rating":       "G",
      "releaseYear":  "",
      "trailer":      ""
    }
    ,
    {
      "titleDisplay": "Big Business",
      "titleFilter":  "Big Business",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/BigBusiness.png",
      "genre":        "Comedy",
      "runTime":      "1:38:00",
      "summary":      "In the 1940s in the small town of Jupiter Hollow, two sets of identical twins are born in the same hospital on the same night. One set to a poor local family and the other to a rich family just passing through. The dizzy nurse on duty accidentally mixes the twins unbeknown to the parents. Our story flashes forward to the 1980s where the mismatched sets of twins are about to cross paths following a big business deal to closedown the Jupiter Hollow factory.",
      "rating":       "PG",
      "releaseYear":  "1988",
      "trailer":      "https://www.youtube.com/watch?v=e73Jt0W8vjA"
    }
    ,
    {
      "titleDisplay": "The Black Stallion",
      "titleFilter":  "Black Stallion, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/BlackStallion,The.png",
      "genre":        "Drama",
      "runTime":      "1:58:00",
      "summary":      "While traveling with his father, young Alec becomes fascinated by a mysterious Arabian stallion who is brought on board and stabled in the ship he is sailing on. When it tragically sinks both he and the horse survive only to be stranded on a desert island. He befriends it, so when finally rescued, both return to his home where they soon meet Henry Dailey, a once-successful trainer. Together they begin training the stallion to race against the fastest horses in the world.",
      "rating":       "G",
      "releaseYear":  "1979",
      "trailer":      "https://www.youtube.com/watch?v=8GlZJ4wVLdA"
    }
    ,
    {
      "titleDisplay": "Blackbeard's Ghost",
      "titleFilter":  "Blackbeard's Ghost",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/BlackbeardsGhost.png",
      "genre":        "Fantasy, Comedy",
      "runTime":      "1:47:00",
      "summary":      "In this comedy, Peter Ustinov is the famous pirate's ghost that returns to our time. Blackbeard has been cursed by his last wife who was a notorious witch, so that he will never die. The only way to 'break' the curse is to do (for once in his life) a good act. Is the famous pirate able to do something good?",
      "rating":       "G",
      "releaseYear":  "1968",
      "trailer":      "https://www.youtube.com/watch?v=0pgOSllKF_0"
    }
    ,
    {
      "titleDisplay": "Blast From The Past",
      "titleFilter":  "Blast From The Past",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/BlastfromthePast.png",
      "genre":        "Comedy, Romance",
      "runTime":      "1:52:00",
      "summary":      "Adam Weber is the child of an eccentric inventor and his wife. Following a bomb scare in the 1960s that locked the Webers in their bomb shelter for 35 years, Adam Weber must venture out into Los Angeles and obtain food and supplies for his family. He meets Eve, who reluctantly agrees to help him out.",
      "rating":       "PG-13",
      "releaseYear":  "1999",
      "trailer":      "https://www.youtube.com/watch?v=AhMQOb0tEmI"
    }
    ,
    {
      "titleDisplay": "The Book of Mormon Movie",
      "titleFilter":  "Book of Mormon Movie, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/BookofMormonMovie,The.png",
      "genre":        "Doc/Rel",
      "runTime":      "2:00:00",
      "summary":      "The story of Lehi and his wife Sariah and their four sons: Laman, Lemuel, Sam, and Nephi. Lehi leaves Jerusalem because he prophesied unto the people concerning the destruction of Jerusalem, and they sought his life. He journeys into the wilderness with his family. He sends Nephi and his brethren back to Jerusalem after the brass plates and the family of Ishmael. The sons and daughters of Lehi marry the sons and daughters of Ishmael. They take their families and continue into the wilderness. Ishmael dies in the wilderness. They come to the sea. Nephi's brethren rebel against him. He confounds them, and builds a ship. They cross the sea to the promised land in the Americas. Lehi dies in the promised land. Nephi's brethren rebel against him again. Nephi departs again into the wilderness.",
      "rating":       "PG-13",
      "releaseYear":  "2003",
      "trailer":      "https://www.youtube.com/watch?v=ijknQ5qJWkc"
    }
    ,
    {
      "titleDisplay": "Brave",
      "titleFilter":  "Brave",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Brave.png",
      "genre":        "Disney, Comedy",
      "runTime":      "1:42:00",
      "summary":      "Set in Scotland in a rugged and mythical time, 'Brave' features Merida, an aspiring archer and impetuous daughter of royalty. Merida makes a reckless choice that unleashes unintended peril and forces her to spring into action to set things right.",
      "rating":       "PG",
      "releaseYear":  "2012",
      "trailer":      "https://www.youtube.com/watch?v=TEHWDA_6e3M"
    }
    ,
    {
      "titleDisplay": "Breach",
      "titleFilter":  "Breach",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Breach.png",
      "genre":        "Drama, Action",
      "runTime":      "1:51:00",
      "summary":      "In February, 2001, Robert Hanssen, a senior agent with 25 years in the FBI, is arrested for spying. Jump back two months: Eric O'Neill, a computer specialist who wants to be made an agent is assigned to clerk for Hanssen and to write down everything Hanssen does. O'Neill's told it's an investigation of Hanssen's sexual habits. Within weeks, the crusty Hanssen, a devout Catholic, has warmed to O'Neill, who grows to respect Hanssen. O'Neill's wife resents Hanssen's intrusiveness; the personal and professional stakes get higher. How they catch Hanssen and why he spies become the film's story. Can O'Neill help catch red-handed 'the worst spy in history' and hold onto his personal life?",
      "rating":       "PG-13",
      "releaseYear":  "2007",
      "trailer":      "https://www.youtube.com/watch?v=XJuLFKeRoJg"
    }
    ,
    {
      "titleDisplay": "The Bucket List",
      "titleFilter":  "Bucket List, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/BucketList,The.png",
      "genre":        "Drama, Comedy",
      "runTime":      "1:37:00",
      "summary":      "Corporate billionaire Edward Cole and working class mechanic Carter Chambers have nothing in common except for their terminal illnesses. While sharing a hospital room together, they decide to leave it and do all the things they have ever wanted to do before they die according to their bucket list. In the process, both of them heal each other, become unlikely friends, and ultimately find joy in life.",
      "rating":       "PG-13",
      "releaseYear":  "2007",
      "trailer":      "https://www.youtube.com/watch?v=vc3mkG21ob4"
    }
    ,
    {
      "titleDisplay": "Captain America 1 - The First Avenger",
      "titleFilter":  "Captain America 1 - The First Avenger",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/CaptainAmerica1-TheFirstAvenger.png",
      "genre":        "Action, Romance",
      "runTime":      "2:05:00",
      "summary":      "It is 1942, America has entered World War II, and sickly but determined Steve Rogers is frustrated at being rejected yet again for military service. Everything changes when Dr. Erskine recruits him for the secret Project Rebirth. Proving his extraordinary courage, wits and conscience, Rogers undergoes the experiment and his weak body is suddenly enhanced into the maximum human potential. When Dr. Erskine is then immediately assassinated by an agent of Nazi Germany's secret HYDRA research department (headed by Johann Schmidt, a.k.a. the Red Skull), Rogers is left as a unique man who is initially misused as a propaganda mascot; however, when his comrades need him, Rogers goes on a successful adventure that truly makes him Captain America, and his war against Schmidt begins.",
      "rating":       "PG-13",
      "releaseYear":  "2011",
      "trailer":      "https://www.youtube.com/watch?v=JerVrbLldXw"
    }
    ,
    {
      "titleDisplay": "Captain America 2 - The Winter Soldier",
      "titleFilter":  "Captain America 2 - The Winter Soldier",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/CaptainAmerica2-TheWinterSoldier.png",
      "genre":        "Action",
      "runTime":      "2:16:00",
      "summary":      "For Steve Rogers, awakening after decades of suspended animation involves more than catching up on pop culture; it also means that this old school idealist must face a world of subtler threats and difficult moral complexities. That becomes clear when Director Nick Fury is killed by the mysterious assassin, the Winter Soldier, but not before warning Rogers that SHIELD has been subverted by its enemies. When Rogers acts on Fury's warning to trust no one there, he is branded as a traitor by the organization. Now a fugitive, Captain America must get to the bottom of this deadly mystery with the help of the Black Widow and his new friend, The Falcon. However, the battle will be costly for the Sentinel of Liberty, with Rogers finding enemies where he least expects them while learning that the Winter Soldier looks disturbingly familiar.",
      "rating":       "PG-13",
      "releaseYear":  "2014",
      "trailer":      "https://www.youtube.com/watch?v=dKrVegVI0Us"
    }
    ,
    {
      "titleDisplay": "Cars",
      "titleFilter":  "Cars 1",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Cars1.png",
      "genre":        "Disney, Comedy, Romance",
      "runTime":      "1:57:00",
      "summary":      "While traveling to California for the dispute of the final race of the Piston Cup against The King and Chick Hicks, the famous Lightning McQueen accidentally damages the road of the small town Radiator Springs and is sentenced to repair it. Lightning McQueen has to work hard and finds friendship and love in the simple locals, changing its values during his stay in the small town and becoming a true winner.",
      "rating":       "G",
      "releaseYear":  "2006",
      "trailer":      "https://www.youtube.com/watch?v=uxx75HVd-F0"
    }
    ,
    {
      "titleDisplay": "Cars 2",
      "titleFilter":  "Cars 2",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Cars2.png",
      "genre":        "Disney, Comedy, Romance",
      "runTime":      "2:00:00",
      "summary":      "When a group of carsown the biggest oil rig in the world Sir axelrod makes a race where the cars do not use regular gasoline their plan is to use a electro magnet ethic pulse to prove that allinal the alternative fuel is bad then the cars have the most oil and become the most powerful cars in the world and with mater and dome spies mater feels bad becauae Mqqueen is telling him to behave.but at the end everything turns put right.",
      "rating":       "G",
      "releaseYear":  "2011",
      "trailer":      "https://www.youtube.com/watch?v=oFTfAdauCOo"
    }
    ,
    {
      "titleDisplay": "Cheaper by the Dozen 2",
      "titleFilter":  "Cheaper by the Dozen 2",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/CheaperBytheDozen2.png",
      "genre":        "Comedy",
      "runTime":      "1:34:00",
      "summary":      "Tom Baker (Steve Martin) and his wife, Kate (Bonnie Hunt), take their children for what they hope will be a relaxing summer at a lakeside resort. When the Bakers end up with the shoddiest unit imaginable, a clueless but well-meaning Tom struggles to repair it himself. To make matters worse, Tom's old nemesis -- Jimmy Murtaugh (Eugene Levy) -- and his similarly gigantic family appear on the scene and engage the Bakers in a not-so-friendly rivalry that threatens to spoil their trip.",
      "rating":       "PG",
      "releaseYear":  "2005",
      "trailer":      "https://www.youtube.com/watch?v=KUjLJFsHlSg"
    }
    ,
    {
      "titleDisplay": "Chicken Little",
      "titleFilter":  "Chicken Little",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/ChickenLittle.png",
      "genre":        "Disney",
      "runTime":      "1:21:00",
      "summary":      "Young Chicken Little (Zach Braff) throws his small town into panic by claiming the sky is falling. Unable to find the piece of 'sky' that hit him, he earns the town's scorn. A year later, outcast Little tries to redeem himself by joining the baseball team, helping to win a crucial game. Later that night he is hit on the head again and discovers that the 'falling sky' is actually from a UFO. Now, Little must convince the skeptical town that an alien invasion is about to happen.",
      "rating":       "G",
      "releaseYear":  "2005",
      "trailer":      "https://www.youtube.com/watch?v=PPuk2JQgMkU"
    }
    ,
    {
      "titleDisplay": "A Christmas Kiss",
      "titleFilter":  "A Christmas Kiss",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Christmas-AChristmasKiss.png",
      "genre":        "Holiday, Romance",
      "runTime":      "1:36:00",
      "summary":      "Wendy Walton is the best designer in Boston... but no one knows it yet. Hoping to kick-start her career, Wendy has left work with the local theatre to take a job as an assistant to Priscilla Hall, the most prestigious designer in the city. Ms. Hall works Wendy around the clock, which is how Wendy finds herself trapped in an elevator late one night with an incredibly handsome stranger. Wendy and the mystery man share an impulsive, romantic, life-changing kiss before the doors open and Wendy runs out, leaving him behind. The next day at work, Wendy answers the door to find the handsome gentleman standing in front of her. Turns out he's Adam Hughes, a wealthy philanthropist - and Ms. Hall's long distance boyfriend. He doesn't recognize Wendy, which makes things all the more awkward for her when Ms. Hall assigns her to decorate his house for a big party at Christmas. As the holidays approach and Wendy and Adam spend more and more time together, Wendy realizes she's falling in love.",
      "rating":       "PG",
      "releaseYear":  "2011",
      "trailer":      "https://www.youtube.com/watch?v=h1nxUWS7TWI"
    }
    ,
    {
      "titleDisplay": "Annie Claus is Coming to Town",
      "titleFilter":  "Annie Claus is Coming to Town",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Christmas-AnnieClausisComingtoTown.png",
      "genre":        "Holiday",
      "runTime":      "1:23:00",
      "summary":      "This year, Santa's daughter (Maria Thayer) takes her first trip away from the North Pole during the Christmas season hoping to find adventure and love in sunny California. While Santa watches his daughter through a magic snow globe, Annie arrives in L.A. and becomes friends with the owner of Candy Cane Inn, Lucy (Vivica A. Fox), and her daughter, Mia (Nay Nay Kirby). She also quickly lands a job at Wonderland Toys. Wonderland Toys' owner, Ted (Sam Page) is struggling to stay in business selling old-fashioned toys in a digital world. Annie soon realizes that she wants Ted's business to thrive because she has feelings for this Christmas traditionalist.",
      "rating":       "PG",
      "releaseYear":  "2011",
      "trailer":      "https://www.youtube.com/watch?v=fMpZ8UC1FiI"
    }
    ,
    {
      "titleDisplay": "Holiday Engagement",
      "titleFilter":  "Holiday Engagement",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Christmas-AHolidayEngagement.png",
      "genre":        "Holiday, Romance, Comedy",
      "runTime":      "1:32:00",
      "summary":      "Thirty-something Hillary Burns has spent her life trying to get the approval of her parents (most specifically her judgmental mother, Meredith Burns) thus far without success. Part of that approval for Hillary is to marry the right man. That's why Hillary is so happy she is engaged to successful lawyer Jason King, whom she will bring home to meet the family for the first time at their Thanksgiving get-together weekend in a week's time; however, Hillary's life starts to fall apart when simultaneously she loses her part-time newspaper writing job (when the newspaper itself folds) and Jason dumps her to focus on his career (which is seemingly more important to him than Hillary). On the advice of her best friend Sophie, Hillary - who feels she can't go home without Jason (especially as her two sisters' lives seem to meet their mother's approval) - decides reluctantly to go to an online dating site to find someone to pose as Jason for the upcoming family weekend.",
      "rating":       "PG",
      "releaseYear":  "2011",
      "trailer":      "https://www.youtube.com/watch?v=Azl_SmMNG3M"
    }
    ,
    {
      "titleDisplay": "The Most Wonderful Time of the Year",
      "titleFilter":  "The Most Wonderful Time of the Year",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Christmas-TheMostWonderfulTimeoftheYear.png",
      "genre":        "Holiday, Comedy, Drama",
      "runTime":      "1:28:00",
      "summary":      "The overwhelming tasks that go along with Christmas have taken the joy out of the holidays for busy single mom Jennifer Cullen. Then her Uncle Ralph arrives at her home with the young, handsome Morgan Derby. Morgan's love of Christmas, and life, is contagious and as Jennifer glumly navigates through the holidays, she soon realizes that what she needs most is right under her nose. Stars Henry Winkler, Brooke Burns and Warren Christie.",
      "rating":       "PG",
      "releaseYear":  "2008",
      "trailer":      "https://www.youtube.com/watch?v=yuMcxMa0c4o"
    }
    ,
    {
      "titleDisplay": "The Chronicles of Narnia - Prince Caspian",
      "titleFilter":  "Chronicles of Narnia - Prince Caspian, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/ChroniclesofNarnia-PrinceCaspian.png",
      "genre":        "Fantasy, Action, Drama",
      "runTime":      "2:30:00",
      "summary":      "The four Pevensie children return to Narnia, only to discover that hundreds of years have passed since they ruled there, and the evil King Miraz has taken charge. With the help of a heroic mouse called Reepicheep, and the exiled heir to the throne, Prince Caspian, they set out to overthrow the King, once again with Aslan's help",
      "rating":       "PG",
      "releaseYear":  "2008",
      "trailer":      "https://www.youtube.com/watch?v=VqzYukVDqy4"
    }
    ,
    {
      "titleDisplay": "The Chronicles of Narnia - The Lion, the Witch and the Wardrobe, The",
      "titleFilter":  "Chronicles of Narnia - The Lion, the Witch and the Wardrobe, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/ChroniclesofNarnia-TheLion,theWitchandtheWardrobe.png",
      "genre":        "Fantasy, Action, Drama",
      "runTime":      "2:30:00",
      "summary":      "Four children from the same family have to leave their town because WW1 is happening. A women and a professor take the children to their house. While playing a game of hide and seek the youngest member of the family 'Lucy' finds a wardrobe to hide in. She travels back and back into the wardrobe and finds a place named Narnia. After going in twice the four children go in together for the last time. They battle wolves, meet talking animals, encounter a evil white witch and meet a magnificent lion named 'Aslan'. Will this be the end of their journey to narnia or will they stay?",
      "rating":       "PG",
      "releaseYear":  "2005",
      "trailer":      "https://www.youtube.com/watch?v=pYcGFLgJ8Uo"
    }
    ,
    {
      "titleDisplay": "Cinderella",
      "titleFilter":  "Cinderella 2",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Cinderella.png",
      "genre":        "Disney, Romance",
      "runTime":      "1:20:00",
      "summary":      "In a far away, long ago kingdom, Cinderella is living happily with her mother and father until her mother dies. Cinderella's father remarries a cold, cruel woman who has two daughters, Drizella and Anastasia. When the father dies, Cinderella's wicked stepmother turns her into a virtual servant in her own house. Meanwhile, across town in the castle, the King determines that his son the Prince should find a suitable bride and provide him with a required number of grandchildren. So the King invites every eligible maiden in the kingdom to a fancy dress ball, where his son will be able to choose his bride. Cinderella has no suitable party dress for a ball, but her friends the mice, led by Jaques and Gus, and the birds lend a hand in making her one, a dress the evil stepsisters immediately tear apart on the evening of the ball. At this point, enter the Fairy Godmother, the pumpkin carriage, the royal ball, the stroke of midnight, the glass slipper, and the rest, as they say, is fairy tale history.",
      "rating":       "G",
      "releaseYear":  "1950",
      "trailer":      "http://video.disney.com/watch/cinderella-1950-trailer-4beae8f4c7bbbdc60c94e3f9"
    }
    ,
    {
      "titleDisplay": "Cinderella",
      "titleFilter":  "Cinderella 1",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Cinderella2015.png",
      "genre":        "Disney, Romance",
      "runTime":      "1:54:00",
      "summary":      "After her father unexpectedly dies, young Ella (Lily James) finds herself at the mercy of her cruel stepmother (Cate Blanchett) and stepsisters, who reduce her to scullery maid. Despite her circumstances, she refuses to despair. An invitation to a palace ball gives Ella hope that she might reunite with the dashing stranger (Richard Madden) she met in the woods, but her stepmother prevents her from going. Help arrives in the form of a kindly beggar woman who has a magic touch for ordinary things.",
      "rating":       "PG",
      "releaseYear":  "2015",
      "trailer":      "https://www.youtube.com/watch?v=20DF6U1HcGQ"
    }
    ,
    {
      "titleDisplay": "Clear and Present Danger",
      "titleFilter":  "Clear and Present Danger",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/ClearandPresentDanger.png",
      "genre":        "Action",
      "runTime":      "2:21:00",
      "summary":      "Agent Jack Ryan (Harrison Ford) becomes acting deputy director of the CIA when Admiral Greer (James Earl Jones) is diagnosed with cancer. When an American businessman, and friend of the president, is murdered on a yacht, Ryan starts discovering links between the man and drug dealers. As CIA agent John Clark (Willem Dafoe) is sent to Colombia to kill drug kingpins in retaliation, Ryan must fight through multiple cover-ups to figure out what happened and who's responsible.",
      "rating":       "PG-13",
      "releaseYear":  "1994",
      "trailer":      "https://www.youtube.com/watch?v=MNzWYVWfRIc"
    }
    ,
    {
      "titleDisplay": "Clue",
      "titleFilter":  "Clue",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Clue.png",
      "genre":        "Action, Comedy",
      "runTime":      "1:37:00",
      "summary":      "Based on the popular board game, this comedy begins at a dinner party hosted by Mr. Boddy (Lee Ving), where he admits to blackmailing his visitors. These guests, who have been given aliases, are Mrs. Peacock (Eileen Brennan), Miss Scarlet (Lesley Ann Warren), Mr. Green (Michael McKean), professor Plum (Christopher Lloyd), Mrs. White (Madeline Kahn) and Col. Mustard (Martin Mull). When Boddy turns up murdered, all are suspects, and together they try to figure out who is the killer.",
      "rating":       "PG",
      "releaseYear":  "1985",
      "trailer":      "https://www.youtube.com/watch?v=cDDdeHtrxfA"
    }
    ,
    {
      "titleDisplay": "The Count of Monte Cristo",
      "titleFilter":  "Count of Monte Cristo, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/CountofMonteCristo,The.png",
      "genre":        "Action, Drama",
      "runTime":      "2:11:00",
      "summary":      "'The Count of Monte Cristo' is a remake of the Alexander Dumas tale by the same name. Dantes, a sailor who is falsely accused of treason by his best friend Fernand, who wants Dantes' girlfriend Mercedes for himself. Dantes is imprisoned on the island prison of Chateau d'If for 13 years, where he plots revenge against those who betrayed him. With the help of another prisoner, he escapes the island and proceeds to transform himself into the wealthy Count of Monte Cristo as part of his plan to exact revenge.",
      "rating":       "PG-13",
      "releaseYear":  "2002",
      "trailer":      "https://www.youtube.com/watch?v=gzRSVl8UewM"
    }
    ,
    {
      "titleDisplay": "The Day After Tomorrow",
      "titleFilter":  "Day After Tomorrow, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/DayAfterTomorrow,The.png",
      "genre":        "Action, Drama",
      "runTime":      "2:04:00",
      "summary":      "As Paleoclimatologist named Jack Hall is in Antartica, he discovers that a huge ice sheet has sheared off. But what he does not know is that this event will trigger a massive climate shift that will affect the world population. Meanwhile, his son Sam is with friends in New York to attend an event. There they discover that it has been raining non-stop for the past 3 days, and after a series of weather-related disasters begin to occur over the world, everybody realizes the world is entering a new Ice Age and the world population begins trying to evacuate to the warmer climates of the south. Jack makes a daring attempt to rescue his son and his friends who are stuck in New York and who have managed to survive not only a massive wave but also freezing cold temperatures that could possibly kill them.",
      "rating":       "PG-13",
      "releaseYear":  "2004",
      "trailer":      "https://www.youtube.com/watch?v=MFLncfCvPeY"
    }
    ,
    {
      "titleDisplay": "Deep Impact",
      "titleFilter":  "Deep Impact",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/DeepImpact.png",
      "genre":        "Action",
      "runTime":      "2:05:00",
      "summary":      "Journalist Jenny Lerner is assigned to look into the background of Secretary Alan Rittenhouse who abruptly resigned from government citing his wife's ill health. She learns from his secretary that Rittenhouse was having an affair with someone named Ellie but when she confronts him, his strange reaction leads her to reconsider her story. In fact, a comet, discovered the previous year by high school student Leo Biederman and astronomer Dr. Marcus Wolf, is on a collision course with the Earth, an Extinction Level Event. A joint US-Russian team is sent to destroy the comet but should it fail, special measures are to be put in place to secure the future of mankind. As the space mission progresses, many individuals deal with their fears and ponder their future.",
      "rating":       "PG-13",
      "releaseYear":  "1998",
      "trailer":      "https://www.youtube.com/watch?v=fLgSKv2P-ow"
    }
    ,
    {
      "titleDisplay": "Despicable Me",
      "titleFilter":  "Despicable Me",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/DespicableMe.png",
      "genre":        "Disney, Comedy",
      "runTime":      "1:36:00",
      "summary":      "In a happy suburban neighborhood surrounded by white picket fences with flowering rose bushes, sits a black house with a dead lawn. Unbeknownst to the neighbors, hidden beneath this home is a vast secret hideout. Surrounded by a small army of minions, we discover Gru, planning the biggest heist in the history of the world. He is going to steal the moon. (Yes, the moon!) Gru delights in all things wicked. Armed with his arsenal of shrink rays, freeze rays, and battle-ready vehicles for land and air, he vanquishes all who stand in his way. Until the day he encounters the immense will of three little orphaned girls who look at him and see something that no one else has ever seen: a potential Dad. The world's greatest villain has just met his greatest challenge: three little girls named Margo, Edith and Agnes.",
      "rating":       "PG",
      "releaseYear":  "2010",
      "trailer":      "https://www.youtube.com/watch?v=nVwae09eSpo"
    }
    ,
    {
      "titleDisplay": "Diary of a Wimpy Kid",
      "titleFilter":  "Diary of a Wimpy Kid 1",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/DiaryofWimpyKid1.png",
      "genre":        "Comedy",
      "runTime":      "1:34:00",
      "summary":      "To Greg Heffley, middle school is the dumbest idea ever invented. It's a place rigged with hundreds of social landmines, not the least of which are morons, wedgies, swirlies, bullies, lunchtime banishment to the cafeteria floor - and a festering piece of cheese with nuclear cooties. To survive the never-ending ordeal and attain the recognition and status he feels he so richly deserves, Greg devises an endless series of can't-miss schemes, all of which, of course, go awry. And he's getting it all down on paper, via a diary - 'it's NOT a diary, it's a journal!' Greg insists, preferring the less-sissyfied designation - filled with his opinions, thoughts, tales of family trials and tribulations, and (would-be) schoolyard triumphs. 'One day when I'm famous,' writes Greg, 'I'll have better things to do than answer people's stupid questions all day.' So was born the Wimpy Kid's diary.",
      "rating":       "PG",
      "releaseYear":  "2010",
      "trailer":      "https://www.youtube.com/watch?v=7ZVEIgPeDCE"
    }
    ,
    {
      "titleDisplay": "Diary of a Wimpy Kid - Rodrick Rules",
      "titleFilter":  "Diary of a Wimpy Kid 2 - Rodrick Rules",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/DiaryofWimpyKid2.png",
      "genre":        "Comedy",
      "runTime":      "1:40:00",
      "summary":      "Wimpy Greg Heffley (Zachary Gordon), now in seventh grade, thinks he has it all together. He has mastered middle school and gotten rid of the Cheese Touch. However, Greg's older brother, Rodrick (Devon Bostick), is itching to cut him down to size. He gets the perfect opportunity when their mother (Rachael Harris) tries to force the boys to bond. Rodrick may be Greg's chief tormentor, but he feels his constant pranks are just what his little brother needs to prepare him for life's hard knocks.",
      "rating":       "PG",
      "releaseYear":  "2011",
      "trailer":      "https://www.youtube.com/watch?v=PCbGjj0aR88"
    }
    ,
    {
      "titleDisplay": "The Dream Team",
      "titleFilter":  "Dream Team, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/DreamTeam,The.png",
      "genre":        "Comedy",
      "runTime":      "1:53:00",
      "summary":      "Psychiatrist Dr. Weitzman (Dennis Boutsikaris) takes four mental patients on an outing to Yankee Stadium. Billy (Michael Keaton) is a nihilistic author, Henry (Christopher Lloyd) lost his bearings while working as a mailman, Jack (Peter Boyle) thinks he is the world's scapegoat and the childlike Albert (Stephen Furst) is obsessed with baseball broadcasts. When two corrupt cops incapacitate Dr. Weitzman, the four troubled men must fend for themselves amid the lunacy of New York City.",
      "rating":       "PG-13",
      "releaseYear":  "1989",
      "trailer":      "https://www.youtube.com/watch?v=ZFeyf3NwHPc"
    }
    ,
    {
      "titleDisplay": "Eagle Eye",
      "titleFilter":  "Eagle Eye",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/EagleEye.png",
      "genre":        "Action",
      "runTime":      "1:58:00",
      "summary":      "Jerry Shaw (Shia LaBeouf) and Rachel Holloman (Michelle Monaghan) are two strangers whose lives are suddenly thrown into turmoil by a mysterious woman they have never met. Threatening their lives and family, the unseen caller uses everyday technology to control their actions and push them into increasing danger. As events escalate, Jerry and Rachel become the country's most-wanted fugitives and must figure out what is happening to them.",
      "rating":       "PG-13",
      "releaseYear":  "2008",
      "trailer":      "https://www.youtube.com/watch?v=_wkqo_Rd3_Q"
    }
    ,
    {
      "titleDisplay": "Elf",
      "titleFilter":  "Elf",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Elf.png",
      "genre":        "Holiday, Comedy",
      "runTime":      "1:37:00",
      "summary":      "Buddy (Will Ferrell) was accidentally transported to the North Pole as a toddler and raised to adulthood among Santa's elves. Unable to shake the feeling that he doesn't fit in, the adult Buddy travels to New York, in full elf uniform, in search of his real father. As it happens, this is Walter Hobbs (James Caan), a cynical businessman. After a DNA test proves this, Walter reluctantly attempts to start a relationship with the childlike Buddy with increasingly chaotic results.",
      "rating":       "PG",
      "releaseYear":  "2003",
      "trailer":      "https://www.youtube.com/watch?v=gW9wRNqQ_P8"
    }
    ,
    {
      "titleDisplay": "Emperors New Groove",
      "titleFilter":  "Emperors New Groove",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/EmporersNewGroove,The.png",
      "genre":        "Disney, Comedy",
      "runTime":      "1:20:00",
      "summary":      "Arrogant young Emperor Kuzco is transformed into a llama by his power-hungry advisor -- the devious diva Yzma. Stranded in the jungle, Kuzco's only chance to get back home and reclaim the high life rests with a good-hearted peasant named Pacha. Together, they must return Kuzco to the throne before Yzma tracks them down and finishes him off.",
      "rating":       "G",
      "releaseYear":  "2000",
      "trailer":      "https://www.youtube.com/watch?v=ppYOZ4eFU2M"
    }
    ,
    {
      "titleDisplay": "Enchanted",
      "titleFilter":  "Enchanted",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Enchanted.png",
      "genre":        "Disney, Comedy, Romance",
      "runTime":      "1:49:00",
      "summary":      "Banished by an evil queen, Princess Giselle (Amy Adams) from a fairy-tale world lands in modern Manhattan, where music, magic and 'happily ever after' are sorely lacking. She is adrift in this strange new place until a divorce lawyer (Patrick Dempsey) comes to her aid. Giselle begins to fall for her flawed benefactor, but the storybook romance gets complicated when a prince from her world comes to rescue her.",
      "rating":       "PG",
      "releaseYear":  "2007",
      "trailer":      "https://www.youtube.com/watch?v=Zpo7nEc5FHg"
    }
    ,
    {
      "titleDisplay": "Ender's Game",
      "titleFilter":  "Ender's Game",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/EndersGame.png",
      "genre":        "Action",
      "runTime":      "1:54:00",
      "summary":      "When hostile aliens called the Formics attack Earth, only the legendary heroics of Mazer Rackham (Ben Kingsley) manage to attain a victory. To prepare for the next attack, Col. Hyrum Graff (Harrison Ford) and his cohorts initiate a military program to find the next Mazer. Recruit Ender Wiggin (Asa Butterfield) exhibits an unusual gift for the training, easily mastering all of the challenges thrown at him. Mazer Rackham, himself, takes Ender as a protege to prepare him for the oncoming war.",
      "rating":       "PG-13",
      "releaseYear":  "2013",
      "trailer":      "https://www.youtube.com/watch?v=vP0cUBi4hwE"
    }
    ,
    {
      "titleDisplay": "Evan Almighty",
      "titleFilter":  "Evan Almighty",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/EvanAlmighty.png",
      "genre":        "Comedy, Doc/Rel",
      "runTime":      "1:36:00",
      "summary":      "Newscaster Evan Baxter (Steve Carell) leaves Buffalo behind when he wins a seat in Congress. Moving his wife (Lauren Graham) and family to northern Virginia, he seems to have it made, then God (Morgan Freeman) throws a crisis of biblical proportions at his feet: The Lord wants him to build an ark and line up all the animals two-by-two in preparation for a flood.",
      "rating":       "PG",
      "releaseYear":  "2007",
      "trailer":      "https://www.youtube.com/watch?v=Y4OAUa8bo14"
    }
    ,
    {
      "titleDisplay": "Ever After",
      "titleFilter":  "Ever After",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/EverAfter.png",
      "genre":        "Drama, Romance",
      "runTime":      "2:01:00",
      "summary":      "This updated adaptation of the classic fairytale tells the story of Danielle (Drew Barrymore), a vibrant young woman who is forced into servitude after the death of her father. Danielle's stepmother Rodmilla (Anjelica Huston) is a heartless woman who forces Danielle to do the cooking and cleaning, while she tries to marry off her own two daughters. But Danielle's life takes a wonderful turn when she meets the charming Prince Henry (Dougray Scott).",
      "rating":       "PG-13",
      "releaseYear":  "1998",
      "trailer":      "https://www.youtube.com/watch?v=Hcj9fyx6DXI"
    }
    ,
    {
      "titleDisplay": "Facing the Giants",
      "titleFilter":  "Facing the Giants",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/FacingtheGiants.png",
      "genre":        "Drama, Doc/Rel",
      "runTime":      "1:52:00",
      "summary":      "Grant Taylor, a Christian high-school football coach (Alex Kendrick), gets some very bad news. Besides his and his wife's (Shannen Fields) infertility problems, he faces the attempt of local parents to force the school to replace him. His team, the Shiloh Eagles, has never had a winning season in the six years that he has coached the boys. Following a visitor's message, Grant tries to inspire his team to use faith to conquer fear and opposing teams.",
      "rating":       "PG",
      "releaseYear":  "2006",
      "trailer":      "https://www.youtube.com/watch?v=ucMh_yldxs0"
    }
    ,
    {
      "titleDisplay": "Faith Like Potatoes",
      "titleFilter":  "Faith Like Potatoes",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/FaithLikePotatoes.png",
      "genre":        "Drama, Doc/Rel",
      "runTime":      "1:56:00",
      "summary":      "Frank Rautenbach leads a strong cast as Angus Buchan, a Zambian farmer of Scottish heritage, who leaves his farm in the midst of political unrest and racially charged land reclaims and travels south with his family to start a better life in KwaZulu Natal, South Africa. With nothing more than a caravan on a patch of land, and help from his foreman, Simeon Bhengu, the Buchan family struggle to settle in a new country. Faced with ever mounting challenges, hardships and personal turmoil, Angus quickly spirals down into a life consumed by anger, fear and destruction. Based on the inspiring true story by Angus Buchan the book was adapted for the big screen by Regardt van den Bergh and weaves together the moving life journey of a man who, like his potatoes, grows his faith, unseen until the harvest.",
      "rating":       "PG",
      "releaseYear":  "2006",
      "trailer":      "https://www.youtube.com/watch?v=C8YAzrssT8c"
    }
    ,
    {
      "titleDisplay": "Fantasia 2000",
      "titleFilter":  "Fantasia 2000",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Fantasia2000.png",
      "genre":        "Disney, Kids",
      "runTime":      "1:15:00",
      "summary":      "'Fantasia/2000' continues and builds upon Walt Disney's original idea with the creation of a new musical program interpreted by a group of distinguished Disney artists and storytellers. Adding to the fun and entertainment, celebrity hosts from the various arts appear on screen to introduce each of the segments. Included in that prestigious group are Steve Martin, Itzhak Perlman, Bette Midler, Quincy Jones, James Earl Jones, Penn & Teller and Angela Lansbury.",
      "rating":       "G",
      "releaseYear":  "1999",
      "trailer":      "https://www.youtube.com/watch?v=8810M5aZoGA"
    }
    ,
    {
      "titleDisplay": "The Fantastic Four - Rise of the Silver Surfer",
      "titleFilter":  "Fantastic Four 2 - Rise of the Silver Surfer",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/FantasticFour2.png",
      "genre":        "Action, Fantasy",
      "runTime":      "1:33:00",
      "summary":      "Reed (Ioan Gruffudd), Susan (Jessica Alba), Johnny (Chris Evans) and Ben (Michael Chiklis) face an intergalactic messenger who has arrived to prepare Earth for its destruction. While the enigmatic being wreaks havoc around the world, the heroic quartet must also contend with the unexpected return of their enemy, Victor Von Doom.",
      "rating":       "PG",
      "releaseYear":  "2007",
      "trailer":      "https://www.youtube.com/watch?v=74oUIzqhwVQ"
    }
    ,
    {
      "titleDisplay": "Far and Away",
      "titleFilter":  "Far and Away",
      "editedFlag":   false,
      "toEditFlag":   true,
      "imgPath":      "img/FarandAway.png",
      "genre":        "Drama, Romance",
      "runTime":      "2:30:00",
      "summary":      "Joseph (Tom Cruise) and his landlord's daughter, Shannon (Nicole Kidman), travel from Ireland to America in hopes of claiming free land in Oklahoma. The pair get sidetracked in Boston, where Joseph takes up boxing to support himself. When he loses a pivotal fight, the two are left penniless. Now faced with poverty, the two must find new ways to scrape by. As their affection for each other grows, Joseph questions whether he is truly what Shannon needs in her life.",
      "rating":       "PG-13",
      "releaseYear":  "1992",
      "trailer":      "https://www.youtube.com/watch?v=TnrqzfqSM1o"
    }
    ,
    {
      "titleDisplay": "Finding Nemo",
      "titleFilter":  "Finding Nemo",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Finding Nemo.png",
      "genre":        "Disney, Drama",
      "runTime":      "1:40:00",
      "summary":      "A clown fish named Marlin lives in the Great Barrier Reef loses his son, Nemo. After he ventures into the open sea, despite his father's constant warnings about many of the ocean's dangers. Nemo is abducted by a boat and netted up and sent to a dentist's office in Sydney. So, while Marlin ventures off to try to retrieve Nemo, Marlin meets a fish named Dory, a blue tang suffering from short-term memory loss. The companions travel a great distance, encountering various dangerous sea creatures such as sharks, anglerfish and jellyfish, in order to rescue Nemo from the dentist's office, which is situated by Sydney Harbor. While the two are doing this, Nemo and the other sea animals in the dentist's fish tank plot a way to return to Sydney Harbor to live their lives free again.",
      "rating":       "G",
      "releaseYear":  "2003",
      "trailer":      "https://www.youtube.com/watch?v=wZdpNglLbt8"
    }
    ,
    {
      "titleDisplay": "Fireproof",
      "titleFilter":  "Fireproof",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Fireproof.png",
      "genre":        "Drama, Romance, Doc/Rel",
      "runTime":      "2:02:00",
      "summary":      "In the wake of his daring rescue of a complete stranger, decorated firefighter Caleb Holt (Kirk Cameron) realizes the extent to which he has failed as a husband. In a desperate attempt to save his relationship with his wife, Catherine (Erin Bethea), Holt turns to 'The Love Dare,' a Christian self-help book. At the prompting of his devout father, John (Harris Malcom) -- and guided by the book itself -- Holt embarks on a 40-day mission to rescue his marriage from the looming specter of divorce.",
      "rating":       "PG",
      "releaseYear":  "2008",
      "trailer":      "https://www.youtube.com/watch?v=YK5-5qf9IQs"
    }
    ,
    {
      "titleDisplay": "First Knight",
      "titleFilter":  "First Knight",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/FirstKnight.png",
      "genre":        "Action, Romance",
      "runTime":      "2:14:00",
      "summary":      "Handsome swordsman Lancelot (Richard Gere) is incredibly skilled at fighting, but when he meets the lovely Guinevere (Julia Ormond), he can't seem to get past her defenses. She is betrothed to King Arthur (Sean Connery) and plans to go ahead with the wedding, despite her attraction to Lancelot. When the devious warrior Malagant (Ben Cross) rises up against Arthur, Lancelot must try to put his feelings aside and defend his king, Guinevere and all of Camelot.",
      "rating":       "PG-13",
      "releaseYear":  "1995",
      "trailer":      "https://www.youtube.com/watch?v=zO1_r6slUlk"
    }
    ,
    {
      "titleDisplay": "The First Wives Club",
      "titleFilter":  "First Wives Club, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/firstWivesClub.png",
      "genre":        "Comedy, Romance",
      "runTime":      "1:44:00",
      "summary":      "Despondent over the marriage of her ex-husband to a younger woman, a middle-aged divorcée plunges to her death from her penthouse. At the woman's funeral, her former college friends (Bette Midler, Goldie Hawn, Diane Keaton) reunite for the first time in nearly 30 years. When the three discover the reason for their friend's suicide, they realize that all of their ex-husbands have taken them for granted -- and deciding it's time for revenge, they make a pact to get back at their exes.",
      "rating":       "PG",
      "releaseYear":  "1996",
      "trailer":      "https://www.youtube.com/watch?v=AI5OgeZt020"
    }
    ,
    {
      "titleDisplay": "Flight Plan",
      "titleFilter":  "Flight Plan",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Flightplan.png",
      "genre":        "Action, Drama",
      "runTime":      "1:38:00",
      "summary":      "Airplane engineer Kyle Pratt (Jodie Foster) is heading home from Germany to New York on a double-decker Elgin 474 to bury her husband. But three hours into the flight, she awakens to find her young daughter missing -- and the entire flight crew, including Capt. Rich (Sean Bean) and Air Marshal Gene Carson (Peter Sarsgaard), claims that the child was never on board. Determined to find her daughter, Kyle searches the limited space of the plane, all the while trying to maintain her sanity.",
      "rating":       "PG-13",
      "releaseYear":  "2005",
      "trailer":      "https://www.youtube.com/watch?v=OHukIo3qVy4"
    }
    ,
    {
      "titleDisplay": "Forever Young",
      "titleFilter":  "Forever Young",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/ForeverYoung.png",
      "genre":        "Romance, Comedy, Fantasy",
      "runTime":      "1:42:00",
      "summary":      "After his true love (Isabel Glasser) falls in a coma, test pilot Daniel McCormick (Mel Gibson) undergoes suspended animation in a military experiment conducted by his friend Harry Finley (George Wendt), supposed to last a year. A series of mishaps result in McCormick's being all but forgotten and, 53 years later, a young boy (Elijah Wood) accidentally frees a confused McCormick, who eventually lives with him and his mother (Jamie Lee Curtis). However, complications arise from the experiment.",
      "rating":       "PG",
      "releaseYear":  "1992",
      "trailer":      "https://www.youtube.com/watch?v=MSPRkTIa28w"
    }
    ,
    {
      "titleDisplay": "The Four Feathers",
      "titleFilter":  "Four Feathers, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/FourFeathers.png",
      "genre":        "Drama, Action",
      "runTime":      "2:12:00",
      "summary":      "The story, set in 1875, follows a British officer (Heath Ledger) who resigns his post when he learns of his regiment's plan to ship out to the Sudan for the conflict with the Mahdi. His friends and fiancée send him four white feathers which symbolize cowardice. To redeem his honor he disguises himself as an Arab and secretly saves the lives of those who branded him a coward.",
      "rating":       "PG-13",
      "releaseYear":  "2002",
      "trailer":      "https://www.youtube.com/watch?v=tQ_MrNPOzG4"
    }
    ,
    {
      "titleDisplay": "Frozen",
      "titleFilter":  "Frozen",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Frozen.png",
      "genre":        "Disney, Comedy",
      "runTime":      "1:49:00",
      "summary":      "When their kingdom becomes trapped in perpetual winter, fearless Anna (Kristen Bell) joins forces with mountaineer Kristoff (Jonathan Groff) and his reindeer sidekick to find Anna's sister, Snow Queen Elsa (Idina Menzel), and break her icy spell. Although their epic journey leads them to encounters with mystical trolls, a comedic snowman (Josh Gad), harsh conditions, and magic at every turn, Anna and Kristoff bravely push onward in a race to save their kingdom from winter's cold grip.",
      "rating":       "PG",
      "releaseYear":  "2013",
      "trailer":      "https://www.youtube.com/watch?v=TbQm5doF_Uc"
    }
    ,
    {
      "titleDisplay": "Funny Girl",
      "titleFilter":  "Funny Girl",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/FunnyGirl.png",
      "genre":        "Drama, Romance, Music",
      "runTime":      "2:35:00",
      "summary":      "In this bittersweet, classic musical drama, the vibrant and beautiful young Fanny Brice (Barbra Streisand) starts out as a bit player on the New York City vaudeville stage, but works her way up to stardom on Broadway. Valued for her vocal and comedic talents by the renowned theater impresario Florenz Ziegfeld (Walter Pidgeon), Fanny thrives, but her relationship with her suave, imprisoned businessman husband, Nick Arnstein (Omar Sharif), is another story.",
      "rating":       "G",
      "releaseYear":  "1968",
      "trailer":      "https://www.youtube.com/watch?v=w5H3Z-lTtCs"
    }
    ,
    {
      "titleDisplay": "Funny Lady",
      "titleFilter":  "Funny Lady",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/FunnyLady.png",
      "genre":        "Drama, Music",
      "runTime":      "2:16:00",
      "summary":      "In this sequel to 'Funny Girl,' Fanny Brice (Barbra Streisand) is now a huge star on Broadway whose fortunes have taken a hit from the Great Depression. After a whirlwind romance, Fanny marries Billy Rose (James Caan), and the two agree to collaborate on a show. Despite the show's early struggles, Fanny makes it a success, but the sudden fame puts a strain on her marriage -- especially when Billy learns she still has feelings for her ex-husband, Nick (Omar Sharif).",
      "rating":       "PG",
      "releaseYear":  "1975",
      "trailer":      "https://www.youtube.com/watch?v=HpEMvTWLdBQ"
    }
    ,
    {
      "titleDisplay": "The Game Plan",
      "titleFilter":  "Game Plan, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/GamePlan.png",
      "genre":        "Comedy, Disney",
      "runTime":      "1:52:00",
      "summary":      "Bachelor football star Joe Kingman (Dwayne 'The Rock' Johnson) seems to have it all. He is wealthy and carefree, and his team is on the way to capturing a championship. Suddenly, he is tackled by some unexpected news: He has a young daughter (Madison Pettis), the result of a last fling with his ex-wife. Joe must learn to balance his personal and professional lives with the needs of his child.",
      "rating":       "PG",
      "releaseYear":  "2007",
      "trailer":      "https://www.youtube.com/watch?v=okZ4S4yjvlw"
    }
    ,
    {
      "titleDisplay": "Get Smart",
      "titleFilter":  "Get Smart",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/GetSmart.png",
      "genre":        "Comedy, Action",
      "runTime":      "1:51:00",
      "summary":      "When members of the nefarious crime syndicate KAOS attack the U.S. spy agency Control, the Chief (Alan Arkin) has to promote his eager analyst Maxwell Smart (Steve Carell) to field agent. Smart, partnered with veteran Agent 99 (Anne Hathaway), blends inexperience, enthusiasm and ineptitude as he works to thwart a world-domination plot hatched by the wily KAOS chief, Siegfried (Terence Stamp).",
      "rating":       "PG-13",
      "releaseYear":  "2008",
      "trailer":      "https://www.youtube.com/watch?v=K9WNBO3szgQ"
    }
    ,
    {
      "titleDisplay": "Gifted Hands",
      "titleFilter":  "Gifted Hands",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/GiftedHands.png",
      "genre":        "Drama",
      "runTime":      "1:30:00",
      "summary":      "Inspired by his mother (Kimberly Elise) to never give up, Detroit native Ben Carson (Cuba Gooding Jr.) overcomes poverty and prejudice to become a neurosurgeon.",
      "rating":       "PG",
      "releaseYear":  "2009",
      "trailer":      "https://www.youtube.com/watch?v=UDHfdbFRIVU"
    }
    ,
    {
      "titleDisplay": "The Giver",
      "titleFilter":  "Giver, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/GiverThe.png",
      "genre":        "Drama, Action",
      "runTime":      "1:40:00",
      "summary":      "Jonas (Brenton Thwaites) lives in a seemingly idyllic world of conformity and contentment. When he begins to spend time with The Giver (Jeff Bridges), an old man who is the sole keeper of the community's memories, Jonas discovers the dangerous truths of his community's secret past. Armed with the power of knowledge, Jonas realizes that he must escape from their world to protect himself and those he loves -- a challenge no one has ever completed successfully.",
      "rating":       "PG-13",
      "releaseYear":  "2014",
      "trailer":      "https://www.youtube.com/watch?v=iJNNugNe0Wo"
    }
    ,
    {
      "titleDisplay": "The Guardian",
      "titleFilter":  "Guardian, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/GuardianThe.png",
      "genre":        "Drama, Action",
      "runTime":      "2:19:00",
      "summary":      "A Coast Guard rescue swimmer (Kevin Costner), who still mourns losing his crew in a fatal accident, copes by dedicating his life to training new recruits, so when he meets swimming champion Jake Fischer (Ashton Kutcher), he molds the cocky young man into his protege and takes him on a mission in the dangerous waters of the Bering Strait.",
      "rating":       "PG-13",
      "releaseYear":  "2006",
      "trailer":      "https://www.youtube.com/watch?v=tZy-wcQIsRU"
    }
    ,
    {
      "titleDisplay": "Hairspray",
      "titleFilter":  "Hairspray",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Hairspray.png",
      "genre":        "Comedy, Music",
      "runTime":      "2:00:00",
      "summary":      "In 1960s Baltimore, dance-loving teen Tracy Turnblad (Nikki Blonsky) auditions for a spot on 'The Corny Collins Show' and wins. She becomes an overnight celebrity, a trendsetter in dance, fun and fashion. Perhaps her new status as a teen sensation is enough to topple Corny's reigning dance queen and bring racial integration to the show.",
      "rating":       "PG",
      "releaseYear":  "2007",
      "trailer":      "https://www.youtube.com/watch?v=iJ53mRO80c0"
    }
    ,
    
    {
      "titleDisplay": "Hercules",
      "titleFilter":  "Hercules",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Hercules.png",
      "genre":        "Disney, Romance",
      "runTime":      "1:33:00",
      "summary":      "Disney tackles Greek mythology in this animated feature. Hercules (Tate Donovan), a son of gods, was snatched as a baby by Hades (James Woods) and forced to live among mortals as a half-man, half-god. Now a teenager, Hercules needs to perform a rite of passage on Earth to prove himself worthy of living with the gods on Mount Olympus. With his plucky satyr sidekick, Philoctetes (Danny DeVito), along for the ride, Hercules must learn how to use his strength to defeat a series of evil creatures.",
      "rating":       "G",
      "releaseYear":  "1997",
      "trailer":      "https://www.youtube.com/watch?v=yIAvF8hFEYM"
    }
    ,
    {
      "titleDisplay": "Hocus Pocus",
      "titleFilter":  "Hocus Pocus",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/HocusPocus.png",
      "genre":        "Disney, Holiday, Comedy",
      "runTime":      "1:36:00",
      "summary":      "After moving to Salem, Mass., teenager Max Dennison (Omri Katz) explores an abandoned house with his sister Dani (Thora Birch) and their new friend, Allison (Vinessa Shaw). After dismissing a story Allison tells as superstitious, Max accidentally frees a coven of evil witches (Bette Midler, Sarah Jessica Parker, Kathy Najimy) who used to live in the house. Now, with the help of a magical cat, the kids must steal the witches' book of spells to stop them from becoming immortal.",
      "rating":       "PG",
      "releaseYear":  "1993",
      "trailer":      "https://www.youtube.com/watch?v=2UUMsInka2s"
    }
    ,
    {
      "titleDisplay": "Home Alone",
      "titleFilter":  "Home Alone",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/HomeAlone.png",
      "genre":        "Holiday, Comedy",
      "runTime":      "1:53:00",
      "summary":      "When bratty 8-year-old Kevin McCallister (Macaulay Culkin) acts out the night before a family trip to Paris, his mother (Catherine O'Hara) makes him sleep in the attic. After the McCallisters mistakenly leave for the airport without Kevin, he awakens to an empty house and assumes his wish to have no family has come true. But his excitement sours when he realizes that two con men (Joe Pesci, Daniel Stern) plan to rob the McCallister residence, and that he alone must protect the family home.",
      "rating":       "PG",
      "releaseYear":  "1990",
      "trailer":      "https://www.youtube.com/watch?v=CK2Btk6Ybm0"
    }
    ,
    {
      "titleDisplay": "How to Train Your Dragon",
      "titleFilter":  "How to Train Your Dragon 1",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/HowToTrainYourDragon.png",
      "genre":        "Disney, Comedy, Action",
      "runTime":      "1:38:00",
      "summary":      "Hiccup (Jay Baruchel) is a Norse teenager from the island of Berk, where fighting dragons is a way of life. His progressive views and weird sense of humor make him a misfit, despite the fact that his father (Gerard Butler) is chief of the clan. Tossed into dragon-fighting school, he endeavors to prove himself as a true Viking, but when he befriends an injured dragon he names Toothless, he has the chance to plot a new course for his people's future.",
      "rating":       "PG",
      "releaseYear":  "2010",
      "trailer":      "https://www.youtube.com/watch?v=oKiYuIsPxYk"
    }
    ,
    {
      "titleDisplay": "How to Train Your Dragon 2",
      "titleFilter":  "How to Train Your Dragon 2",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/HowToTrainYourDragon2.png",
      "genre":        "Disney, Comedy, Action",
      "runTime":      "1:45:00",
      "summary":      "Five years have passed since Hiccup and Toothless united the dragons and Vikings of Berk. Now, they spend their time charting the island's unmapped territories. During one of their adventures, the pair discover a secret cave that houses hundreds of wild dragons -- and a mysterious dragon rider who turns out to be Hiccup's long-lost mother, Valka (Cate Blanchett). Hiccup and Toothless then find themselves at the center of a battle to protect Berk from a power-hungry warrior named Drago.",
      "rating":       "PG",
      "releaseYear":  "2014",
      "trailer":      "https://www.youtube.com/watch?v=Z9a4PvzlqoQ"
    }
    ,
    {
      "titleDisplay": "The Hundred-Foot Journey",
      "titleFilter":  "Hundred-Foot Journey, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/hundredFootJourney.png",
      "genre":        "Drama, Comedy, Romance",
      "runTime":      "2:04:00",
      "summary":      "Hassan Kadam (Manish Dayal) is an extraordinarily talented and largely self-taught culinary novice. When he and his family are displaced from their native India and settle in a quaint French village, they decide to open an Indian eatery. However, Madame Mallory (Helen Mirren), the proprietress of an acclaimed restaurant just 100 feet away, strongly objects. War erupts between the two establishments, until Mallory recognizes Kadam's impressive epicurean gifts and takes him under her wing.",
      "rating":       "PG",
      "releaseYear":  "2014",
      "trailer":      "https://www.youtube.com/watch?v=yEO1TWeM5JU"
    }
    ,
    {
      "titleDisplay": "The Hunger Games 2 - Catching Fire",
      "titleFilter":  "Hunger Games 2 - Catching Fire, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/catchingFire.png",
      "genre":        "Drama, Action",
      "runTime":      "2:26:00",
      "summary":      "After arriving safely home from their unprecedented victory in the 74th Annual Hunger Games, Katniss Everdeen (Jennifer Lawrence) and Peeta Mellark (Josh Hutcherson) discover that they must do a quick turnaround and begin a Victors Tour. As she and Peeta travel throughout the districts, Katniss senses a rebellion is stirring. However, President Snow (Donald Sutherland) proves that he is still very much in control when word comes of a cruel change in the rules for the upcoming 75th Hunger Games.",
      "rating":       "PG-13",
      "releaseYear":  "2013",
      "trailer":      "https://www.youtube.com/watch?v=MkvUNfySGQU"
    }
    ,
    {
      "titleDisplay": "The Hunger Games 3 - MockingJay Part 1",
      "titleFilter":  "Hunger Games 3 - MockingJay Part 1, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/mockingJayOne.png",
      "genre":        "Drama, Action",
      "runTime":      "2:03:00",
      "summary":      "Following her rescue from the devastating Quarter Quell, Katniss (Jennifer Lawrence) awakes in the complex beneath the supposedly destroyed District 13. Her home, District 12, has been reduced to rubble, and Peeta Mellark (Josh Hutcherson) is now the brainwashed captive of President Snow (Donald Sutherland). At the same time, Katniss also learns about a secret rebellion spreading throughout all of Panem -- a rebellion that will place her at the center of a plot to turn the tables on Snow.",
      "rating":       "PG-13",
      "releaseYear":  "2014",
      "trailer":      "https://www.youtube.com/watch?v=3PkkHsuMrho"
    }
    ,
    {
      "titleDisplay": "The Hunt for Red October",
      "titleFilter":  "Hunt for Red October, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/huntForRedOctober.png",
      "genre":        "Action",
      "runTime":      "2:15:00",
      "summary":      "Based on the popular Tom Clancy novel, this suspenseful movie tracks Soviet submarine captain Marko Ramius (Sean Connery) as he abandons his orders and heads for the east coast of the United States. Equipped with innovative stealth technology, Ramius' submarine, 'Red October,' is virtually invisible. However, when an American sub briefly detects the Russians' presence, CIA agent Jack Ryan (Alec Baldwin) sets out to determine Ramius' motives, fearing he may launch an attack on the U.S.",
      "rating":       "PG",
      "releaseYear":  "1990",
      "trailer":      "https://www.youtube.com/watch?v=kxL8uBmdulY"
    }
    ,
    {
      "titleDisplay": "I Robot",
      "titleFilter":  "I Robot",
      "editedFlag":   false,
      "toEditFlag":   true,
      "imgPath":      "img/iRobot.png",
      "genre":        "Action",
      "runTime":      "1:55:00",
      "summary":      "In 2035, highly intelligent robots fill public service positions throughout the world, operating under three rules to keep humans safe. Despite his dark history with robotics, Detective Del Spooner (Will Smith) investigates the alleged suicide of U.S. Robotics founder Alfred Lanning (James Cromwell) and believes that a human-like robot (Alan Tudyk) murdered him. With the help of a robot expert (Bridget Moynahan), Spooner discovers a conspiracy that may enslave the human race.",
      "rating":       "PG-13",
      "releaseYear":  "2004",
      "trailer":      "https://www.youtube.com/watch?v=s0f3JeDVeEo"
    }
    ,
    {
      "titleDisplay": "Ice Age",
      "titleFilter":  "Ice Age",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/iceAge.png",
      "genre":        "Disney",
      "runTime":      "1:25:00",
      "summary":      "Twenty-thousand years ago, Earth is a wondrous, prehistoric world filled with great danger, not the least of which is the beginning of the Ice Age. To avoid a really bad frostbite, the planet's majestic creatures - and a few small, slothful ones - begin migrating south . The story revolves around sub-zero heroes: a woolly mammoth, a saber-toothed tiger, a sloth and a prehistoric combination of a squirrel and rat, known as Scrat.",
      "rating":       "PG",
      "releaseYear":  "2002",
      "trailer":      "https://www.youtube.com/watch?v=5utbt2Ycenw"
    }
    ,
    {
      "titleDisplay": "The Illusionist",
      "titleFilter":  "Illusionist, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Illusionist.png",
      "genre":        "Drama",
      "runTime":      "1:50:00",
      "summary":      "A master magician named Eisenheim (Edward Norton) vies with Crown Prince Leopold (Rufus Sewell) of Vienna for the hand of noblewoman Sophie (Jessica Biel), the girl he once loved. He brings his considerable powers to bear on the prince, as she is about to be named royal fiancee. However, a police inspector named Uhl (Paul Giamatti) tries to warn Eisenheim that he is playing a very dangerous game.",
      "rating":       "PG-13",
      "releaseYear":  "2006",
      "trailer":      "https://www.youtube.com/watch?v=SpIK6eqop18"
    }
    ,
    {
      "titleDisplay": "Inside Out",
      "titleFilter":  "Inside Out",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/insideOut.png",
      "genre":        "Disney, Comedy",
      "runTime":      "1:42:00",
      "summary":      "Riley (Kaitlyn Dias) is a happy, hockey-loving 11-year-old Midwestern girl, but her world turns upside-down when she and her parents move to San Francisco. Riley's emotions -- led by Joy (Amy Poehler) -- try to guide her through this difficult, life-changing event. However, the stress of the move brings Sadness (Phyllis Smith) to the forefront. When Joy and Sadness are inadvertently swept into the far reaches of Riley's mind, the only emotions left in Headquarters are Anger, Fear and Disgust.",
      "rating":       "PG",
      "releaseYear":  "2015",
      "trailer":      "https://www.youtube.com/watch?v=_MC3XuMvsDI"
    }
    ,
    {
      "titleDisplay": "Interstellar",
      "titleFilter":  "Interstellar",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/interstellar.png",
      "genre":        "Drama",
      "runTime":      "2:49:00",
      "summary":      "In Earth's future, a global crop blight and second Dust Bowl are slowly rendering the planet uninhabitable. Professor Brand (Michael Caine), a brilliant NASA physicist, is working on plans to save mankind by transporting Earth's population to a new home via a wormhole. But first, Brand must send former NASA pilot Cooper (Matthew McConaughey) and a team of researchers through the wormhole and across the galaxy to find out which of three planets could be mankind's new home.",
      "rating":       "PG-13",
      "releaseYear":  "2014",
      "trailer":      "https://www.youtube.com/watch?v=0vxOhd4qlnA"
    }
    ,
    {
      "titleDisplay": "The Iron Giant",
      "titleFilter":  "Iron Giant, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/ironGiant.png",
      "genre":        "Disney",
      "runTime":      "2:00:00",
      "summary":      "In this animated adaptation of Ted Hughes' Cold War fable, a giant alien robot (Vin Diesel) crash-lands near the small town of Rockwell, Maine, in 1957. Exploring the area, a local 9-year-old boy, Hogarth, discovers the robot, and soon forms an unlikely friendship with him. When a paranoid government agent, Kent Mansley, becomes determined to destroy the robot, Hogarth and beatnik Dean McCoppin (Harry Connick Jr.) must do what they can to save the misunderstood machine.",
      "rating":       "PG",
      "releaseYear":  "2004",
      "trailer":      "https://www.youtube.com/watch?v=JgjmFBX34zc"
    }
    ,
    {
      "titleDisplay": "Jack Ryan - Shadow Recruit",
      "titleFilter":  "Jack Ryan - Shadow Recruit",
      "editedFlag":   false,
      "toEditFlag":   true,
      "imgPath":      "img/jackRyanShadowRecruit.png",
      "genre":        "Action",
      "runTime":      "1:45:00",
      "summary":      "To his friends and loved ones, young Jack Ryan (Chris Pine) appears to be an ordinary executive; however, he has secretly worked for the CIA for years. Ryan was originally brought in to crunch global data, but when he uncovers a carefully planned scheme to crash the U.S. economy and spark global chaos, he becomes the only man with the skills to stop it. Now a full operative, Ryan finds himself caught between his secretive handler, his clueless fiancee and a brilliant Russian leader.",
      "rating":       "PG-13",
      "releaseYear":  "2014",
      "trailer":      "https://www.youtube.com/watch?v=K9KAnx4EvaE"
    }
    ,
    {
      "titleDisplay": "Julie and Julia",
      "titleFilter":  "Julie and Julia",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/julieAndJulia.png",
      "genre":        "Drama",
      "runTime":      "2:03:00",
      "summary":      "Frustrated with a soul-killing job, New Yorker Julie Powell (Amy Adams) embarks on a daring project: she vows to prepare all 524 recipes in Julia Childs' landmark cookbook, 'Mastering the Art of French Cooking.' Intertwined with Julie's story is the true tale of how Julia Child (Meryl Streep) herself conquered French cuisine with passion, fearlessness, and plenty of butter.",
      "rating":       "PG-13",
      "releaseYear":  "2009",
      "trailer":      "https://www.youtube.com/watch?v=ozRK7VXQl-k"
    }
    ,
    {
      "titleDisplay": "Jumanji",
      "titleFilter":  "Jumanji",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/jumanji.png",
      "genre":        "Suspense",
      "runTime":      "1:44:00",
      "summary":      "A magical board game unleashes a world of adventure on siblings Peter (Bradley Pierce) and Judy Shepherd (Kirsten Dunst). While exploring an old mansion, the youngsters find a curious, jungle-themed game called Jumanji in the attic. When they start playing, they free Alan Parrish (Robin Williams), who's been stuck in the game's inner world for decades. If they win Jumanji, the kids can free Alan for good -- but that means braving giant bugs, ill-mannered monkeys and even stampeding rhinos!",
      "rating":       "PG",
      "releaseYear":  "1995",
      "trailer":      "https://www.youtube.com/watch?v=OJKHQLM8AbM"
    }
    ,
    {
      "titleDisplay": "Jurassic Park 1",
      "titleFilter":  "Jurassic Park 1",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/jurassicPark.png",
      "genre":        "Action",
      "runTime":      "2:07:00",
      "summary":      "In Steven Spielberg's massive blockbuster, paleontologists Alan Grant (Sam Neill) and Ellie Sattler (Laura Dern) and mathematician Ian Malcolm (Jeff Goldblum) are among a select group chosen to tour an island theme park populated by dinosaurs created from prehistoric DNA. While the park's mastermind, billionaire John Hammond (Richard Attenborough), assures everyone that the facility is safe, they find out otherwise when various ferocious predators break free and go on the hunt.",
      "rating":       "PG-13",
      "releaseYear":  "1993",
      "trailer":      "https://www.youtube.com/watch?v=lc0UehYemQA"
    }
    ,
    {
      "titleDisplay": "The Karate Kid",
      "titleFilter":  "Karate Kid, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/karateKidNew.png",
      "genre":        "Drama, Comedy",
      "runTime":      "2:13:00",
      "summary":      "When his mother's career results in a move to China, 12-year-old Dre Parker (Jaden Smith) finds that he is a stranger in a strange land. Though he knows a little karate, his fighting skills are no match for Cheng, the school bully. Dre finds a friend in Mr. Han (Jackie Chan), a maintenance man who is also a martial-arts master. Mr. Han teaches Dre all about kung fu in the hope that Dre will be able to face down Cheng and perhaps win the heart of a pretty classmate named Mei Ying.",
      "rating":       "PG",
      "releaseYear":  "2010",
      "trailer":      "https://www.youtube.com/watch?v=sue5Olg7GlY"
    }
    ,
    {
      "titleDisplay": "Kate and Leopold",
      "titleFilter":  "Kate and Leopold",
      "editedFlag":   false,
      "toEditFlag":   true,
      "imgPath":      "img/kateAndLeopold.png",
      "genre":        "Romance, Comedy",
      "runTime":      "2:03:00",
      "summary":      "Kate McKay (Meg Ryan) is a modern day executive, a 21st century woman driven to succeed in the corporate world. Leopold, the third Duke of Albany, is a charming gent and bachelor of the late 18OOs. With career and social expectations looming, each has grown cynical about the very notion of falling in love. But when a rip in the fabric of time thrusts Leopold into present day New York, the potential for an old-fashioned modern romance ignites.",
      "rating":       "PG-13",
      "releaseYear":  "2001",
      "trailer":      "https://www.youtube.com/watch?v=TtQ1s_azFnQ"
    }
    ,
    {
      "titleDisplay": "Knight and Day",
      "titleFilter":  "Knight and Day",
      "editedFlag":   false,
      "toEditFlag":   true,
      "imgPath":      "img/knightAndDay.png",
      "genre":        "Action, Romance",
      "runTime":      "1:50:00",
      "summary":      "June Havens (Cameron Diaz) chats up her charming seatmate on a flight out of Kansas, but she doesn't realize that she will soon land in the middle of an international adventure. The fellow passenger, Roy Miller (Tom Cruise), is a covert operative who claims he has been set up to take a fall. Now his reluctant partner, June must dodge bullets in Boston, leap rooftops in Austria and evade bulls in Spain, while she and Roy learn that trust is the most important survival skill.",
      "rating":       "PG-13",
      "releaseYear":  "2010",
      "trailer":      "https://www.youtube.com/watch?v=JGPl86DBNNs"
    }
    ,
    {
      "titleDisplay": "Krueger Christmas",
      "titleFilter":  "Krueger Christmas",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/kruegerChristmas.png",
      "genre":        "Holiday",
      "runTime":      "0:26:00",
      "summary":      "Mr. Krueger's Christmas is a 1980 Christmas television special produced by The Church of Jesus Christ of Latter-day Saints starring James Stewart, directed by Kieth Merrill and featuring the Mormon Tabernacle Choir.",
      "rating":       "G",
      "releaseYear":  "1980",
      "trailer":      ""
    }
    ,
    {
      "titleDisplay": "The Land Before Time",
      "titleFilter":  "Land Before Time, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/landBeforeTime.png",
      "genre":        "Disney",
      "runTime":      "1:29:00",
      "summary":      "Littlefoot (Gabriel Damon), a young plant-eating dinosaur, is orphaned after his mother (Helen Shaver) perishes while protecting him from a vicious carnivore. With her last breath, she tells him how to get to the legendary Great Valley, where he will be reunited with others of his kind. With his friend Cera (Candace Hutson), Littlefoot sets out for the fabled land, meeting a variety of new friends along the way -- while also being tracked by the killer dinosaur that mortally wounded his mother.",
      "rating":       "G",
      "releaseYear":  "1988",
      "trailer":      "https://www.youtube.com/watch?v=FBaGXDRNnQI"
    }
    ,
    {
      "titleDisplay": "Leap Year",
      "titleFilter":  "Leap Year",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/leapYear.png",
      "genre":        "Romance",
      "runTime":      "1:40:00",
      "summary":      "When yet another anniversary passes without a marriage proposal from her boyfriend, Anna (Amy Adams) decides to take action. Aware of a Celtic tradition that allows women to pop the question on Feb. 29, she plans to follow her lover to Dublin and ask him to marry her. Fate has other plans, however, and Anna winds up on the other side of the Emerald Isle with handsome, but surly, Declan -- an Irishman who may just lead Anna down the road to true love.",
      "rating":       "PG",
      "releaseYear":  "2010",
      "trailer":      "https://www.youtube.com/watch?v=HrlQBsd8LsE"
    }
    ,
    {
      "titleDisplay": "The Lego Movie",
      "titleFilter":  "Lego Movie, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/legoMovie.png",
      "genre":        "Disney, Comedy",
      "runTime":      "1:41:00",
      "summary":      "Emmet (Chris Pratt), an ordinary LEGO figurine who always follows the rules, is mistakenly identified as the Special -- an extraordinary being and the key to saving the world. He finds himself drafted into a fellowship of strangers who are on a mission to stop an evil tyrant's (Will Ferrell) plans to conquer the world. Unfortunately for Emmet, he is hopelessly -- and hilariously -- unprepared for such a task, but he'll give it his all nonetheless.",
      "rating":       "PG",
      "releaseYear":  "2014",
      "trailer":      "https://www.youtube.com/watch?v=fZ_JOBCLF-I"
    }
    ,
    {
      "titleDisplay": "Letters to Juliet",
      "titleFilter":  "Letters to Juliet",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/lettersToJuliet.png",
      "genre":        "Romance",
      "runTime":      "1:45:00",
      "summary":      "While visiting Verona, Italy, with her busy fiance, a young woman named Sophie (Amanda Seyfried) visits a wall where the heartbroken leave notes to Shakespeare's tragic heroine, Juliet Capulet. Finding one such letter from 1957, Sophie decides to write to its now elderly author, Claire (Vanessa Redgrave). Inspired by Sophie's actions, Claire sets out to find her long-lost lover, accompanied by her disapproving grandson (Christopher Egan) and Sophie.",
      "rating":       "PG",
      "releaseYear":  "2010",
      "trailer":      "https://www.youtube.com/watch?v=prc50Uod_vQ"
    }
    ,
    {
      "titleDisplay": "The Lion King",
      "titleFilter":  "Lion King 1, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/lionKing.png",
      "genre":        "Disney, Music",
      "runTime":      "1:29:00",
      "summary":      "This Disney animated feature follows the adventures of the young lion Simba (Jonathan Taylor Thomas), the heir of his father, Mufasa (James Earl Jones). Simba's wicked uncle, Scar (Jeremy Irons), plots to usurp Mufasa's throne by luring father and son into a stampede of wildebeests. But Simba escapes, and only Mufasa is killed. Simba returns as an adult (Matthew Broderick) to take back his homeland from Scar with the help of his friends Timon (Nathan Lane) and Pumbaa (Ernie Sabella).",
      "rating":       "G",
      "releaseYear":  "1994",
      "trailer":      "https://www.youtube.com/watch?v=4sj1MT05lAA"
    }
    ,
    {
      "titleDisplay": "The Little Mermaid",
      "titleFilter":  "Little Mermaid, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/littleMermaid.png",
      "genre":        "Disney",
      "runTime":      "1:32:00",
      "summary":      "In Disney's beguiling animated romp, rebellious 16-year-old mermaid Ariel (Jodi Benson) is fascinated with life on land. On one of her visits to the surface, which are forbidden by her controlling father, King Triton, she falls for a human prince. Determined to be with her new love, Ariel makes a dangerous deal with the sea witch Ursula (Pat Carroll) to become human for three days. But when plans go awry for the star-crossed lovers, the king must make the ultimate sacrifice for his daughter.",
      "rating":       "G",
      "releaseYear":  "1989",
      "trailer":      "https://www.youtube.com/watch?v=ZGZX5-PAwR8"
    }
    ,
    {
      "titleDisplay": "The Little Rascals",
      "titleFilter":  "Little Rascals, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/littleRascals.png",
      "genre":        "Comedy",
      "runTime":      "1:28:00",
      "summary":      "Mischievous youngsters Spanky (Travis Tedford) and Buckwheat (Ross Elliot Bagley) lead an anti-girl organization, and they pick their buddy Alfalfa (Bug Hall) to represent them in an all-important soapbox car rally. When the boys then find their driver canoodling with schoolmate Darla (Brittany Ashton Holmes), they decide they must break up the couple. Unfortunately, while Spanky and his pals are busy meddling in Alfalfa's affairs, their prized race car is nabbed by two young toughs.",
      "rating":       "PG",
      "releaseYear":  "1994",
      "trailer":      "https://www.youtube.com/watch?v=qcOB45HMVzE"
    }
    ,
    {
      "titleDisplay": "Little Women",
      "titleFilter":  "Little Women",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/littleWomen.png",
      "genre":        "Drama, Romance",
      "runTime":      "1:58:00",
      "summary":      "In this 1994 adaptation of Louisa May Alcott's classic, the March sisters confront growing pains, financial shortages, family tragedies and romantic rivalries in mid-19th-century Massachusetts. Jo (Winona Ryder) struggles for independence and sometimes clashes with her beloved mother and her sisters Meg, Amy and Beth. She also contends with their cranky Aunt March, their impulsive neighbor Laurie (Christian Bale) and kindly linguistics professor Friedrich Bhaer (Gabriel Byrne).",
      "rating":       "PG",
      "releaseYear":  "1994",
      "trailer":      "https://www.youtube.com/watch?v=Aw1s4okHcsE"
    }
    ,
    {
      "titleDisplay": "Live Free or Die Hard",
      "titleFilter":  "Live Free or Die Hard",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/liveFreeorDieHard.png",
      "genre":        "Action, Comedy",
      "runTime":      "2:09:00",
      "summary":      "As the nation prepares to celebrate Independence Day, veteran cop John McClane (Bruce Willis) carries out another routine assignment: bringing in a computer hacker (Justin Long) for questioning. Meanwhile, a tech-savvy villain named Thomas Gabriel (Timothy Olyphant) launches an attack on America's computer infrastructure. As chaos descends around him, McClane must use old-fashioned methods to fight the high-tech threat.",
      "rating":       "PG-13",
      "releaseYear":  "2007",
      "trailer":      "https://www.youtube.com/watch?v=8Jz-8UcCiws"
    }
    ,
    {
      "titleDisplay": "Love Comes Softly",
      "titleFilter":  "Love Comes Softly",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/loveComesSoftly.png",
      "genre":        "Romance",
      "runTime":      "1:24:00",
      "summary":      "Aaron Claridge dies while leading his pregnant wife Marty, an East coast teacher, on the wagon trail to the West. Destitute and unprotected, she accepts a marriage of convenience with widower Clark Davis to help raise his brat daughter Missie all winter, in spring he's prepared to pay for her return. Missie is hostile to 'mother substitute', but as the months pass Clark achieves a rapprochement.",
      "rating":       "PG",
      "releaseYear":  "2012",
      "trailer":      "https://www.youtube.com/watch?v=JFTsYgtGcwA"
    }
    ,
    {
      "titleDisplay": "Love Happens",
      "titleFilter":  "Love Happens",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/loveHappens.png",
      "genre":        "Romance, Drama",
      "runTime":      "1:49:00",
      "summary":      "Dr. Burke Ryan (Aaron Eckhart) is a self-help guru who is on the verge of a lucrative multimedia deal. But there's a problem: though he advises his patients to confront their pain, Burke has never come to terms with his wife's death. Eloise Chandler (Jennifer Aniston) has had enough of men and dating, and is busy concentrating on her floral business. When they meet, Burke and Eloise feel an instant attraction, but wonder if they'll be able to let go of their painful pasts and embrace the future.",
      "rating":       "PG-13",
      "releaseYear":  "2008",
      "trailer":      "https://www.youtube.com/watch?v=95uhaDOQQiU"
    }
    ,
    {
      "titleDisplay": "Man From Snowy River",
      "titleFilter":  "Man From Snowy River",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/manFromSnowyRiver.png",
      "genre":        "Drama",
      "runTime":      "1:42:00",
      "summary":      "After the death of his father, proud young Jim Craig (Tom Burlinson) sets out to become his own man. Taking a job with horse rancher Harrison (Kirk Douglas), Craig is treated poorly by the more experienced cowboys, but wins the heart of the rancher's daughter, Jessica (Sigrid Thornton), when he helps her break a high-strung colt and later saves her life. When he's unfairly blamed for the loss of an expensive horse, Craig fights to restore his honor and prove that he's worthy of Jessica's hand.",
      "rating":       "PG",
      "releaseYear":  "1982",
      "trailer":      "https://www.youtube.com/watch?v=Nqlz6lOLtIQ"
    }
    ,
    {
      "titleDisplay": "Man of Steel",
      "titleFilter":  "Man of Steel",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/manOfSteel.png",
      "genre":        "Action",
      "runTime":      "2:28:00",
      "summary":      "With the imminent destruction of Krypton, their home planet, Jor-El (Russell Crowe) and his wife seek to preserve their race by sending their infant son to Earth. The child's spacecraft lands at the farm of Jonathan (Kevin Costner) and Martha (Diane Lane) Kent, who name him Clark and raise him as their own son. Though his extraordinary abilities have led to the adult Clark (Henry Cavill) living on the fringe of society, he finds he must become a hero to save those he loves from a dire threat.",
      "rating":       "PG-13",
      "releaseYear":  "2013",
      "trailer":      "https://www.youtube.com/watch?v=Sqgv1Qz1at4"
    }
    ,
    {
      "titleDisplay": "The Martian",
      "titleFilter":  "Martian, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/martian.png",
      "genre":        "Drama",
      "runTime":      "2:24:00",
      "summary":      "When astronauts blast off from the planet Mars, they leave behind Mark Watney (Matt Damon), presumed dead after a fierce storm. With only a meager amount of supplies, the stranded visitor must utilize his wits and spirit to find a way to survive on the hostile planet. Meanwhile, back on Earth, members of NASA and a team of international scientists work tirelessly to bring him home, while his crew mates hatch their own plan for a daring rescue mission.",
      "rating":       "PG-13",
      "releaseYear":  "2015",
      "trailer":      "https://www.youtube.com/watch?v=ej3ioOneTy8"
    }
    ,
    {
      "titleDisplay": "Master and Commander",
      "titleFilter":  "Master and Commander",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/masterAndCommander.png",
      "genre":        "Action",
      "runTime":      "2:18:00",
      "summary":      "In 1805, aboard the H.M.S. Surprise, the brash Captain Jack Aubrey (Russell Crowe) and his trusted friend, the ship's scholarly surgeon, Stephen Maturin (Paul Bettany), are ordered to hunt down and capture a powerful French vessel off the South American coast. Though Napoleon is winning the war and the men and their crew face an onslaught of obstacles, including their own internal battles, 'Lucky Jack' is determined that nothing will stop the Surprise from completing its mission.",
      "rating":       "PG-13",
      "releaseYear":  "2003",
      "trailer":      "https://www.youtube.com/watch?v=KpNhN-L9L-g"
    }
    ,
    {
      "titleDisplay": "Material Girls",
      "titleFilter":  "Material Girls",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/materialGirls.png",
      "genre":        "Comedy",
      "runTime":      "1:37:00",
      "summary":      "Two sibling cosmetics heiresses (Hilary Duff, Haylie Duff) must grow up quickly when a company scandal leaves them penniless. Though it is tempting to follow the advice of their board of directors and sell out to their biggest competitor, the gals decide to take matters into their own hands and save the company that their father built from scratch.",
      "rating":       "PG",
      "releaseYear":  "2006",
      "trailer":      "https://www.youtube.com/watch?v=MT_mqkj9ht4"
    }
    ,
    {
      "titleDisplay": "Matilda",
      "titleFilter":  "Matilda",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/matilda.png",
      "genre":        "Comedy, Disney, Kids",
      "runTime":      "1:42:00",
      "summary":      "This film adaptation of a Roald Dahl work tells the story of Matilda Wormwood (Mara Wilson), a gifted girl forced to put up with a crude, distant father (Danny DeVito) and mother (Rhea Perlman). Worse, Agatha Trunchbull (Pam Ferris), the evil principal at Matilda's school, is a terrifyingly strict bully. However, when Matilda realizes she has the power of telekinesis, she begins to defend her friends from Trunchbull's wrath and fight back against her unkind parents.",
      "rating":       "PG",
      "releaseYear":  "1996",
      "trailer":      "https://www.youtube.com/watch?v=pnzLRDDijW0"
    }
    ,
    {
      "titleDisplay": "Maverick",
      "titleFilter":  "Maverick",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/maverick.png",
      "genre":        "Comedy",
      "runTime":      "2:09:00",
      "summary":      "This film update of the 'Maverick' TV series finds the title cardsharp (Mel Gibson) hoping to join a poker contest with an impressive payoff. In order to enter, Maverick must first put up a large cash sum. He scams hopeful contestants Annabelle (Jodie Foster) and Angel (Alfred Molina) in a preliminary card game to win the money he needs, making enemies of both players. While trying to evade Annabelle and Angel, the crafty Maverick realizes a cunning marshal (James Garner) is also on his tail.",
      "rating":       "PG",
      "releaseYear":  "1994",
      "trailer":      "https://www.youtube.com/watch?v=mQ69CVbCiow"
    }
    ,
    {
      "titleDisplay": "Meet the Mormons",
      "titleFilter":  "Meet the Mormons",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/meetTheMormons.png",
      "genre":        "Doc/Rel",
      "runTime":      "1:18:00",
      "summary":      "Filmmaker Blair Treu examines the Mormon faith through the experiences of six devout individuals from around the world.",
      "rating":       "G",
      "releaseYear":  "2014",
      "trailer":      "https://www.youtube.com/watch?v=4JqPTEL13IY"
    }
    ,
    {
      "titleDisplay": "Megamind",
      "titleFilter":  "Megamind",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/megamind.png",
      "genre":        "Comedy, Disney",
      "runTime":      "1:36:00",
      "summary":      "Though he is the most-brilliant supervillain the world has known, Megamind (Will Ferrell) is the least-successful. Thwarted time and again by heroic Metro Man (Brad Pitt), Megamind is more surprised than anyone when he actually manages to defeat his longtime enemy. But without Metro Man, Megamind has no purpose in life, so he creates a new opponent, who quickly decides that it's more fun to be a bad guy than a hero.",
      "rating":       "PG",
      "releaseYear":  "2010",
      "trailer":      "https://www.youtube.com/watch?v=NPI0eatlo_M"
    }
    ,
    {
      "titleDisplay": "Memphis Belle",
      "titleFilter":  "Memphis Belle",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/memphisBelle.png",
      "genre":        "Action, Drama",
      "runTime":      "1:50:00",
      "summary":      "At a U.S. Army Air Force base in England, the crew members of B-17 bomber Memphis Belle prepare for their 25th and final sortie into enemy German territory. Bomber Capt. Dennis Dearborn (Matthew Modine) knows the mission is a dangerous one, but he's under pressure from Army public relations man Lt. Col. Bruce Derringer (John Lithgow) to earn a decisive victory for the Allies. Now, the Memphis Belle prepares to take flight as apprehension and dissention grow among Dearborn's crew.",
      "rating":       "PG-13",
      "releaseYear":  "1990",
      "trailer":      "https://www.youtube.com/watch?v=lKkBdvS5kso"
    }
    ,
    {
      "titleDisplay": "Men in Black I",
      "titleFilter":  "Men in Black 1",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/menInBlack.png",
      "genre":        "Action, Comedy",
      "runTime":      "1:38:00",
      "summary":      "They are the best-kept secret in the universe. Working for a highly funded yet unofficial government agency, Kay (Tommy Lee Jones) and Jay (Will Smith) are the Men in Black, providers of immigration services and regulators of all things alien on Earth. While investigating a series of unregistered close encounters, the MIB agents uncover the deadly plot of an intergalactic terrorist who is on a mission to assassinate two ambassadors from opposing galaxies currently in residence in New York City.",
      "rating":       "PG-13",
      "releaseYear":  "1997",
      "trailer":      "https://www.youtube.com/watch?v=HYUd7AOw_lk"
    }
    ,
    {
      "titleDisplay": "Men in Black II",
      "titleFilter":  "Men in Black 2",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/menInBlackTwo.png",
      "genre":        "Action, Comedy",
      "runTime":      "1:29:00",
      "summary":      "Kay (Tommy Lee Jones) and Jay (Will Smith) reunite to provide our best line of defense against a seductress who levels the toughest challenge yet to the MIBs mission statement: protecting the earth from the scum of the universe. While investigating a routine crime, Jay uncovers a plot masterminded by Serleena (Boyle), a Kylothian monster who disguises herself as a lingerie model. When Serleena takes the MIB building hostage, there is only one person Jay can turn to -- his former MIB partner.",
      "rating":       "PG-13",
      "releaseYear":  "2003",
      "trailer":      "https://www.youtube.com/watch?v=p4NJHqoojOU"
    }
    ,
    {
      "titleDisplay": "Mighty Joe Young",
      "titleFilter":  "Mighty Joe Young",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/mightyJoe.png",
      "genre":        "Drama",
      "runTime":      "1:54:00",
      "summary":      "As a child living in Africa, Jill Young (Charlize Theron) saw her mother killed while protecting wild gorillas from poachers led by Andrei Strasser (Rade Serbedzija). Now an adult, Jill cares for an orphaned gorilla named Joe -- who, due to a genetic anomaly, is 15 feet tall. When Gregg O'Hara (Bill Paxton) arrives from California and sees the animal, he convinces Jill that Joe would be safest at his wildlife refuge. But Strasser follows them to the U.S., intent on capturing Joe for himself.",
      "rating":       "PG",
      "releaseYear":  "1998",
      "trailer":      "https://www.youtube.com/watch?v=3tPWHp2KZoY"
    }
    ,
    {
      "titleDisplay": "Million Dollar Arm",
      "titleFilter":  "Million Dollar Arm",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/millionDollarArm.png",
      "genre":        "Drama",
      "runTime":      "2:04:00",
      "summary":      "In a last-ditch effort to save his career, sports agent J.B. Bernstein (Jon Hamm) plans to find baseball's next star pitcher. He heads to India to find a cricket player whom he can nurture into a major league star. With the help of a scout (Alan Arkin), J.B. finds teens Dinesh (Madhur Mittal) and Rinku (Suraj Sharma), who haven't a clue about baseball but throw powerful pitches. As the boys adjust to American life, J.B. learns valuable lessons about teamwork and family.",
      "rating":       "PG",
      "releaseYear":  "2014",
      "trailer":      "https://www.youtube.com/watch?v=mvFm-RWxZS8"
    }
    ,
    {
      "titleDisplay": "Miracle on 34th Street",
      "titleFilter":  "Miracle on 34th Street",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/miracleOnStreet.png",
      "genre":        "Holiday",
      "runTime":      "1:36:00",
      "summary":      "In this Christmas classic, an old man going by the name of Kris Kringle (Edmund Gwenn) fills in for an intoxicated Santa in Macy's annual Thanksgiving Day parade. Kringle proves to be such a hit that he is soon appearing regularly at the chain's main store in midtown Manhattan. When Kringle surprises customers and employees alike by claiming that he really is Santa Claus, it leads to a court case to determine his mental health and, more importantly, his authenticity.",
      "rating":       "G",
      "releaseYear":  "1949",
      "trailer":      "https://www.youtube.com/watch?v=TjmMMa5u5hA"
    }
    ,
    {
      "titleDisplay": "Mirror Mirror",
      "titleFilter":  "Mirror Mirror",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/mirrorMirror.png",
      "genre":        "Disney, Romance",
      "runTime":      "1:48:00",
      "summary":      "Snow White (Lily Collins), an orphaned princess, is the rightful ruler of her kingdom, but a jealous, evil queen (Julia Roberts) schemes to gain control. When a charming prince (Armie Hammer) spurns the queen in favor of Snow White, she has the princess thrown into the woods to be devoured by a fearsome beast. Rescued by a band of diminutive highway robbers, Snow White vows to take back her realm from the treacherous queen and, with the help of her small rescuers, roars into action.",
      "rating":       "PG",
      "releaseYear":  "2012",
      "trailer":      "https://www.youtube.com/watch?v=YgbH05rQx1s"
    }
    ,
    {
      "titleDisplay": "Miss Congeniality",
      "titleFilter":  "Miss Congeniality 1",
      "editedFlag":   false,
      "toEditFlag":   true,
      "imgPath":      "img/missCongeniality.png",
      "genre":        "Comedy",
      "runTime":      "1:50:00",
      "summary":      "When a terrorist threatens to bomb the Miss United States pageant, the FBI rushes to find a female agent to go undercover as a contestant. Unfortunately, Gracie is the only female FBI agent who can 'look the part' despite her complete lack of refinement and femininity. She prides herself in being 'just one of the boys' and is horrified at the idea of becoming a girly girl.",
      "rating":       "PG-13",
      "releaseYear":  "2000",
      "trailer":      "https://www.youtube.com/watch?v=8emJD-rR9Cs"
    }
    ,
    {
      "titleDisplay": "Mission Impossible",
      "titleFilter":  "Mission Impossible 1",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/missionImpossible.png",
      "genre":        "Action",
      "runTime":      "1:50:00",
      "summary":      "When U.S. government operative Ethan Hunt (Tom Cruise) and his mentor, Jim Phelps (Jon Voight), go on a covert assignment that takes a disastrous turn, Jim is killed, and Ethan becomes the prime murder suspect. Now a fugitive, Hunt recruits brilliant hacker Luther Stickell (Ving Rhames) and maverick pilot Franz Krieger (Jean Reno) to help him sneak into a heavily guarded CIA building to retrieve a confidential computer file that will prove his innocence.",
      "rating":       "PG-13",
      "releaseYear":  "1996",
      "trailer":      "https://www.youtube.com/watch?v=xBjFCFNs__Q"
    }
    ,
    {
      "titleDisplay": "Mission Impossible 4 Ghost Protocol",
      "titleFilter":  "Mission Impossible 4 Ghost Protocol",
      "editedFlag":   false,
      "toEditFlag":   true,
      "imgPath":      "img/missionImpossibleFour.png",
      "genre":        "Action",
      "runTime":      "2:18:00",
      "summary":      "Blamed for a terrorist attack on the Kremlin, Ethan Hunt (Tom Cruise) and the entire IMF agency are disavowed by the U.S. government, while the president initiates the Ghost Protocol. Forced to go 'off the grid' -- left without resources or backup -- Hunt must somehow clear the agency's name and prevent another attack. Complicating matters even more, Ethan must undertake the impossible mission with a group of fellow IMF fugitives whose actual motives are suspect.",
      "rating":       "PG-13",
      "releaseYear":  "2011",
      "trailer":      "https://www.youtube.com/watch?v=V0LQnQSrC-g"
    }
    ,
    {
      "titleDisplay": "Moneyball",
      "titleFilter":  "Moneyball",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/moneyball.png",
      "genre":        "Drama",
      "runTime":      "2:13:00",
      "summary":      "Billy Beane (Brad Pitt), general manager of the Oakland A's, one day has an epiphany: Baseball's conventional wisdom is all wrong. Faced with a tight budget, Beane must reinvent his team by outsmarting the richer ball clubs. Joining forces with Ivy League graduate Peter Brand (Jonah Hill), Beane prepares to challenge old-school traditions. He recruits bargain-bin players whom the scouts have labeled as flawed, but have game-winning potential. Based on the book by Michael Lewis.",
      "rating":       "PG-13",
      "releaseYear":  "2011",
      "trailer":      "https://www.youtube.com/watch?v=AiAHlZVgXjk"
    }
    ,
    {
      "titleDisplay": "Monsters vs Aliens",
      "titleFilter":  "Monsters vs Aliens",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/monstersVS.png",
      "genre":        "Disney",
      "runTime":      "1:42:00",
      "summary":      "When a meteor full of space gunk transforms Susan Murphy (Reese Witherspoon) into a giant, the government renames her Ginormica and confines her to a secret compound with other monsters, like bug-headed Dr. Cockroach (Hugh Laurie). When an extraterrestrial robot lands on Earth and begins a rampage, Gen. W.R. Monger persuades the president to send Ginormica and her fellow monsters to battle the machine and save the planet.",
      "rating":       "PG",
      "releaseYear":  "2009",
      "trailer":      "https://www.youtube.com/watch?v=76XkslTbkjU"
    }
    ,
    {
      "titleDisplay": "Monty Python and the Holy Grail",
      "titleFilter":  "Monty Python and the Holy Grail",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/montyPython.png",
      "genre":        "Comedy",
      "runTime":      "1:31:00",
      "summary":      "A comedic send-up of the grim circumstances of the Middle Ages as told through the story of King Arthur and framed by a modern-day murder investigation. When the mythical king of the Britons leads his knights on a quest for the Holy Grail, they face a wide array of horrors, including a persistent Black Knight, a three-headed giant, a cadre of shrubbery-challenged knights, the perilous Castle Anthrax, a killer rabbit, a house of virgins, and a handful of rude Frenchmen.",
      "rating":       "PG",
      "releaseYear":  "1975",
      "trailer":      "https://www.youtube.com/watch?v=RDM75-oXGmQ"
    }
    ,
    {
      "titleDisplay": "Mr. Deeds",
      "titleFilter":  "Mr. Deeds",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/mrDeeds.png",
      "genre":        "Comedy, Romance",
      "runTime":      "1:36:00",
      "summary":      "Longfellow Deeds (Adam Sandler) is a sweet, lovable guy leading a simple but happy life in the tiny hamlet of Mandrake Falls, New Hampshire. Life is good at the small town restaurant until two corporate execs bring news that Deeds is about to be rolling in a different kind of dough. A long-lost relative has left him an inheritance of 40 billion dollars along with the largest media company in the world. It's a fish out of water, rags to riches story that has local tabloid reporters salivating.",
      "rating":       "PG-13",
      "releaseYear":  "2002",
      "trailer":      "https://www.youtube.com/watch?v=5aB1aJrxfvw"
    }
    ,
    {
      "titleDisplay": "The Mummy",
      "titleFilter":  "Mummy 1, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/mummy.png",
      "genre":        "Action",
      "runTime":      "2:05:00",
      "summary":      "The Mummy is a rousing, suspenseful and horrifying epic about an expedition of treasure-seeking explorers in the Sahara Desert in 1925. Stumbling upon an ancient tomb, the hunters unwittingly set loose a 3,000-year-old legacy of terror, which is embodied in the vengeful reincarnation of an Egyptian priest who had been sentenced to an eternity as one of the living dead.",
      "rating":       "PG-13",
      "releaseYear":  "1999",
      "trailer":      "https://www.youtube.com/watch?v=h3ptPtxWJRs"
    }
    ,
    {
      "titleDisplay": "Nacho Libre",
      "titleFilter":  "Nacho Libre",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/nachoLibre.png",
      "genre":        "Comedy",
      "runTime":      "1:40:00",
      "summary":      "Ignacio (Jack Black), or Nacho to his friends, works as a cook in the Mexican monastery where he grew up. The monastery is home to a host of orphans whom Nacho cares for deeply, but there is not much money to feed them properly. Nacho decides to raise money for the children by moonlighting as a Lucha Libre wrestler with his partner Esqueleto (Héctor Jiménez), but since the church forbids Lucha, Nacho must disguise his identity.",
      "rating":       "PG",
      "releaseYear":  "2006",
      "trailer":      "https://www.youtube.com/watch?v=ElVSw6xpQ70"
    }
    ,
    {
      "titleDisplay": "Napoleon Dynamite",
      "titleFilter":  "Napoleon Dynamite",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/napoleonDynamite.png",
      "genre":        "Comedy",
      "runTime":      "1:36:00",
      "summary":      "In small-town Preston, Idaho, awkward teen Napoleon Dynamite (Jon Heder) has trouble fitting in. After his grandmother is injured in an accident, his life is made even worse when his strangely nostalgic uncle, Rico (Jon Gries), shows up to keep an eye on him. With no safe haven at home or at school, Napoleon befriends the new kid, Pedro (Efren Ramirez), a morose Hispanic boy who speaks little English. Together the two launch a campaign to run for class president.",
      "rating":       "PG",
      "releaseYear":  "2006",
      "trailer":      "https://www.youtube.com/watch?v=qH-FBPRf7NQ"
    }
    ,
    {
      "titleDisplay": "National Treasure",
      "titleFilter":  "National Treasure 1",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/nationalTreasure.png",
      "genre":        "Drama, Comedy",
      "runTime":      "2:11:00",
      "summary":      "Historian and code-breaker Ben Gates (Nicolas Cage) has been searching his whole life for a rumored treasure dating back to the creation of the United States. Joining an expedition led by fellow treasure hunter Ian Howe (Sean Bean), Gates finds an ice-locked Colonial ship in the Arctic Circle that contains a clue linking the treasure to the Declaration of Independence. But when Howe betrays him, Gates has to race to get to the document ahead of his so-called colleague.",
      "rating":       "PG",
      "releaseYear":  "2004",
      "trailer":      "https://www.youtube.com/watch?v=J34YtrkL7ic"
    }
    ,
    {
      "titleDisplay": "National Treasure 2 - The Book of Secrets",
      "titleFilter":  "National Treasure 2 - The Book of Secrets",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/nationalTreasure2.png",
      "genre":        "Drama, Comedy",
      "runTime":      "2:11:00",
      "summary":      "When a long-missing page from the diary of assassin John Wilkes Booth suddenly resurfaces, it implicates the great-great grandfather of treasure hunter Ben Gates (Nicolas Cage) as a conspirator in Lincoln's death. Ben's globetrotting quest to prove his ancestor's innocence leads him to a closely guarded book containing the nation's deepest secrets.",
      "rating":       "PG",
      "releaseYear":  "2007",
      "trailer":      "https://www.youtube.com/watch?v=KvXRpibR_uc"
    }
    ,
    {
      "titleDisplay": "New in Town",
      "titleFilter":  "New in Town",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/newInTown.png",
      "genre":        "Romance",
      "runTime":      "1:37:00",
      "summary":      "Lucy Hill (Renée Zellweger), an ambitious executive, lives the high life in Miami. She loves climbing the corporate ladder as well as all the material goods that her success can buy. When she is offered a temporary assignment to restructure a factory in a backwater town, she eagerly accepts and anticipates a huge promotion in the pipeline. However, what Lucy gets is a life-changing experience and romance with the man of her dreams (Harry Connick Jr.).",
      "rating":       "PG",
      "releaseYear":  "2009",
      "trailer":      "https://www.youtube.com/watch?v=_K_JXt8qJqU"
    }
    ,
    {
      "titleDisplay": "October Sky",
      "titleFilter":  "October Sky",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/octoberSky.png",
      "genre":        "Drama",
      "runTime":      "1:49:00",
      "summary":      "John Hickam (Chris Cooper) is a West Virginia coal miner who loves his job and expects his sons, Jim (Scott Miles) and Homer (Jake Gyllenhaal), to follow in his footsteps. But Jim gets a football scholarship, and Homer becomes interested in rocket science after seeing Sputnik 1 crossing the sky. John disapproves of his son's new mania, but Homer begins building rockets with the help of friends and a sympathetic teacher (Laura Dern). Rocketry, he hopes, will prove his ticket to a better life.",
      "rating":       "PG",
      "releaseYear":  "1999",
      "trailer":      "https://www.youtube.com/watch?v=zxJQgYPXjN4"
    }
    ,
    {
      "titleDisplay": "Over the Hedge",
      "titleFilter":  "Over the Hedge",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/overTheHedge.png",
      "genre":        "Disney",
      "runTime":      "1:38:00",
      "summary":      "When Verne (Garry Shandling) and fellow woodland friends awake from winter's hibernation, they find they have some new neighbors: humans, and RJ (Bruce Willis), an opportunistic raccoon who shows the others how to exploit the suburban bounty laid out before them.",
      "rating":       "PG",
      "releaseYear":  "2006",
      "trailer":      "https://www.youtube.com/watch?v=BE77igZczlI"
    }
    ,
    {
      "titleDisplay": "Overboard",
      "titleFilter":  "Overboard",
      "editedFlag":   false,
      "toEditFlag":   true,
      "imgPath":      "img/overboard.png",
      "genre":        "Romance, Comedy",
      "runTime":      "1:53:00",
      "summary":      "Snobbish and wealthy Joanna Stayton (Goldie Hawn) is living a life of leisure with her husband, Grant (Edward Herrmann), when she falls off their yacht and suffers amnesia. Grant takes the opportunity to rid himself of the demanding Joanna -- but Dean (Kurt Russell), a widowed carpenter with four kids who once worked for Joanna, arrives and claims she's his wife. Joanna can't remember her past identity, but has trouble believing that she was ever meant to be a working-class mother of four.",
      "rating":       "PG",
      "releaseYear":  "1987",
      "trailer":      "https://www.youtube.com/watch?v=aotWp-wRgCo"
    }
    ,
    {
      "titleDisplay": "The Parent Trap",
      "titleFilter":  "Parent Trap, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/parentTrap.png",
      "genre":        "Disney, Comedy",
      "runTime":      "2:08:00",
      "summary":      "In this update of a 1961 film, twins Annie and Hallie (Lindsay Lohan) are strangers until happenstance unites them. The preteen girls' divorced parents, Nick (Dennis Quaid) and Elizabeth (Natasha Richardson), are living on opposite sides of the Atlantic, each with one child. After meeting at camp, American Hallie and British-raised Annie engineer an identity swap, giving both the chance to spend time with the parent they've missed. If the scheme works, it might just make the family whole again.",
      "rating":       "PG",
      "releaseYear":  "1998",
      "trailer":      "https://www.youtube.com/watch?v=32WeiH4TrIY"
    }
    ,
    {
      "titleDisplay": "Pay it Forward",
      "titleFilter":  "Pay it Forward",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/payItForward.png",
      "genre":        "Drama",
      "runTime":      "2:03:00",
      "summary":      "The story of a social studies teacher who gives an assignment to his junior high school class to think of an idea to change the world for the better, then put it into action. When one young student creates a plan for 'paying forward' favors, he not only affects the life of his struggling single mother, but he sets in motion an unprecedented wave of human kindness which, unbeknownst to him, has blossomed into a profound national phenomenon.",
      "rating":       "PG-13",
      "releaseYear":  "2000",
      "trailer":      "https://www.youtube.com/watch?v=_pCtXRP1edo"
    }
    ,
    {
      "titleDisplay": "The Peaceful Warrior",
      "titleFilter":  "Peaceful Warrior, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/peacefulWarrior.png",
      "genre":        "Drama",
      "runTime":      "2:00:00",
      "summary":      "Dan Millman (Scott Mechlowicz) is a gifted athlete whose desire for success drives everything he does. When a mysterious stranger (Nick Nolte) opens Dan's eyes to a new vision of strength and understanding, the Olympic hopeful finds that he still has much to learn and more sacrifices to make.",
      "rating":       "PG-13",
      "releaseYear":  "2007",
      "trailer":      "https://www.youtube.com/watch?v=gegNMYvY_yg"
    }
    ,
    {
      "titleDisplay": "Pearl Harbor",
      "titleFilter":  "Pearl Harbor",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/pearlHarbor.png",
      "genre":        "Drama, Action",
      "runTime":      "3:04:00",
      "summary":      "This sweeping drama, based on real historical events, follows American boyhood friends Rafe McCawley (Ben Affleck) and Danny Walker (Josh Hartnett) as they enter World War II as pilots. Rafe is so eager to take part in the war that he departs to fight in Europe alongside England's Royal Air Force. On the home front, his girlfriend, Evelyn (Kate Beckinsale), finds comfort in the arms of Danny. The three of them reunite in Hawaii just before the Japanese attack on Pearl Harbor.",
      "rating":       "PG-13",
      "releaseYear":  "2001",
      "trailer":      "https://www.youtube.com/watch?v=oGYcxjywx0o"
    }
    ,
    {
      "titleDisplay": "Persuasion",
      "titleFilter":  "Persuasion",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/persuasion.png",
      "genre":        "Romance, Drama",
      "runTime":      "1:48:00",
      "summary":      "As one of three daughters of the wealthy Sir Walter (Corin Redgrave), Anne (Amanda Root) is a privileged but lonely member of the English aristocracy. When her father leaves on a trip, he rents out part of his estate to relatives of Anne's ex-fiancé, Capt. Frederick Wentworth (Ciarán Hinds). Though Anne demurred over the marriage because of Wentworth's poor social standing and connections, he has since become very successful, and when he visits, Anne must confront the life she left behind.",
      "rating":       "PG",
      "releaseYear":  "1995",
      "trailer":      "https://www.youtube.com/watch?v=K5K7_fqHILI"
    }
    ,
    {
      "titleDisplay": "The Phantom of the Opera",
      "titleFilter":  "Phantom of the Opera, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/phantomOfTheOpera.png",
      "genre":        "Drama, Music",
      "runTime":      "2:26:00",
      "summary":      "From his hideout beneath a 19th century Paris opera house, the brooding Phantom (Gerard Butler) schemes to get closer to vocalist Christine Daae (Emmy Rossum). The Phantom, wearing a mask to hide a congenital disfigurement, strong-arms management into giving the budding starlet key roles, but Christine instead falls for arts benefactor Raoul (Patrick Wilson). Terrified at the notion of her absence, the Phantom enacts a plan to keep Christine by his side, while Raoul tries to foil the scheme.",
      "rating":       "PG-13",
      "releaseYear":  "2004",
      "trailer":      "https://www.youtube.com/watch?v=44w6elsJr_I"
    }
    ,
    {
      "titleDisplay": "Pirates of the Carribean 1 - The Curse of the Black Pearl",
      "titleFilter":  "Pirates of the Carribean 1 - The Curse of the Black Pearl",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/piratesCaribbean1.png",
      "genre":        "Action, Comedy",
      "runTime":      "2:23:00",
      "summary":      "Capt. Jack Sparrow (Johnny Depp) arrives at Port Royal in the Caribbean without a ship or crew. His timing is inopportune, however, because later that evening the town is besieged by a pirate ship. The pirates kidnap the governor's daughter, Elizabeth (Keira Knightley), who's in possession of a valuable coin that is linked to a curse that has transformed the pirates into the undead. A gallant blacksmith (Orlando Bloom) in love with Elizabeth allies with Sparrow in pursuit of the pirates.",
      "rating":       "PG-13",
      "releaseYear":  "2003",
      "trailer":      "https://www.youtube.com/watch?v=naQr0uTrH_s"
    }
    ,
    {
      "titleDisplay": "Pirates of the Carribean 2 - Dead Man's Chest",
      "titleFilter":  "Pirates of the Carribean 2 - Dead Man's Chest",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/piratesCaribbean2.png",
      "genre":        "Action, Comedy",
      "runTime":      "2:31:00",
      "summary":      "When ghostly pirate Davy Jones (Bill Nighy) comes to collect a blood debt, Capt. Jack Sparrow (Johnny Depp) must find a way to avoid his fate lest his soul be damned for all time. Nevertheless, the wily ghost manages to interrupt the wedding plans of Jack's friends Will Turner (Orlando Bloom) and Elizabeth Swann (Keira Knightley).",
      "rating":       "PG-13",
      "releaseYear":  "2006",
      "trailer":      "https://www.youtube.com/watch?v=XN3omw9o0Jk"
    }
    ,
    {
      "titleDisplay": "Pirates of the Carribean 3 - At World's End",
      "titleFilter":  "Pirates of the Carribean 3 - At World's End",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/piratesCaribbean3.png",
      "genre":        "Action, Comedy",
      "runTime":      "2:49:00",
      "summary":      "Will Turner (Orlando Bloom) and Elizabeth Swann (Keira Knightley) join forces with Capt. Barbossa (Geoffrey Rush) to free Jack Sparrow (Johnny Depp) from Davy Jones' locker. Meanwhile, the crew of the Flying Dutchman ghost ship wreaks havoc on the Seven Seas. The friends must navigate dangerous waters to confront Chinese pirate Sao Feng (Chow Yun-Fat) and, ultimately, they must choose sides in a battle wherein the pirate life hangs in the balance.",
      "rating":       "PG-13",
      "releaseYear":  "2007",
      "trailer":      "https://www.youtube.com/watch?v=PetrAmq9fcw"
    }
    ,
    {
      "titleDisplay": "Rise of the Planet of the Apes (1)",
      "titleFilter":  "Planet of the Apes 1 - Rise of the,",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/risePlanetApes.png",
      "genre":        "Action",
      "runTime":      "1:46:00",
      "summary":      "Will Rodman (James Franco), a scientist in San Francisco, is experimenting with a drug that he hopes will cure his father's (John Lithgow) Alzheimer's disease. After his work is deemed a failure, Will becomes the guardian of Caesar, an infant chimp who was exposed in-utero to Will's drug. Caesar displays unusual intelligence, and Will decides to continue his experiments secretly. But as Caesar's intellect and abilities grow, he comes to represent a threat to man's dominion over Earth.",
      "rating":       "PG-13",
      "releaseYear":  "2011",
      "trailer":      "https://www.youtube.com/watch?v=EbCoDf44oCE"
    }
    ,
    {
      "titleDisplay": "Dawn of the Planet of the Apes (2)",
      "titleFilter":  "Planet of the Apes 2 - Dawn of the,",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/dawnPlanetApes.png",
      "genre":        "Action",
      "runTime":      "2:11:00",
      "summary":      "Ten years after simian flu wiped out much of the world's homosapiens, genetically enhanced chimpanzee Caesar (Andy Serkis) and his ever-growing band of followers have established a thriving colony just outside San Francisco in Muir Woods. Meanwhile, a small band of human survivors emerges, which forces Caesar -- as leader -- to grapple with the dual challenge of protecting his people and re-establishing a relationship with the remaining human population -- the latter being Caesar's secret wish.",
      "rating":       "PG-13",
      "releaseYear":  "2014",
      "trailer":      "https://www.youtube.com/watch?v=3sHMCRaS3ao"
    }
    ,
    {
      "titleDisplay": "Pocahontas",
      "titleFilter":  "Pocahontas",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/pocahontas.png",
      "genre":        "Disney, Kids",
      "runTime":      "1:31:00",
      "summary":      "This is the Disney animated tale of the romance between a young American Indian woman named Pocahontas (Irene Bedard) and Capt. John Smith (Mel Gibson), who journeyed to the New World with other settlers to begin fresh lives. Her powerful father, Chief Powhatan, disapproves of their relationship and wants her to marry a native warrior. Meanwhile, Smith's fellow Englishmen hope to rob the Native Americans of their gold. Can Pocahontas' love for Smith save the day?",
      "rating":       "G",
      "releaseYear":  "1995",
      "trailer":      "https://www.youtube.com/watch?v=9q1QF8G47oU"
    }
    ,
    {
      "titleDisplay": "The Polar Express",
      "titleFilter":  "Polar Express, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/polarExpress.png",
      "genre":        "Disney, Holiday",
      "runTime":      "1:40:00",
      "summary":      "Tom Hanks and director Robert Zemeckis ('Forrest Gump'; 'Cast Away') reunite for 'Polar Express,' an inspiring adventure based on the beloved children's book by Chris Van Allsburg. When a doubting young boy takes an extraordinary train ride to the North Pole, he embarks on a journey of self-discovery that shows him that the wonder of life never fades for those who believe.",
      "rating":       "G",
      "releaseYear":  "2004",
      "trailer":      "https://www.youtube.com/watch?v=O4eFHrAOI4E"
    }
    ,
    {
      "titleDisplay": "Pride and Prejudice",
      "titleFilter":  "Pride and Prejudice",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/prideAndPrejudiceNew.png",
      "genre":        "Romance, Drama",
      "runTime":      "2:15:00",
      "summary":      "In this adaptation of Jane Austen's beloved novel, Elizabeth Bennet (Keira Knightley) lives with her mother, father and sisters in the English countryside. As the eldest, she faces mounting pressure from her parents to marry. When the outspoken Elizabeth is introduced to the handsome and upper-class Mr. Darcy (Matthew MacFadyen), sparks fly. Although there is obvious chemistry between the two, Darcy's overly reserved nature threatens the fledgling relationship.",
      "rating":       "PG",
      "releaseYear":  "2005",
      "trailer":      "https://www.youtube.com/watch?v=fJA27Jujzq4"
    }
    ,
    {
      "titleDisplay": "Pride and Prejudice",
      "titleFilter":  "Pride and Prejudice",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/prideAndPrejudiceOld.png",
      "genre":        "Romance, Drama",
      "runTime":      "5:27:00",
      "summary":      "Jane Austen's classic novel about the prejudice that occurred between the 19th century classes and the pride which would keep lovers apart.",
      "rating":       "G",
      "releaseYear":  "1995",
      "trailer":      "https://www.youtube.com/watch?v=2a81908KO6U"
    }
    ,
    {
      "titleDisplay": "The Prince and Me",
      "titleFilter":  "Prince and Me, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/princeAndMe.png",
      "genre":        "Romance, Drama",
      "runTime":      "1:51:00",
      "summary":      "Paige Morgan (Julia Stiles) is a focused premed student who becomes intrigued by Eddie (Luke Mably), a wealthy Danish student. Despite Eddie's initially boorish behavior, Paige falls for him, only to discover that his father (James Fox) and mother (Miranda Richardson) are the king and queen of Denmark, and he is heir apparent to the throne. As Eddie adjusts to American life, and Paige gets used to her beau being a future king, the two must decide if their romance is something that can last.",
      "rating":       "PG",
      "releaseYear":  "2003",
      "trailer":      "https://www.youtube.com/watch?v=IWkNz_5tLac"
    }
    ,
    {
      "titleDisplay": "The Princess Bride",
      "titleFilter":  "Princess Bride, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/princessBride.png",
      "genre":        "Romance, Comedy",
      "runTime":      "1:38:00",
      "summary":      "A fairy tale adventure about a beautiful young woman and her one true love. He must find her after a long separation and save her. They must battle the evils of the mythical kingdom of Florin to be reunited with each other. Based on the William Goldman novel 'The Princess Bride' which earned its own loyal audience.",
      "rating":       "PG",
      "releaseYear":  "1987",
      "trailer":      "https://www.youtube.com/watch?v=njZBYfNpWoE"
    }
    ,
    {
      "titleDisplay": "The Princess Diaries",
      "titleFilter":  "Princess Diaries, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/princessDiaries.png",
      "genre":        "Romance, Comedy",
      "runTime":      "1:55:00",
      "summary":      "Shy San Francisco teenager Mia Thermopolis (Anne Hathaway) is thrown for a loop when, from out of the blue, she learns the astonishing news that she's a real-life princess! As the heir apparent to the crown of the small European principality of Genovia, Mia begins a comical journey toward the throne when her strict and formidable grandmother, Queen Clarisse Renaldi (Julie Andrews), shows up to give her 'princess lessons.'",
      "rating":       "G",
      "releaseYear":  "2001",
      "trailer":      "https://www.youtube.com/watch?v=2CkcwPi20ms"
    }
    ,
    {
      "titleDisplay": "Pure Country",
      "titleFilter":  "Pure Country",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/pureCountry.png",
      "genre":        "Romance, Music",
      "runTime":      "1:53:00",
      "summary":      "One of the biggest stars in country music, Dusty Wyatt Chandler (George Strait) grows disillusioned with the hollow performances and overly produced arena shows he's contractually obligated to play. In an effort to become grounded, Chandler walks away from the spotlight and goes back to the country town of his youth. After finding work at a ranch, he falls for the owner's daughter, Lula Rogers (Lesley Ann Warren). However, his manager (Isabel Glasser) is determined to keep the show going.",
      "rating":       "PG",
      "releaseYear":  "1992",
      "trailer":      "https://www.youtube.com/watch?v=ImbNqSoqGqA"
    }
    ,
    {
      "titleDisplay": "The Pursuit of Happyness",
      "titleFilter":  "Pursuit of Happyness, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/pursuitOfHappiness.png",
      "genre":        "Drama",
      "runTime":      "2:25:00",
      "summary":      "Life is a struggle for single father Chris Gardner (Will Smith). Evicted from their apartment, he and his young son (Jaden Christopher Syre Smith) find themselves alone with no place to go. Even though Chris eventually lands a job as an intern at a prestigious brokerage firm, the position pays no money. The pair must live in shelters and endure many hardships, but Chris refuses to give in to despair as he struggles to create a better life for himself and his son.",
      "rating":       "PG-13",
      "releaseYear":  "2006",
      "trailer":      "https://www.youtube.com/watch?v=89Kq8SDyvfg"
    }
    ,
    {
      "titleDisplay": "Raise Your Voice",
      "titleFilter":  "Raise Your Voice",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/raiseYourVoice.png",
      "genre":        "Drama, Music",
      "runTime":      "1:47:00",
      "summary":      "After her brother (Jason Ritter) dies in a car accident, Terri (Hilary Duff) wants to leave her small-town life to attend a performing arts school in Los Angeles, but her father (David Keith) forbids her from going. Under the auspices of visiting an aunt, Terri leaves for L.A., but now she has to prepare for the school's talent competition while also keeping her secret from her father. Meanwhile, Terri's singing partner, Jay (Oliver James), is harboring a secret crush.",
      "rating":       "PG",
      "releaseYear":  "2004",
      "trailer":      "https://www.youtube.com/watch?v=UwqbWngXdVc"
    }
    ,
    {
      "titleDisplay": "Ratatouille",
      "titleFilter":  "Ratatouille",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Ratatouille.png",
      "genre":        "Disney, Comedy",
      "runTime":      "1:55:00",
      "summary":      "Remy (Patton Oswalt), a resident of Paris, appreciates good food and has quite a sophisticated palate. He would love to become a chef so he can create and enjoy culinary masterpieces to his heart's delight. The only problem is, Remy is a rat. When he winds up in the sewer beneath one of Paris' finest restaurants, the rodent gourmet finds himself ideally placed to realize his dream.",
      "rating":       "2007",
      "releaseYear":  "2007",
      "trailer":      "https://www.youtube.com/watch?v=c3sBBRxDAqk"
    }
    ,
    {
      "titleDisplay": "RED",
      "titleFilter":  "RED 1",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/red.png",
      "genre":        "Comedy, Action",
      "runTime":      "1:51:00",
      "summary":      "After surviving an assault from a squad of hit men, retired CIA agent Frank Moses (Bruce Willis) reassembles his old team for an all-out war. Frank reunites with old Joe (Morgan Freeman), crazy Marvin (John Malkovich) and wily Victoria (Helen Mirren) to uncover a massive conspiracy that threatens their lives. Only their expert training will allow them to survive a near-impossible mission -- breaking into CIA headquarters.",
      "rating":       "PG-13",
      "releaseYear":  "2010",
      "trailer":      "https://www.youtube.com/watch?v=SHPti5AVZXU"
    }
    ,
    {
      "titleDisplay": "RED 2",
      "titleFilter":  "RED 2",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/red2.png",
      "genre":        "Comedy, Action",
      "runTime":      "1:56:00",
      "summary":      "Former CIA black-ops agent Frank Moses (Bruce Willis) and his old partner, Marvin Boggs (John Malkovich), are caught in the grip of retirement -- but that soon changes when a powerful Cold War weapon known as Nightshade resurfaces decades after its disappearance. With assassins hot on their trail, Frank and his team set out to find the one scientist (Anthony Hopkins) who can unravel the mystery of Nightshade and help them save themselves -- and the world.",
      "rating":       "PG-13",
      "releaseYear":  "2013",
      "trailer":      "https://www.youtube.com/watch?v=HwNI1qqBKcs"
    }
    ,
    {
      "titleDisplay": "Reign of Fire",
      "titleFilter":  "Reign of Fire",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/reignOfFire.png",
      "genre":        "Action",
      "runTime":      "1:42:00",
      "summary":      "In present-day London, 12-year-old Quinn watches as his mother wakes an enormous fire-breathing beast from its centuries-long slumber. Twenty years later, much of the world has been scarred by the beast and its offspring. As a fire chief, Quinn (Christian Bale) is responsible for warding off the beasts and keeping a community alive as they eke out a meager existence. Into their midst comes a hotshot American, Van Zan (Matthew McConaughey), who says he has a way to kill the beasts.",
      "rating":       "PG-13",
      "releaseYear":  "2002",
      "trailer":      "https://www.youtube.com/watch?v=Wg7bjwEXp7Y"
    }
    ,
    {
      "titleDisplay": "Resurrecting the Champ",
      "titleFilter":  "Resurrecting the Champ",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/resurrectingTheChamp.png",
      "genre":        "Drama",
      "runTime":      "1:52:00",
      "summary":      "Things are not going well for Erik Kernan (Josh Hartnett). Erik, a sports reporter, is stuck covering the bush leagues because his editor (Alan Alda) thinks he cannot cut it as writer. On top of that, his marriage is disintegrating. One night, he rescues a homeless man (Samuel L. Jackson) and discovers the guy is Battling Bob Satterfield, a former boxer rumored to be dead. Erik sees a chance to give his career a much-needed boost by writing the athlete's story.",
      "rating":       "PG-13",
      "releaseYear":  "2007",
      "trailer":      "https://www.youtube.com/watch?v=FoxJBA7EGtw"
    }
    ,
    {
      "titleDisplay": "Return to Me",
      "titleFilter":  "Return to Me",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/returnToMe.png",
      "genre":        "Romance, Comedy",
      "runTime":      "1:55:00",
      "summary":      "Heartbroken and struggling emotionally after his wife's death in a car accident, Bob Rueland (David Duchovny) agrees to go on a blind date set up by his friend Charlie (David Alan Grier). Though the date fizzles, sparks fly between Bob and the waitress, Grace (Minnie Driver), a recovered heart transplant patient with intimacy problems of her own. When Bob discovers Grace's heart came from his own organ donor wife, an unusual romance blossoms between the two.",
      "rating":       "PG",
      "releaseYear":  "2005",
      "trailer":      "https://www.youtube.com/watch?v=oFD8ZE0Muf0"
    }
    ,
    {
      "titleDisplay": "Rise of the Guardians",
      "titleFilter":  "Rise of the Guardians",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/riseOfTheGuardians.png",
      "genre":        "Disney, Comedy",
      "runTime":      "1:37:00",
      "summary":      "Generation after generation, immortal Guardians like Santa Claus (Alec Baldwin), the Easter Bunny (Hugh Jackman) and the Tooth Fairy (Isla Fisher) protect the world's children from darkness and despair. However, an evil boogeyman named Pitch Black (Jude Law) schemes to overthrow the Guardians by obliterating children's belief in them. It falls to a winter sprite named Jack Frost (Chris Pine) to thwart Pitch's plans and save the Guardians from destruction.",
      "rating":       "PG",
      "releaseYear":  "2012",
      "trailer":      "https://www.youtube.com/watch?v=aPLiBxhoug0"
    }
    ,
    {
      "titleDisplay": "Robin Hood",
      "titleFilter":  "Robin Hood",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/robinHood.png",
      "genre":        "Action",
      "runTime":      "2:36:00",
      "summary":      "After the death of Richard the Lion-Hearted, a skilled archer named Robin Longstride (Russell Crowe) travels to Nottingham, where villagers suffer under a despotic sheriff and crippling taxation. He meets and falls in love with a spirited widow, Marion (Cate Blanchett), although she is skeptical of his motives. Hoping to win her heart and save the village, Robin gathers a band of warriors to fight corruption in Nottingham, little knowing they will soon be fighting to save England itself.",
      "rating":       "PG-13",
      "releaseYear":  "2010",
      "trailer":      "https://www.youtube.com/watch?v=fQ6zXDSgwIY"
    }
    ,
    {
      "titleDisplay": "Robin Hood Prince of Thieves",
      "titleFilter":  "Robin Hood Prince of Thieves",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/robinHoodPrince.png",
      "genre":        "Action",
      "runTime":      "2:35:00",
      "summary":      "Nobleman crusader Robin of Locksley (Kevin Costner) breaks out of a Jerusalem prison with the help of Moorish fellow prisoner Azeem (Morgan Freeman) and travels back home to England. But upon arrival he discovers his dead father in the ruins of his family estate, killed by the vicious sheriff of Nottingham (Alan Rickman). Robin and Azeem join forces with outlaws Little John (Nick Brimble) and Will Scarlett (Christian Slater) to save the kingdom from the sheriff's villainy.",
      "rating":       "PG-13",
      "releaseYear":  "1991",
      "trailer":      "https://www.youtube.com/watch?v=fhz5aB-u77Q"
    }
    ,
    {
      "titleDisplay": "The Rookie",
      "titleFilter":  "Rookie, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/theRookie.png",
      "genre":        "Drama",
      "runTime":      "2:09:00",
      "summary":      "A true story about a coach who discovers that it's never too late for dreams to come true. Jim Morris (Dennis Quaid) never made it out of the minor leagues before a shoulder injury ended his pitching career twelve years ago. Now a married-with-children high-school chemistry teacher and baseball coach in Texas, Jim's team makes a deal with him: if they win the district championship, Jim will try out with a major-league organization.",
      "rating":       "G",
      "releaseYear":  "2002",
      "trailer":      "https://www.youtube.com/watch?v=aceWXcvFOvI"
    }
    ,
    {
      "titleDisplay": "Rudy",
      "titleFilter":  "Rudy",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/rudy.png",
      "genre":        "Drama",
      "runTime":      "1:56:00",
      "summary":      "Rudy Ruettiger (Sean Astin) wants to play football at the University of Notre Dame, but has neither the money for tuition nor the grades to qualify for a scholarship. Rudy redoubles his efforts to get out of the steel mill where his father works when his best friend (Christopher Reed) dies in an accident there. Overcoming his dyslexia thanks to his friend and tutor, D-Bob (Jon Favreau), Rudy gains admission to Notre Dame and begins to fight his way onto the school's fabled football team.",
      "rating":       "PG",
      "releaseYear":  "1993",
      "trailer":      "https://www.youtube.com/watch?v=Xm0pTMbDaMI"
    }
    ,
    {
      "titleDisplay": "Safe Haven",
      "titleFilter":  "Safe Haven",
      "editedFlag":   false,
      "toEditFlag":   true,
      "imgPath":      "img/safeHaven.png",
      "genre":        "Romance, Suspense",
      "runTime":      "1:56:00",
      "summary":      "Katie Feldman (Julianne Hough) moves to a small town on the North Carolina coast, determined to make a new life for herself. She takes a job as a waitress and keeps a low profile, but she is soon won over by the warmth and caring of the close-knit community, especially that of widower Alex (Josh Duhamel). With the help of Alex and his children, Katie learns to love and trust again -- but when a mysterious stranger arrives and starts asking questions, Katie's dark past threatens to reclaim her.",
      "rating":       "PG-13",
      "releaseYear":  "2013",
      "trailer":      "https://www.youtube.com/watch?v=mj6i_Z1Srsw"
    }
    ,
    {
      "titleDisplay": "The Sandlot",
      "titleFilter":  "Sandlot, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/sandlot.png",
      "genre":        "Disney, Kids, Comedy",
      "runTime":      "1:42:00",
      "summary":      "When Scottie Smalls (Thomas Guiry) moves to a new neighborhood, he manages to make friends with a group of kids who play baseball at the sandlot. Together they go on a series of funny and touching adventures. The boys run into trouble when Smalls borrows a ball from his stepdad that gets hit over a fence.",
      "rating":       "PG",
      "releaseYear":  "1993",
      "trailer":      "https://www.youtube.com/watch?v=-QDq-e1GbjE"
    }
    ,
    {
      "titleDisplay": "School of Rock",
      "titleFilter":  "School of Rock",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/schoolOfRock.png",
      "genre":        "Comedy, Music",
      "runTime":      "1:49:00",
      "summary":      "Overly enthusiastic guitarist Dewey Finn (Jack Black) gets thrown out of his bar band and finds himself in desperate need of work. Posing as a substitute music teacher at an elite private elementary school, he exposes his students to the hard rock gods he idolizes and emulates -- much to the consternation of the uptight principal (Joan Cusack). As he gets his privileged and precocious charges in touch with their inner rock 'n' roll animals, he imagines redemption at a local Battle of the Bands.",
      "rating":       "PG-13",
      "releaseYear":  "2003",
      "trailer":      "https://www.youtube.com/watch?v=XCwy6lW5Ixc"
    }
    ,
    {
      "titleDisplay": "Secondhand Lions",
      "titleFilter":  "Secondhand Lions",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/secondhandLions.png",
      "genre":        "Drama, Comedy",
      "runTime":      "1:51:00",
      "summary":      "A shy adolescent boy, Walter (Haley Joel Osment), is taken by his greedy mother (Kyra Sedgwick) to spend the summer with his two hard-boiled great-uncles, Hub (Robert Duvall) and Garth (Michael Caine), who are rumored to possess a great fortune. At first, the two old men, both set in their ways, find Walter's presence a nuisance, but they eventually warm up to the boy and regale him with tall tales from their past. In return, Walter helps reawaken their youthful spirit.",
      "rating":       "PG",
      "releaseYear":  "2003",
      "trailer":      "https://www.youtube.com/watch?v=hzElnBgsr0s"
    }
    ,
    {
      "titleDisplay": "The Secret Garden",
      "titleFilter":  "Secret Garden, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/secretGarden.png",
      "genre":        "Drama",
      "runTime":      "1:46:00",
      "summary":      "Adaptation of Frances Hodgson Burnett's classic fairy tale, 'The Secret Garden.' Mary Lennox (Kate Maberly) is an orphan sent to live with her uncle at his mansion that is full of secrets. She discovers a crippled cousin she never knew she had and a neglected garden she is determined to bring back to life.",
      "rating":       "G",
      "releaseYear":  "1993",
      "trailer":      "https://www.youtube.com/watch?v=cBeMKczPRoI"
    }
    ,
    {
      "titleDisplay": "Sense and Sensability",
      "titleFilter":  "Sense and Sensability",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/senseAndSensibility.png",
      "genre":        "Romance",
      "runTime":      "2:20:00",
      "summary":      "When Elinor Dashwood's (Emma Thompson) father dies, her family's finances are crippled. After the Dashwoods move to a cottage in Devonshire, Elinor's sister Marianne (Kate Winslet) is torn between the handsome John Willoughby (Greg Wise) and the older Colonel Brandon (Alan Rickman). Meanwhile, Elinor's romantic hopes with Edward Ferrars (Hugh Grant) are hindered due to his prior engagement. Both Elinor and Marianne strive for love while the circumstances in their lives constantly change.",
      "rating":       "PG",
      "releaseYear":  "1995",
      "trailer":      "https://www.youtube.com/watch?v=eJMnm28vAqQ"
    }
    ,
    {
      "titleDisplay": "Seven Brides For Seven Brothers",
      "titleFilter":  "Seven Brides For Seven Brothers",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/sevenBridesForSevenBrothers.png",
      "genre":        "Romance, Comedy, Music",
      "runTime":      "1:43:00",
      "summary":      "During the 1850s, Milly (Jane Powell), a pretty young cook, marries Adam (Howard Keel), a grizzled woodsman, after a brief courtship. When the two return to Adam's farm, Milly is shocked to meet his six ill-mannered brothers, all of whom live in his cabin. She promptly begins teaching the brothers proper behavior, and most importantly, how to court a woman. But after the brothers kidnap six local girls during a town barn-raising, a group of indignant villagers tries to track them down.",
      "rating":       "G",
      "releaseYear":  "1954",
      "trailer":      "https://www.youtube.com/watch?v=CfFFFfRwsR0"
    }
    ,
    {
      "titleDisplay": "Seven Pounds",
      "titleFilter":  "Seven Pounds",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/sevenPounds.png",
      "genre":        "Drama",
      "runTime":      "2:03:00",
      "summary":      "A life-shattering secret torments Ben Thomas (Will Smith). In order to find redemption, he sets out to change the lives of seven strangers. Over the course of his journey, he meets and falls in love with a cardiac patient named Emily (Rosario Dawson), and in so doing, complicates his mission.",
      "rating":       "PG-13",
      "releaseYear":  "2008",
      "trailer":      "https://www.youtube.com/watch?v=7kpK1fKzoDs"
    }
    ,
    {
      "titleDisplay": "Simon Birch",
      "titleFilter":  "Simon Birch",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/simonBirch.png",
      "genre":        "Drama",
      "runTime":      "1:55:00",
      "summary":      "Simon Birch (Ian Michael Smith) and Joe Wenteworth (Joseph Mazzello) are boys who have a reputation for being oddballs. Joe never knew his father, and his mother, Rebecca (Ashley Judd), is keeping her lips sealed, no matter how much he protests. Simon, meanwhile, is an 11-year-old dwarf whose outsize personality belies his small stature. Indeed, he often assails the local reverend (David Strathairn) with thorny theological questions and joins Joe on his quest to find his biological father.",
      "rating":       "PG",
      "releaseYear":  "1980",
      "trailer":      "https://www.youtube.com/watch?v=AGU8cOHxSxo"
    }
    ,
    {
      "titleDisplay": "Singing in the Rain",
      "titleFilter":  "Singing in the Rain",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/singingInTheRain.png",
      "genre":        "Drama, Music",
      "runTime":      "1:43:00",
      "summary":      "A spoof of the turmoil that afflicted the movie industry in the late 1920s when movies went from silent to sound. When two silent movie stars', Don Lockwood and Lina Lamont, latest movie is made into a musical a chorus girl is brought in to dub Lina's speaking and singing. Don is on top of the world until Lina finds out.",
      "rating":       "G",
      "releaseYear":  "1952",
      "trailer":      "https://www.youtube.com/watch?v=yCEupjKr7uo"
    }
    ,
    {
      "titleDisplay": "Sister Act 1",
      "titleFilter":  "Sister Act 1",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/sisterAct.png",
      "genre":        "Music, Comedy",
      "runTime":      "1:40:00",
      "summary":      "When lively lounge singer Deloris Van Cartier (Whoopi Goldberg) sees her mobster beau, Vince LaRocca (Harvey Keitel), commit murder, she is relocated for her protection. Set up in the guise of a nun in a California convent, Deloris proceeds to upend the quiet lives of the resident sisters. In an effort to keep her out of trouble, they assign Deloris to the convent's choir, an ensemble that she soon turns into a vibrant and soulful act that gains widespread attention.",
      "rating":       "PG",
      "releaseYear":  "1990",
      "trailer":      "https://www.youtube.com/watch?v=pAsJxAZl558"
    }
    ,
    {
      "titleDisplay": "Sister Act 2",
      "titleFilter":  "Sister Act 2",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/sisterActTwo.png",
      "genre":        "Music, Comedy",
      "runTime":      "1:47:00",
      "summary":      "In this sequel, Las Vegas performer Deloris Van Cartier (Whoopi Goldberg) is surprised by a visit from her nun friends, including Sister Mary Patrick (Kathy Najimy) and Sister Mary Lazarus (Mary Wickes). It appears Deloris is needed in her nun guise as Sister Mary Clarence to help teach music to teens at a troubled school in hopes of keeping the facility from closing at the hands of Mr. Crisp (James Coburn), a callous administrator. Can Deloris shape the rowdy kids into a real choir?",
      "rating":       "PG",
      "releaseYear":  "1993",
      "trailer":      "https://www.youtube.com/watch?v=k80E5KTjvmA"
    }
    ,
    {
      "titleDisplay": "Sleeping Beauty",
      "titleFilter":  "Sleeping Beauty",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/sleepingBeauty.png",
      "genre":        "Disney",
      "runTime":      "1:16:00",
      "summary":      "Filled with jealousy, the evil witch Maleficent (Eleanor Audley) curses Princess Aurora (Mary Costa) to die on her 16th birthday. Thanks to Aurora's guardian fairies (Verna Felton, Barbara Jo Allen, Barbara Luddy), she only falls into a deep sleep that can be ended with a kiss from her betrothed, Prince Phillip (Bill Shirley). To prevent Phillip from rescuing Aurora, Maleficent kidnaps and imprisons him. The good fairies are the last hope to free Phillip so that he can awaken Aurora.",
      "rating":       "G",
      "releaseYear":  "1959",
      "trailer":      "https://www.youtube.com/watch?v=CfsyUyi_FJM"
    }
    ,
    {
      "titleDisplay": "Space Jam",
      "titleFilter":  "Space Jam",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/spaceJam.png",
      "genre":        "Disney, Kids, Comedy",
      "runTime":      "1:40:00",
      "summary":      "Swackhammer (Danny DeVito), an evil alien theme park owner, needs a new attraction at Moron Mountain. When his gang, the Nerdlucks, heads to Earth to kidnap Bugs Bunny (Billy West) and the Looney Tunes, Bugs challenges them to a basketball game to determine their fate. The aliens agree, but they steal the powers of NBA basketball players, including Larry Bird (Larry Bird) and Charles Barkley (Charles Barkley) -- so Bugs gets some help from superstar Michael Jordan (Michael Jordan).",
      "rating":       "PG",
      "releaseYear":  "1999",
      "trailer":      "https://www.youtube.com/watch?v=u7AYd8uGG6E"
    }
    ,
    {
      "titleDisplay": "Spider-man 1",
      "titleFilter":  "Spider-man 1, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/spiderMan.png",
      "genre":        "Action, Romance",
      "runTime":      "2:01:00",
      "summary":      "'Spider-Man' centers on student Peter Parker (Tobey Maguire) who, after being bitten by a genetically-altered spider, gains superhuman strength and the spider-like ability to cling to any surface. He vows to use his abilities to fight crime, coming to understand the words of his beloved Uncle Ben: 'With great power comes great responsibility.'",
      "rating":       "PG-13",
      "releaseYear":  "2001",
      "trailer":      "https://www.youtube.com/watch?v=O7zvehDxttM"
    }
    ,
    {
      "titleDisplay": "The Amazing Spider-man",
      "titleFilter":  "Spider-man Amazing 1, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/spiderman2012.png",
      "genre":        "Action, Romance",
      "runTime":      "2:16:00",
      "summary":      "Abandoned by his parents and raised by an aunt and uncle, teenager Peter Parker (Andrew Garfield), AKA Spider-Man, is trying to sort out who he is and exactly what his feelings are for his first crush, Gwen Stacy (Emma Stone). When Peter finds a mysterious briefcase that was his father's, he pursues a quest to solve his parents' disappearance. His search takes him to Oscorp and the lab of Dr. Curt Connors (Rhys Ifans), setting him on a collision course with Connors' alter ego, the Lizard.",
      "rating":       "PG-13",
      "releaseYear":  "2012",
      "trailer":      "https://www.youtube.com/watch?v=atCfTRMyjGU"
    }
    ,
    {
      "titleDisplay": "Spider-man 2",
      "titleFilter":  "Spider-man 2, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/spiderMan2004.png",
      "genre":        "Action, Romance",
      "runTime":      "2:15:00",
      "summary":      "When a failed nuclear fusion experiment results in an explosion that kills his wife, Dr. Otto Octavius (Alfred Molina) is transformed into Dr. Octopus, a cyborg with deadly metal tentacles. Doc Ock blames Spider-Man (Tobey Maguire) for the accident and seeks revenge. Meanwhile, Spidey's alter ego, Peter Parker, faces fading powers and self-doubt. Complicating matters are his best friend's (James Franco) hatred for Spider-Man and his true love's (Kirsten Dunst) sudden engagement to another man.",
      "rating":       "PG-13",
      "releaseYear":  "2004",
      "trailer":      "https://www.youtube.com/watch?v=O3QLXrYOiUI"
    }
    ,
    {
      "titleDisplay": "Star Trek 1",
      "titleFilter":  "Star Trek 1",
      "editedFlag":   false,
      "toEditFlag":   true,
      "imgPath":      "img/starTrek.png",
      "genre":        "Action",
      "runTime":      "2:08:00",
      "summary":      "Aboard the USS Enterprise, the most-sophisticated starship ever built, a novice crew embarks on its maiden voyage. Their path takes them on a collision course with Nero (Eric Bana), a Romulan commander whose mission of vengeance threatens all mankind. If humanity would survive, a rebellious young officer named James T. Kirk (Chris Pine) and a coolly logical Vulcan named Spock (Zachary Quinto) must move beyond their rivalry and find a way to defeat Nero before it is too late.",
      "rating":       "PG-13",
      "releaseYear":  "2009",
      "trailer":      "https://www.youtube.com/watch?v=SyJszxnJydA"
    }
    ,
    {
      "titleDisplay": "Star Trek 2 - Into Darkness",
      "titleFilter":  "Star Trek 2 - Into Darkness",
      "editedFlag":   false,
      "toEditFlag":   true,
      "imgPath":      "img/starTrekTwo.png",
      "genre":        "Action",
      "runTime":      "2:13:00",
      "summary":      "The crew of the Starship Enterprise returns home after an act of terrorism within its own organization destroys most of Starfleet and what it represents, leaving Earth in a state of crisis. With a personal score to settle, Capt. James T. Kirk (Chris Pine) leads his people (Zachary Quinto, Karl Urban, Zoë Saldana) on a mission to capture a one-man weapon of mass destruction, thereby propelling all of them into an epic game of life and death.",
      "rating":       "PG-13",
      "releaseYear":  "2013",
      "trailer":      "https://www.youtube.com/watch?v=r5gdbUC9mWU"
    }
    ,
    {
      "titleDisplay": "Star Wars Episode I - The Phantom Menace",
      "titleFilter":  "Star Wars Episode I - The Phantom Menace",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/starWars1.png",
      "genre":        "Action, Fantasy",
      "runTime":      "2:16:00",
      "summary":      "Obi-Wan Kenobi (Ewan McGregor) is a young apprentice Jedi knight under the tutelage of Qui-Gon Jinn (Liam Neeson) ; Anakin Skywalker (Jake Lloyd), who will later father Luke Skywalker and become known as Darth Vader, is just a 9-year-old boy. When the Trade Federation cuts off all routes to the planet Naboo, Qui-Gon and Obi-Wan are assigned to settle the matter.",
      "rating":       "PG",
      "releaseYear":  "1999",
      "trailer":      "https://www.youtube.com/watch?v=I6hOlI9cg4o"
    }
    ,
    {
      "titleDisplay": "Star Wars Episode II - Attack of the Clones",
      "titleFilter":  "Star Wars Episode II - Attack of the Clones",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/starWars2.png",
      "genre":        "Action, Fantasy",
      "runTime":      "2:22:00",
      "summary":      "Set ten years after the events of 'The Phantom Menace,' the Republic continues to be mired in strife and chaos. A separatist movement encompassing hundreds of planets and powerful corporate alliances poses new threats to the galaxy that even the Jedi cannot stem. These moves, long planned by an as yet unrevealed and powerful force, lead to the beginning of the Clone Wars -- and the beginning of the end of the Republic.",
      "rating":       "PG",
      "releaseYear":  "2002",
      "trailer":      "https://www.youtube.com/watch?v=gYbW1F_c9eM"
    }
    ,
    {
      "titleDisplay": "Star Wars Episode III - Revenge of the Sith",
      "titleFilter":  "Star Wars Episode III - Revenge of the Sith",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/starWars3.png",
      "genre":        "Action, Fantasy",
      "runTime":      "2:20:00",
      "summary":      "It has been three years since the Clone Wars began. Jedi Master Obi-Wan Kenobi (Ewan McGregor) and Jedi Knight Anakin Skywalker (Hayden Christensen) rescue Chancellor Palpatine (Ian McDiarmid) from General Grievous, the commander of the droid armies, but Grievous escapes. Suspicions are raised within the Jedi Council concerning Chancellor Palpatine, with whom Anakin has formed a bond. Asked to spy on the chancellor, and full of bitterness toward the Jedi Council, Anakin embraces the Dark Side.",
      "rating":       "PG-13",
      "releaseYear":  "2005",
      "trailer":      "https://www.youtube.com/watch?v=MR1xo1tLyBk"
    }
    ,
    {
      "titleDisplay": "Star Wars Episode IV - A New Hope",
      "titleFilter":  "Star Wars Episode IV - A New Hope",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/starWars4.png",
      "genre":        "Action, Fantasy",
      "runTime":      "2:05:00",
      "summary":      "The Imperial Forces -- under orders from cruel Darth Vader (David Prowse) -- hold Princess Leia (Carrie Fisher) hostage, in their efforts to quell the rebellion against the Galactic Empire. Luke Skywalker (Mark Hamill) and Han Solo (Harrison Ford), captain of the Millennium Falcon, work together with the companionable droid duo R2-D2 (Kenny Baker) and C-3PO (Anthony Daniels) to rescue the beautiful princess, help the Rebel Alliance, and restore freedom and justice to the Galaxy.",
      "rating":       "PG",
      "releaseYear":  "1977",
      "trailer":      "https://www.youtube.com/watch?v=367FSjWvNB4"
    }
    ,
    {
      "titleDisplay": "Star Wars Episode V - The Empire Strikes Back",
      "titleFilter":  "Star Wars Episode V - The Empire Strikes Back",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/starWars5.png",
      "genre":        "Action, Fantasy",
      "runTime":      "2:07:00",
      "summary":      "The adventure continues in this 'Star Wars' sequel. Luke Skywalker (Mark Hamill), Han Solo (Harrison Ford), Princess Leia (Carrie Fisher) and Chewbacca (Peter Mayhew) face attack by the Imperial forces and its AT-AT walkers on the ice planet Hoth. While Han and Leia escape in the Millennium Falcon, Luke travels to Dagobah in search of Yoda. Only with the Jedi master's help will Luke survive when the dark side of the Force beckons him into the ultimate duel with Darth Vader (David Prowse).",
      "rating":       "PG",
      "releaseYear":  "1980",
      "trailer":      "https://www.youtube.com/watch?v=PkEKIw0FU6Y"
    }
    ,
    {
      "titleDisplay": "Star Wars Episode VI - Return of the Jedi",
      "titleFilter":  "Star Wars Episode VI - Return of the Jedi",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/starWars6.png",
      "genre":        "Action, Fantasy",
      "runTime":      "2:16:00",
      "summary":      "Luke Skywalker (Mark Hamill) battles horrible Jabba the Hut and cruel Darth Vader to save his comrades in the Rebel Alliance and triumph over the Galactic Empire. Han Solo (Harrison Ford) and Princess Leia (Carrie Fisher) reaffirm their love and team with Chewbacca, Lando Calrissian (Billy Dee Williams), the Ewoks and the androids C-3PO and R2-D2 to aid in the disruption of the Dark Side and the defeat of the evil emperor.",
      "rating":       "PG",
      "releaseYear":  "1983",
      "trailer":      "https://www.youtube.com/watch?v=5UfA_aKBGMc"
    }
    ,
    {
      "titleDisplay": "Star Wars Episode VII - The Force Awakens",
      "titleFilter":  "Star Wars Episode VII - The Force Awakens",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/starWars7.png",
      "genre":        "Action, Fantasy",
      "runTime":      "2:15:00",
      "summary":      "Thirty years after the defeat of the Galactic Empire, the galaxy faces a new threat from the evil Kylo Ren (Adam Driver) and the First Order. When a defector named Finn crash-lands on a desert planet, he meets Rey (Daisy Ridley), a tough scavenger whose droid contains a top-secret map. Together, the young duo joins forces with Han Solo (Harrison Ford) to make sure the Resistance receives the intelligence concerning the whereabouts of Luke Skywalker (Mark Hamill), the last of the Jedi Knights.",
      "rating":       "PG-13",
      "releaseYear":  "2015",
      "trailer":      "https://www.youtube.com/watch?v=wCc2v7izk8w"
    }
    ,
    {
      "titleDisplay": "Stardust",
      "titleFilter":  "Stardust",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/stardust.png",
      "genre":        "Action, Comedy, Romance",
      "runTime":      "2:08:00",
      "summary":      "To win the heart of his beloved (Sienna Miller), a young man named Tristan (Charlie Cox) ventures into the realm of fairies to retrieve a fallen star. What Tristan finds, however, is not a chunk of space rock, but a woman (Claire Danes) named Yvaine. Yvaine is in great danger, for the king's sons need her powers to secure the throne, and an evil witch (Michelle Pfeiffer) wants to use her to achieve eternal youth and beauty.",
      "rating":       "PG-13",
      "releaseYear":  "2007",
      "trailer":      "https://www.youtube.com/watch?v=VfYBKDyF-Dk"
    }
    ,
    {
      "titleDisplay": "State of Play",
      "titleFilter":  "State of Play",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/stateOfPlay.png",
      "genre":        "Action, Drama",
      "runTime":      "2:08:00",
      "summary":      "Congressman Stephen Collins (Ben Affleck) is a rising star in Washington; handsome, unflappable and seemingly honorable, he's seen as his party's next presidential nominee. Until, however, his research assistant/mistress is found murdered and damaging secrets come pouring out. Journalist Cal McAffrey (Russell Crowe), Collins' old friend, must investigate the murder, and walks headlong into a massive cover-up involving some of the nation's most promising political and corporate figures.",
      "rating":       "PG-13",
      "releaseYear":  "2009",
      "trailer":      "https://www.youtube.com/watch?v=f95KbeQSMok"
    }
    ,
    {
      "titleDisplay": "Sweet Home Alabama",
      "titleFilter":  "Sweet Home Alabama",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/sweetHomeAlabama.png",
      "genre":        "Romance, Comedy",
      "runTime":      "1:49:00",
      "summary":      "New York fashion designer Melanie (Reese Witherspoon) suddenly finds herself engaged to the city's most eligible bachelor. But Melanie's past holds many secrets, including Jake (Josh Lucas), the redneck husband she married in high school, who refuses to divorce her. Bound and determined to end their relationship once and for all, Melanie sneaks back home to Alabama to confront her past, only to discover that you can take the girl out of the South, but you can't take the South out of the girl.",
      "rating":       "PG-13",
      "releaseYear":  "2002",
      "trailer":      "https://www.youtube.com/watch?v=BM89EgWx_Gs"
    }
    ,
    {
      "titleDisplay": "Swing Vote",
      "titleFilter":  "Swing Vote",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/swingVote.png",
      "genre":        "Drama, Comedy",
      "runTime":      "2:00:00",
      "summary":      "Bud Johnson (Kevin Costner), a beer-slinging loser, has one bright spot in his life: his precocious daughter, Molly (Madeline Carroll), who takes care of them both. However, on Election Day, Molly sets off an unforeseen chain of events that results in the race for the presidency coming down to just one vote: her father's.",
      "rating":       "PG-13",
      "releaseYear":  "2008",
      "trailer":      "https://www.youtube.com/watch?v=LWodSDYgfXA"
    }
    ,
    {
      "titleDisplay": "Sydney White",
      "titleFilter":  "Sydney White",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/sydneyWhite.png",
      "genre":        "Romance, Comedy",
      "runTime":      "1:48:00",
      "summary":      "College freshman Sydney White (Amanda Bynes) arrives at Southern Atlantic University, determined to pledge her late mother's sorority. Unfortunately, she finds that the sisterhood has changed since her parent's day. Banished to a condemned house, Sydney joins forces with seven outcasts to take over the student government and win equal rights for nerd and noted alike.",
      "rating":       "PG-13",
      "releaseYear":  "2007",
      "trailer":      "https://www.youtube.com/watch?v=ugVKMXs0Gv8"
    }
    ,
    {
      "titleDisplay": "Tangled",
      "titleFilter":  "Tangled",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/tangled.png",
      "genre":        "Disney, Comedy",
      "runTime":      "1:40:00",
      "summary":      "When the kingdom's most-wanted bandit, Flynn Rider (Zachary Levi), hides in a convenient tower, he immediately becomes a captive of Rapunzel (Mandy Moore), the spire's longtime resident. Crowned with 70 feet of magical golden hair, she has been locked away for years and desperately wants freedom. The feisty teenager strikes a deal with Flynn, and together they begin a whirlwind adventure.",
      "rating":       "PG",
      "releaseYear":  "2010",
      "trailer":      "https://www.youtube.com/watch?v=ip_0CFKTO9E"
    }
    ,
    {
      "titleDisplay": "Tarzan",
      "titleFilter":  "Tarzan",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/tarzan.png",
      "genre":        "Disney, Comedy, Romance",
      "runTime":      "1:28:00",
      "summary":      "In this Disney animated tale, the orphaned Tarzan (Tony Goldwyn) grows up in the remote African wilderness, raised by the gentle gorilla Kala (Glenn Close). When a British expedition enters the jungle, Tarzan encounters the beautiful Jane (Minnie Driver) and recognizes that, like her, he's human. Falling in love with Jane, Tarzan is torn between embracing civilization and staying with his gorilla family, which becomes threatened by the ruthless hunter Clayton (Brian Blessed).",
      "rating":       "G",
      "releaseYear":  "1999",
      "trailer":      "https://www.youtube.com/watch?v=MwU5ZqyhV5Q"
    }
    ,
    {
      "titleDisplay": "Thor",
      "titleFilter":  "Thor 1",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/thor.png",
      "genre":        "Action, Comedy",
      "runTime":      "1:55:00",
      "summary":      "As the son of Odin (Anthony Hopkins), king of the Norse gods, Thor (Chris Hemsworth) will soon inherit the throne of Asgard from his aging father. However, on the day that he is to be crowned, Thor reacts with brutality when the gods' enemies, the Frost Giants, enter the palace in violation of their treaty. As punishment, Odin banishes Thor to Earth. While Loki (Tom Hiddleston), Thor's brother, plots mischief in Asgard, Thor, now stripped of his powers, faces his greatest threat.",
      "rating":       "PG-13",
      "releaseYear":  "2011",
      "trailer":      "https://www.youtube.com/watch?v=JOddp-nlNvQ"
    }
    ,
    {
      "titleDisplay": "Thor 2 - The Dark World",
      "titleFilter":  "Thor 2 - The Dark World",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/thorTwo.png",
      "genre":        "Action",
      "runTime":      "1:52:00",
      "summary":      "In ancient times, the gods of Asgard fought and won a war against an evil race known as the Dark Elves. The survivors were neutralized, and their ultimate weapon -- the Aether -- was buried in a secret location. Hundreds of years later, Jane Foster (Natalie Portman) finds the Aether and becomes its host, forcing Thor (Chris Hemsworth) to bring her to Asgard before Dark Elf Malekith (Christopher Eccleston) captures her and uses the weapon to destroy the Nine Realms -- including Earth.",
      "rating":       "PG-13",
      "releaseYear":  "2013",
      "trailer":      "https://www.youtube.com/watch?v=-hwGggrQL2g"
    }
    ,
    {
      "titleDisplay": "The Three Amigos",
      "titleFilter":  "Three Amigos, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/threeAmigos.png",
      "genre":        "Comedy",
      "runTime":      "1:50:00",
      "summary":      "Three cowboy movie stars from the silent era -- Dusty Bottoms (Chevy Chase), Lucky Day (Steve Martin) and Ned Nederlander (Martin Short) -- are fired when one of their movies bombs. In what seems to be a career-saving offer, young Mexican woman Carmen (Patrice Martinez) offers them a high-paying gig in her village. The three jump at the opportunity, expecting to do their typical act, but Carmen believes they are really heroes and asks them to rid her village of bad guy El Guapo (Alfonso Arau).",
      "rating":       "PG",
      "releaseYear":  "1986",
      "trailer":      "https://www.youtube.com/watch?v=WUTl8DSYUQA"
    }
    ,
    {
      "titleDisplay": "Timeline",
      "titleFilter":  "Timeline",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/timeline.png",
      "genre":        "Action",
      "runTime":      "1:56:00",
      "summary":      "While working at the site of an archaeological dig, Professor Johnston (Billy Connolly) stumbles into a wormhole and plunges back in time to 14th-century France. Mad scientist Robert Doniger (David Thewlis), who accidentally created the wormhole while developing a teleportation device, sends the professor's son, Chris (Paul Walker), and protégé Kate (Frances O'Connor) back in time to retrieve him. Unfortunately, their rescue mission is sidetracked by a bloody battle between France and England.",
      "rating":       "PG-13",
      "releaseYear":  "2003",
      "trailer":      "https://www.youtube.com/watch?v=ZlUCRwvxxbM"
    }
    ,
    {
      "titleDisplay": "Titan A.E.",
      "titleFilter":  "Titan A.E.",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/titanAE.png",
      "genre":        "Action",
      "runTime":      "1:34:00",
      "summary":      "A science-fiction film that combines traditional animation with computer generated images, 'Titan A.E.' takes place in the distant future, after Earth has been obliterated by a mysterious alien race known as the Drej. Cale is a human teenager who has been given a mysterious map by his father, leading him on an unforgettable journey.",
      "rating":       "PG",
      "releaseYear":  "2000",
      "trailer":      "https://www.youtube.com/watch?v=t-BFlw0QQmw"
    }
    ,
    {
      "titleDisplay": "Tora! Tora! Tora!",
      "titleFilter":  "Tora! Tora! Tora!",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/toraToraTora.png",
      "genre":        "Action",
      "runTime":      "2:25:00",
      "summary":      "This dramatic retelling of the Pearl Harbor attack details everything in the days that led up to that tragic moment in American history. As United States and Japanese relations strain over the U.S. embargo of raw materials, Air Staff Officer Minoru Genda (Tatsuya Mihashi) plans the preemptive strike against the United States. Although American intelligence agencies intercept Japanese communications hinting at the attack, they are unwilling to believe such a strike could ever occur on U.S. soil.",
      "rating":       "PG-13",
      "releaseYear":  "1970",
      "trailer":      "https://www.youtube.com/watch?v=WzKtEvm16f4"
    }
    ,
    {
      "titleDisplay": "Tuck Everlasting",
      "titleFilter":  "Tuck Everlasting",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/tuckEverlasting.png",
      "genre":        "Drama, Romance",
      "runTime":      "1:36:00",
      "summary":      "The story of Winnie Foster (Alexis Bledel), a teenage girl on the cusp of maturity. Winnie longs for a life outside the control of her domineering mother, and when lost in the woods near her home, she happens upon Jesse Tuck (Jonathan Jackson), a boy unlike any she's ever met before. He and his family are kind and generous, and they immediately take her in as one of their own. However, the Tucks hold a powerful secret, and Winnie must decide whether to return to her life or stay with the Tucks.",
      "rating":       "PG",
      "releaseYear":  "2002",
      "trailer":      "https://www.youtube.com/watch?v=rXbbAbDvifw"
    }
    ,
    {
      "titleDisplay": "Twilight Saga 2 - New Moon",
      "titleFilter":  "Twilight Saga 2 - New Moon",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/twilight2.png",
      "genre":        "Romance, Fantasy",
      "runTime":      "2:10:00",
      "summary":      "After the abrupt departure of Edward (Robert Pattinson), her vampire love, Bella (Kristen Stewart) finds comfort in her deepening friendship with Jacob Black (Taylor Lautner). However Bella's loyalties are put to the test as she becomes drawn into the world of werewolves, ancient enemies of vampires.",
      "rating":       "PG-13",
      "releaseYear":  "2009",
      "trailer":      "https://www.youtube.com/watch?v=KYBF3HKzrmE"
    }
    ,
    {
      "titleDisplay": "Twilight Saga 3 - Eclipse",
      "titleFilter":  "Twilight Saga 3 - Eclipse",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/twilight3.png",
      "genre":        "Action, Fantasy, Romance",
      "runTime":      "2:04:00",
      "summary":      "Danger once again surrounds Bella (Kristen Stewart), as a string of mysterious killings terrorizes Seattle and a malicious vampire continues her infernal quest for revenge. Amid the tumult, Bella must choose between her love for Edward (Robert Pattinson) and her friendship with Jacob (Taylor Lautner), knowing that her decision may ignite the long-simmering feud between vampire and werewolf.",
      "rating":       "PG-13",
      "releaseYear":  "2010",
      "trailer":      "https://www.youtube.com/watch?v=VvnQ-tHnnNw"
    }
    ,
    {
      "titleDisplay": "Twilight Saga 4 - Breaking Dawn Part 1",
      "titleFilter":  "Twilight Saga 4 - Breaking Dawn Part 1",
      "editedFlag":   false,
      "toEditFlag":   true,
      "imgPath":      "img/twilight4.png",
      "genre":        "Action, Fantasy, Romance",
      "runTime":      "1:57:00",
      "summary":      "At last, Bella (Kristen Stewart) and Edward (Robert Pattinson) are getting married. When Jacob (Taylor Lautner) finds out that Bella wants to spend her honeymoon as a human, he is horrified -- for Edward's passion could accidentally kill her. Bella does indeed survive her honeymoon, but a new complication arises when she discovers that she's pregnant -- and the child is growing at an alarming rate. The pregnancy sets the wolves against Bella and Edward, but Jacob vows to protect his friend.",
      "rating":       "PG-13",
      "releaseYear":  "2011",
      "trailer":      "https://www.youtube.com/watch?v=15kWsOJT4bQ"
    }
    ,
    {
      "titleDisplay": "Twilight Saga 4- Breaking Dawn Part 2",
      "titleFilter":  "Twilight Saga 4- Breaking Dawn Part 2",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/twilight5.png",
      "genre":        "Action, Fantasy, Romance",
      "runTime":      "1:55:00",
      "summary":      "Bella (Kristen Stewart) awakes -- as a vampire -- from her life-threatening labor, and her newborn daughter, Renesmee, proves to be very special indeed. While Bella adjusts to her new state of being, Renesmee experiences accelerated growth. When the Volturi learn of the baby's existence, they declare her to be an abomination and sentence the Cullens to death. Bella, Edward (Robert Pattinson) and the rest of the clan seek help from allies around the world to protect their family.",
      "rating":       "PG-13",
      "releaseYear":  "2012",
      "trailer":      "https://www.youtube.com/watch?v=ti0H-bvMi3I"
    }
    ,
    {
      "titleDisplay": "Twister",
      "titleFilter":  "Twister",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/twister.png",
      "genre":        "Action",
      "runTime":      "1:53:00",
      "summary":      "During the approach of the most powerful storm in decades, university professor Dr. Jo Harding (Helen Hunt) and an underfunded team of students prepare the prototype for Dorothy, a ground-breaking tornado data-gathering device conceived by her estranged husband, Bill (Bill Paxton). When Harding tells Bill that Dorothy is ready for testing -- and that their privately funded rival Dr. Jonas Miller (Cary Elwes) has stolen the idea and built his own -- Bill rejoins the team for one last mission.",
      "rating":       "PG-13",
      "releaseYear":  "1996",
      "trailer":      "https://www.youtube.com/watch?v=AQzJgi046xY"
    }
    ,
    {
      "titleDisplay": "The Ultimate Gift",
      "titleFilter":  "Ultimate Gift, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/ultimateGift.png",
      "genre":        "Drama",
      "runTime":      "1:58:00",
      "summary":      "Jason Stevens (Drew Fuller) lives a life of wealth and privilege. When his grandfather (James Garner) dies, Jason expects to receive a hefty inheritance. Instead, however, Jason must set out on a journey of self-discovery to earn the true gift his grandfather meant for him to have. Along the way, Jason befriends a dying girl (Abigail Breslin) and her mother (Ali Hillis) and learns what is really important in life.",
      "rating":       "PG",
      "releaseYear":  "2007",
      "trailer":      "https://www.youtube.com/watch?v=rwXe5eKZr6M"
    }
    ,
    {
      "titleDisplay": "Up",
      "titleFilter":  "Up",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/up.png",
      "genre":        "Disney, Drama",
      "runTime":      "1:49:00",
      "summary":      "Carl Fredricksen (Ed Asner), a 78-year-old balloon salesman, is about to fulfill a lifelong dream. Tying thousands of balloons to his house, he flies away to the South American wilderness. But curmudgeonly Carl's worst nightmare comes true when he discovers a little boy named Russell is a stowaway aboard the balloon-powered house.",
      "rating":       "PG",
      "releaseYear":  "2009",
      "trailer":      "https://www.youtube.com/watch?v=pkqzFUhGPJg"
    }
    ,
    {
      "titleDisplay": "Vantage Point",
      "titleFilter":  "Vantage Point",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/vantagePoint.png",
      "genre":        "Action",
      "runTime":      "1:30:00",
      "summary":      "Witnesses with different points of view try to unravel an assassination attempt on the U.S. president. Special Agents Thomas Barnes (Dennis Quaid) and Kent Taylor (Matthew Fox) are assigned to protect President Ashton during a summit in Spain on the war on terror. Moments after the leader's arrival, shots ring out, and Ashton is down. In the resulting chaos, an American tourist (Forest Whitaker) comes forward with his camcorder, which he believes contains an image of the shooter.",
      "rating":       "PG-13",
      "releaseYear":  "2008",
      "trailer":      "https://www.youtube.com/watch?v=vDp-08uNH0Y"
    }
    ,
    {
      "titleDisplay": "Wall-E",
      "titleFilter":  "Wall-E",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/wallE.png",
      "genre":        "Disney, Romance",
      "runTime":      "1:44:00",
      "summary":      "WALL-E, short for Waste Allocation Load Lifter Earth-class, is the last robot left on Earth. He spends his days tidying up the planet, one piece of garbage at a time. But during 700 years, WALL-E has developed a personality, and he's more than a little lonely. Then he spots EVE (Elissa Knight), a sleek and shapely probe sent back to Earth on a scanning mission. Smitten WALL-E embarks on his greatest adventure yet when he follows EVE across the galaxy.",
      "rating":       "G",
      "releaseYear":  "2008",
      "trailer":      "https://www.youtube.com/watch?v=ZisWjdjs-gM"
    }
    ,
    {
      "titleDisplay": "Welcome to Mooseport",
      "titleFilter":  "Welcome to Mooseport",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/welcomeToMooseport.png",
      "genre":        "Comedy, Romance",
      "runTime":      "2:11:00",
      "summary":      "To recover from a vicious divorce, former U.S. President Monroe Cole (Gene Hackman) retires to his vacation home in sleepy Mooseport, Maine. When the local town council approaches him to run for mayor in the upcoming election, Cole agrees. As he campaigns against his rival, Handy Harrison (Ray Romano), the owner of the local hardware store, Cole comes to learn that well-oiled, sophisticated political machinations have no place in a small town with a friendly populace.",
      "rating":       "PG-13",
      "releaseYear":  "2004",
      "trailer":      "https://www.youtube.com/watch?v=ydxisYfODz4"
    }
    ,
    {
      "titleDisplay": "What About Bob",
      "titleFilter":  "What About Bob",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/whatAboutBob.png",
      "genre":        "Comedy",
      "runTime":      "1:39:00",
      "summary":      "Before going on vacation, self-involved psychiatrist Dr. Leo Marvin (Richard Dreyfuss) has the misfortune of taking on a new patient: Bob Wiley (Bill Murray). An exemplar of neediness and a compendium of phobias, Bob follows Marvin to his family's country house. Dr. Marvin tries to get him to leave; the trouble is, everyone love Bob. As his oblivious patient makes himself at home, Dr. Marvin loses his professional composure and, before long, may be ready for the loony bin himself.",
      "rating":       "PG",
      "releaseYear":  "1991",
      "trailer":      "https://www.youtube.com/watch?v=ptmP1lziJw4"
    }
    ,
    {
      "titleDisplay": "White House Down",
      "titleFilter":  "White House Down",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/whiteHouseDown.png",
      "genre":        "Action",
      "runTime":      "2:17:00",
      "summary":      "Capitol police officer John Cale (Channing Tatum) has just been denied his dream job of protecting President James Sawyer (Jamie Foxx) as a member of the Secret Service. Not wanting to disappoint his young daughter with the bad news, Cale takes her on a tour of the White House. While he and his daughter are there, a heavily armed paramilitary group attacks and seizes control. As the nation's government dissolves in chaos, only Cale can save his daughter, the president and the country.",
      "rating":       "PG-13",
      "releaseYear":  "2013",
      "trailer":      "https://www.youtube.com/watch?v=ndpNqYoN2DM"
    }
    ,
    {
      "titleDisplay": "Willow",
      "titleFilter":  "Willow",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/willow.png",
      "genre":        "Drama, Comedy",
      "runTime":      "2:06:00",
      "summary":      "Enter the world of 'Willow.' Journey to the far corners of your imagination, to a land of myth and magic, where dream and reality live side by side ... to a place that never existed, a time that never was. It is a world where a young man named Willow lives out an adventure that explodes beyond the boundaries of his own hopes and fears.",
      "rating":       "PG",
      "releaseYear":  "1988",
      "trailer":      "https://www.youtube.com/watch?v=TZFtUwAs0wk"
    }
    ,
    {
      "titleDisplay": "Willy Wonka and the Chocolate Factory",
      "titleFilter":  "Willy Wonka and the Chocolate Factory",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/willyWonka.png",
      "genre":        "Drama, Kids",
      "runTime":      "1:29:00",
      "summary":      "The last of five coveted 'golden tickets' falls into the hands of a sweet but very poor boy. He and his grandpa then get a tour of the strangest chocolate factory in the world. The owner leads five young winners on a thrilling and often dangerous tour of his factory.",
      "rating":       "G",
      "releaseYear":  "1971",
      "trailer":      "https://www.youtube.com/watch?v=GNarV_3P4oM"
    }
    ,
    {
      "titleDisplay": "Willy Wonka and the Chocolate Factory",
      "titleFilter":  "Willy Wonka and the Chocolate Factory",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/willyWonka2.png",
      "genre":        "Drama, Kids",
      "runTime":      "1:55:00",
      "summary":      "Based on the beloved Roald Dahl tale, this comedic and fantastical film follows young Charlie Bucket (Freddie Highmore) and his Grandpa Joe (David Kelly) as they join a small group of contest winners who get to tour the magical and mysterious factory of eccentric candy maker Willy Wonka (Johnny Depp). Aided by his diminutive Oompa Loompa workers (Deep Roy), Wonka has a hidden motivation for the tour, one that he will reveal only after the children in the group show their true colors.",
      "rating":       "PG",
      "releaseYear":  "2005",
      "trailer":      "https://www.youtube.com/watch?v=jyB4s9eox2o"
    }
    ,
    {
      "titleDisplay": "Wreck-it Ralph",
      "titleFilter":  "Wreck-it Ralph",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/wreckIt.png",
      "genre":        "Comedy, Disney",
      "runTime":      "2:00:00",
      "summary":      "Arcade-game character Wreck-It Ralph (John C. Reilly) is tired of always being the 'bad guy' and losing to his 'good guy' opponent, Fix-It Felix (Jack McBrayer). Finally, after decades of seeing all the glory go to Felix, Ralph decides to take matters into his own hands. He sets off on a game-hopping trip to prove that he has what it takes to be a hero. However, while on his quest, Ralph accidentally unleashes a deadly enemy that threatens the entire arcade.",
      "rating":       "PG",
      "releaseYear":  "2012",
      "trailer":      "https://www.youtube.com/watch?v=87E6N7ToCxs"
    }
    ,
    {
      "titleDisplay": "X-Men ",
      "titleFilter":  "X-Men 1",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/x-men1.png",
      "genre":        "Action",
      "runTime":      "1:44:00",
      "summary":      "They are children of the atom, homo superior, the next link in the chain of evolution. Each was born with a unique genetic mutation, which at puberty manifested itself in extraordinary powers. In a world filled with hate and prejudice, they are feared by those who cannot accept their differences. Led by Xavier the X-Men fight to protect a world that fears them. They are locked in a battle with former colleague and friend, Magneto who believes humans and mutants should never co-exist.",
      "rating":       "PG-13",
      "releaseYear":  "2000",
      "trailer":      "https://www.youtube.com/watch?v=d-vKUbZYol4"
    }
    ,
    {
      "titleDisplay": "X-Men 2",
      "titleFilter":  "X-Men 2",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/x-men2.png",
      "genre":        "Action",
      "runTime":      "1:44:00",
      "summary":      "In a world where both Mutants and Humans fear each other, Marie, better known as Rogue, runs away from home and hitches a ride with another mutant, known as Logan, a.k.a. Wolverine. Charles Xavier, who owns a school for young mutants, sends Storm and Cyclops to bring them back before it is too late. Magneto, who believes a war is approaching, has an evil plan in mind, and needs young Rogue to help him.",
      "rating":       "PG-13",
      "releaseYear":  "2005",
      "trailer":      "https://www.youtube.com/watch?v=dX5E0NUmQFo"
    }
    ,
    {
      "titleDisplay": "X-Men 3 - The Last Stand",
      "titleFilter":  "X-Men 3 - The Last Stand",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/x-men3.png",
      "genre":        "Action",
      "runTime":      "1:44:00",
      "summary":      "The discovery of a cure for mutations leads to a turning point for Mutants (Hugh Jackman, Halle Berry, Famke Janssen, Anna Paquin, Rebecca Romijn, Kelsey Grammer). They may now choose to give up their powers and become fully human or retain their uniqueness and remain isolated. War looms between the followers of Charles Xavier (Patrick Stewart), who preaches tolerance, and those of Magneto (Ian McKellen), who advocates survival of the fittest.",
      "rating":       "PG-13",
      "releaseYear":  "2006",
      "trailer":      "https://www.youtube.com/watch?v=kajEhbglG7k"
    }
    ,
    {
      "titleDisplay": "X-Men Origins Wolverine",
      "titleFilter":  "X-Men 4 - Wolverine",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/x-men4.png",
      "genre":        "Action",
      "runTime":      "1:47:00",
      "summary":      "Seeking solace from his dark past, Logan (Hugh Jackman), better known as Wolverine, seems to have found love and contentment with Kayla Silverfox (Lynn Collins). Logan's peaceful existence is shattered when Victor Creed (Liev Schreiber), his vicious brother, brutally murders Kayla. Logan's thirst for revenge propels him into the Weapon X program, where he undergoes a painful procedure to bond his bones with adamantium, making him virtually indestructible and more than a match for Victor.",
      "rating":       "PG-13",
      "releaseYear":  "2009",
      "trailer":      "https://www.youtube.com/watch?v=T000Wbq7SKk"
    }
    ,
    {
      "titleDisplay": "X-Men First Class",
      "titleFilter":  "X-Men 5 - First Class",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/x-men5.png",
      "genre":        "Action",
      "runTime":      "2:12:00",
      "summary":      "In the early 1960s, during the height of the Cold War, a mutant named Charles Xavier (James McAvoy) meets a fellow mutant named Erik Lehnsherr (Michael Fassbender). Despite their vastly different backgrounds -- Charles grew up with a wealthy family, while Erik lost his parents at Auschwitz -- the two become close friends. As the world teeters on the brink of a nuclear war, Charles and Erik with other mutants join forces to save humanity. However, a situation soon tears the friends apart.",
      "rating":       "PG-13",
      "releaseYear":  "2011",
      "trailer":      "https://www.youtube.com/watch?v=UrbHykKUfTM"
    }
    ,
    {
      "titleDisplay": "X-Men Days of Future Past",
      "titleFilter":  "X-Men 6 - Days of Future Past",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/x-men6.png",
      "genre":        "Action",
      "runTime":      "2:38:00",
      "summary":      "Convinced that mutants pose a threat to humanity, Dr. Bolivar Trask (Peter Dinklage) develops the Sentinels, enormous robotic weapons that can detect a mutant gene and zero in on that person. In the 21st century, the Sentinels have evolved into highly efficient killing machines. With mutants now facing extinction, Wolverine (Hugh Jackman) volunteers to go back in time and rally the X-Men of the past to help change a pivotal moment in history and thereby save their future.",
      "rating":       "PG-13",
      "releaseYear":  "2014",
      "trailer":      "https://www.youtube.com/watch?v=pK2zYHWDZKo"
    }
    ,
    {
      "titleDisplay": "You've Got Mail",
      "titleFilter":  "You've Got Mail",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/youveGotMail.png",
      "genre":        "Romance, Comedy",
      "runTime":      "1:58:00",
      "summary":      "Struggling boutique bookseller Kathleen Kelly (Meg Ryan) hates Joe Fox (Tom Hanks), the owner of a corporate Foxbooks chain store that just moved in across the street. When they meet online, however, they begin an intense and anonymous Internet romance, oblivious of each other's true identity. Eventually Joe learns that the enchanting woman he's involved with is actually his business rival. He must now struggle to reconcile his real-life dislike for her with the cyber love he's come to feel.",
      "rating":       "PG",
      "releaseYear":  "1998",
      "trailer":      "https://www.youtube.com/watch?v=znESQTt3L80"
    }
    ,
    {
      "titleDisplay": "Monsters Inc.",
      "titleFilter":  "Monsters Inc.",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/monstersInc.png",
      "genre":        "Disney, Comedy",
      "runTime":      "1:32:00",
      "summary":      "A city of monsters with no humans called Monstropolis centers around the city's power company, Monsters, Inc. The lovable, confident, tough, furry blue behemoth-like giant monster named James P. Sullivan (better known as Sulley) and his wisecracking best friend, short, green cyclops monster Mike Wazowski, discover what happens when the real world interacts with theirs in the form of a 2-year-old baby girl dubbed Boo, who accidentally sneaks into the monster world with Sulley one night. And now it's up to Sulley and Mike to send Boo back in her door before anybody finds out, especially two evil villains such as Sulley's main rival as a scarer, chameleon-like Randall (a monster that Boo is very afraid of), who possesses the ability to change the color of his skin, and Mike and Sulley's boss Mr. Waternoose, the chairman and chief executive officer of Monsters, Inc.",
      "rating":       "G",
      "releaseYear":  "2001",
      "trailer":      "https://www.youtube.com/watch?v=cvOQeozL4S0"
    }
    ,
    {
      "titleDisplay": "Indiana Jones - Raiders of the Lost Ark",
      "titleFilter":  "Indiana Jones 1 - Raiders of the Lost Ark",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/indianaJonesOne.png",
      "genre":        "Action, Comedy",
      "runTime":      "1:55:00",
      "summary":      "Renowned archeologist and expert in the occult, Dr. Indiana Jones, is hired by the U.S. Government to find the Ark of the Covenant, which is believed to still hold the ten commandments. Unfortunately, agents of Hitler are also after the Ark. Indy, and his ex-flame Marion, escape from various close scrapes in a quest that takes them from Nepal to Cairo.",
      "rating":       "PG",
      "releaseYear":  "1981",
      "trailer":      "https://www.youtube.com/watch?v=gz4crpFaW4M"
    }
    ,
    {
      "titleDisplay": "Indiana Jones - The Temple of Doom",
      "titleFilter":  "Indiana Jones 2 - The Temple of Doom",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/IndianaJonesTwo.png",
      "genre":        "Action, Comedy",
      "runTime":      "1:58:00",
      "summary":      "The second of the Lucas/Spielberg Indiana Jones epics is set a year or so before the events in Raiders of the Lost Ark. Indy needs to retrieve a precious gem and several kidnapped young boys on behalf of a remote East Indian village. This time he teams up with a night club singer and a 12-year old boy.",
      "rating":       "PG",
      "releaseYear":  "1984",
      "trailer":      "https://www.youtube.com/watch?v=HOwWfns4qqw"
    }
    ,
    {
      "titleDisplay": "Indiana Jones - The Last Crusade",
      "titleFilter":  "Indiana Jones 3 - The Last Crusade",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/IndianaJonesThree.png",
      "genre":        "Action, Comedy",
      "runTime":      "2:08:00",
      "summary":      "An art collector appeals to Jones to embark on a search for the Holy Grail. He learns that another archaeologist has disappeared while searching for the precious goblet, and the missing man is his own father, Dr. Henry Jones. The artifact is much harder to find than they expected, and its powers are too much for those impure in heart.",
      "rating":       "PG-13",
      "releaseYear":  "1989",
      "trailer":      "https://www.youtube.com/watch?v=A7TaY8HWYd8"
    }
    ,
    {
      "titleDisplay": "A League of Their Own",
      "titleFilter":  "A League of Their Own",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/leagueOfTheirOwn.png",
      "genre":        "Drama, Comedy",
      "runTime":      "2:08:00",
      "summary":      "As America's stock of athletic young men is depleted during World War II, a professional all-female baseball league springs up in the Midwest, funded by publicity-hungry candy maker Walter Harvey (Garry Marshall). Competitive sisters Dottie Hinson (Geena Davis) and Kit Keller (Lori Petty) spar with each other, scout Ernie Capadino (Jon Lovitz) and grumpy has-been coach Jimmy Dugan (Tom Hanks) on their way to fame. Madonna and Rosie O'Donnell co-star as two of the sisters' teammates.",
      "rating":       "PG",
      "releaseYear":  "1992",
      "trailer":      "https://www.youtube.com/watch?v=WcN392H2jx0"
    }
    ,
    {
      "titleDisplay": "Sahara",
      "titleFilter":  "sahara",
      "editedFlag":   true,
      "toEditFlag":   false,
      "imgPath":      "img/sahara.png",
      "genre":        "Action, Fantasy, Comedy",
      "runTime":      "2:04:00",
      "summary":      "Master explorer and former US Navy Seal Dirk Pitt and his wisecracking buddy Al Giordino goes on the adventure of a lifetime of seeking out a lost Civil War ironclad battleship known as the 'Ship of Death' that protects a secret cargo is lost somewhere in the deserts of West Africa. But while the two cross paths with a beautiful and brilliant U.N. scientist Dr. Eva Rojas who is being hounded by a ruthless dictator. She believes that the hidden treasure may be connected to a larger problem that threatens the world around them. Hunting for a ship that no one else thinks exists, Dirk, Al, and Eva must rely on their wits and their daring heroics to outsmart dangerous warlords, survive the threatening terrain, and get to the bottom of both mysteries.",
      "rating":       "PG-13",
      "releaseYear":  "2005",
      "trailer":      "https://www.youtube.com/watch?v=VvA4Tbjk8tk"
    }
    ,
    {
      "titleDisplay": "Sneakers",
      "titleFilter":  "sneakers",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Sneakers.png",
      "genre":        "Action, Comedy",
      "runTime":      "2:06:00",
      "summary":      "Computer hacker Martin (Robert Redford) heads a group of specialists who test the security of various San Francisco companies. Martin is approached by two National Security Agency officers who ask him to steal a newly invented decoder. Martin and his team discover that the black box can crack any encryption code, posing a huge threat if it lands in the wrong hands. When Martin realizes the NSA men who approached him are rogue agents, they frame him for the murder of the device's inventor.",
      "rating":       "PG-13",
      "releaseYear":  "1992",
      "trailer":      "https://www.youtube.com/watch?v=LlKDkTbUFhU"
    }
    ,
    {
      "titleDisplay": "The Fugitive",
      "titleFilter":  "Fugitive",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/fugitive.png",
      "genre":        "Action",
      "runTime":      "2:10:00",
      "summary":      "Wrongfully accused of murdering his wife, Richard Kimble (Harrison Ford) escapes from the law in an attempt to find her killer and clear his name. Pursuing him is a team of U.S. marshals led by Deputy Samuel Gerard (Tommy Lee Jones), a determined detective who will not rest until Richard is captured. As Richard leads the team through a series of intricate chases, he discovers the secrets behind his wife's death and struggles to expose the killer before it is too late.",
      "rating":       "PG-13",
      "releaseYear":  "1993",
      "trailer":      "https://www.youtube.com/watch?v=GoyqZJWjOjU"
    }
    ,
    {
      "titleDisplay": "17 Miracles",
      "titleFilter":  "17 Miracles",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/17Miracles.png",
      "genre":        "Doc/Rel, Drama",
      "runTime":      "1:53:00",
      "summary":      "The pioneer trek across the plains of the Mormon pioneers.",
      "rating":       "PG",
      "releaseYear":  "2011",
      "trailer":      "https://www.youtube.com/watch?v=SResQFe35S8"
    }
    ,
    {
      "titleDisplay": "20,000 Leagues Under the Sea",
      "titleFilter":  "20,000 Leagues Under the Sea",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/leaguesUnderTheSea.png",
      "genre":        "Fantasy, Action",
      "runTime":      "2:07:00",
      "summary":      "In 1866, Professor Pierre M. Aronnax (Paul Lukas) and his assistant Conseil (Peter Lorre), stranded in San Francisco by reports of a giant sea monster attacking ships in the Pacific Ocean, are invited to join an expedition to search for the creature. During the search, they and harpooner Ned Land (Kirk Douglas) are thrown overboard during an attack, eventually discovering that the supposed monster is actually a submarine piloted by the brilliant but haunted Captain Nemo (James Mason).",
      "rating":       "G",
      "releaseYear":  "1954",
      "trailer":      "https://www.youtube.com/watch?v=Xhyuey4xU3Q"
    }
    ,
    {
      "titleDisplay": "2012",
      "titleFilter":  "2012",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/2012.png",
      "genre":        "Action, Fantasy, Drama",
      "runTime":      "2:38:00",
      "summary":      "Earth's billions of inhabitants are unaware that the planet has an expiration date. With the warnings of an American scientist (Chiwetel Ejiofor), world leaders begin secret preparations for the survival of select members of society. When the global cataclysm finally occurs, failed writer Jackson Curtis (John Cusack) tries to lead his family to safety as the world starts falling apart.",
      "rating":       "PG-13",
      "releaseYear":  "2009",
      "trailer":      "https://www.youtube.com/watch?v=ce0N3TEcFw0"
    }
    ,
    {
      "titleDisplay": "Apollo 13",
      "titleFilter":  "Apollo 13",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/apollo.png",
      "genre":        "Drama, Action",
      "runTime":      "2:20:00",
      "summary":      "This Hollywood drama is based on the events of the Apollo 13 lunar mission, astronauts Jim Lovell (Tom Hanks), Fred Haise (Bill Paxton) and Jack Swigert (Kevin Bacon) find everything going according to plan after leaving Earth's orbit. However, when an oxygen tank explodes, the scheduled moon landing is called off. Subsequent tensions within the crew and numerous technical problems threaten both the astronauts' survival and their safe return to Earth.",
      "rating":       "PG",
      "releaseYear":  "1995",
      "trailer":      "https://www.youtube.com/watch?v=nEl0NsYn1fU"
    }
    ,
    {
      "titleDisplay": "The Best Two Years",
      "titleFilter":  "Best two years",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/bestTwoYears.png",
      "genre":        "Comedy, Drama, Doc/Rel",
      "runTime":      "1:52:00",
      "summary":      "Two pairs of Mormon missionaries from America live in a beaten-up apartment in the Dutch city of Haarlem. Their personalities are distinctly different. Appropriately, the most responsible one, Elder Johnson, is the District Leader and oversees their efforts. His companion, the vain Elder Van Pelt, seeks to become the assistant to the mission president (the top post available) as soon as possible, and he receives letters from three girlfriends he left behind. The capable Elder Rogers has become disillusioned and inattentive to his duties ever since a previous missionary companion returned to America, looked up and married Elder Roger's girlfriend. As a result he is simply marking time until he returns home in a few weeks time. The three meet Elder Roger's new companion, Elder Calhoun, in the train station. This new elder is a nerdy but enthusiastic 'greenie' that has just arrived from the Missionary Training Center (MTC) in Utah. Unfortunately his training did not give him much fluency...",
      "rating":       "PG",
      "releaseYear":  "2004",
      "trailer":      "https://www.youtube.com/watch?v=QRwqUb585h8"
    }
    ,
    {
      "titleDisplay": "Charly",
      "titleFilter":  "Charly",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/charly.png",
      "genre":        "Doc/Rel, Comedy, Romance, Drama",
      "runTime":      "1:43:00",
      "summary":      "Sam Roberts thinks he has all the answers: the purpose of life, the meaning of love, the plan for a perfect future. Until Charly walks into his life. As different as Salt Lake City and New York City, Sam and Charly are thrown together by circumstance and repelled by differences. He's scheduled and idealistic. She's spontaneous and cynical. He's guarded and practical. She's open and mischevious. He's a Mormon. She isn't. Differences spark interest, though, as Charly finds depth in Sam's idealism and Sam seeks the vibrance of Charly's joie de vivre. But all is not smooth in the Rockies, as their relationship accelerates - cultural differences, family issues, former loves and life-altering challenges threaten to shake things up.",
      "rating":       "PG",
      "releaseYear":  "2002",
      "trailer":      "https://www.youtube.com/watch?v=ZwhN_KBECIE"
    }
    ,
    {
      "titleDisplay": "Cowboys and Aliens",
      "titleFilter":  "Cowboys and Aliens",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/cowboysAndAliens.png",
      "genre":        "PG-13",
      "runTime":      "2:15:00",
      "summary":      "Bearing a mysterious metal shackle on his wrist, an amnesiac gunslinger (Daniel Craig) wanders into a frontier town called Absolution. He quickly finds that strangers are unwelcome, and no one does anything without the approval of tyrannical Col. Dolarhyde (Harrison Ford). But when Absolution faces a threat from beyond Earth, the stranger finds that he is its only hope of salvation. He unites townspeople, outlaws and Apache warriors against the alien forces in an epic battle for survival.",
      "rating":       "PG-13",
      "releaseYear":  "2011",
      "trailer":      "https://www.youtube.com/watch?v=zH7KZD5vGBY"
    }
    ,
    {
      "titleDisplay": "Easter Dream",
      "titleFilter":  "Easter Dream",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/easterDream.png",
      "genre":        "Doc/Rel",
      "runTime":      "0:22:00",
      "summary":      "",
      "rating":       "",
      "releaseYear":  "1990",
      "trailer":      "https://www.youtube.com/watch?v=pl-dWrhqoxU"
    }
    ,
    {
      "titleDisplay": "Harry and the Hendersons",
      "titleFilter":  "Harry and the Hendersons",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/harryHendersons.png",
      "genre":        "Comedy, Fantasy",
      "runTime":      "1:51:00",
      "summary":      "While returning from a trip in the woods, George Henderson (John Lithgow) and his family run into something with their car that turns out to be a Sasquatch. Thinking the creature is dead, they take him home, but 'Harry' (Kevin Peter Hall) soon awakens. Despite their initial fears, Harry is a kind and sensitive being, and the Hendersons become very fond of him. However, it is difficult to keep him a secret, and soon they begin to fear for Harry's safety.",
      "rating":       "PG",
      "releaseYear":  "1987",
      "trailer":      "https://www.youtube.com/watch?v=5DOX1Poxro4"
    }
    ,
    {
      "titleDisplay": "The Incredible Hulk",
      "titleFilter":  "Hulk",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/hulk.png",
      "genre":        "Fantasy, Action",
      "runTime":      "1:54:00",
      "summary":      "Scientist Bruce Banner (Edward Norton) desperately seeks a cure for the gamma radiation that contaminated his cells and turned him into The Hulk. Cut off from his true love Betty Ross (Liv Tyler) and forced to hide from his nemesis, Gen. Thunderbolt Ross (William Hurt), Banner soon comes face-to-face with a new threat: a supremely powerful enemy known as The Abomination (Tim Roth).",
      "rating":       "PG-13",
      "releaseYear":  "2008",
      "trailer":      "www.youtube.com/watch?v=dz6eBeW19Lg"
    }
    ,
    {
      "titleDisplay": "Johny Lingo",
      "titleFilter":  "Johny Lingo",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/johnnyLingo.png",
      "genre":        "Doc/Rel, Comedy",
      "runTime":      "0:25:00",
      "summary":      "Johnny Lingo, one of the sharpest traders in the south pacific islands decides to bargain for a wife, and offers a record price of eight cows for Mahana, a plain girl who shuns contact. This causes quite a sensation on the island. A year later Johnny and his wife return for the first time since the marriage, and all find that something miraculous has occurred to Mahana. Johnny explains that by paying eight cows he proved that she was worth more to him than any other woman on the island. He gave her a great gift, that of self-worth.",
      "rating":       "",
      "releaseYear":  "1969",
      "trailer":      "https://www.youtube.com/watch?v=pfahoLfrddU"
    }
    ,
    {
      "titleDisplay": "Legacy",
      "titleFilter":  "Legacy",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/legacy.png",
      "genre":        "Doc/Rel, Drama",
      "runTime":      "0:53:00",
      "summary":      "The story of the Mormon pioneers from the 1830's to the 1890's. The movie follows the experiences of Eliza Williams from New York to Missouri to Illinois to Utah. Eliza endures sickness, storms, and mobs because she has a testimony of her new religion.",
      "rating":       "PG",
      "releaseYear":  "1990",
      "trailer":      "https://www.youtube.com/watch?v=ogZLZhnSNOA"
    }
    ,
    {
      "titleDisplay": "Mobsters and Mormons",
      "titleFilter":  "Mobsters and Mormons",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/mobstersMormons.png",
      "genre":        "Doc/Rel, Comedy",
      "runTime":      "1:30:00",
      "summary":      "When forced by the FBI to rat out mob boss Angelo Marcello, Carmine 'The Beans' Pasquale is a wanted man on the lam being hunted by hit man Little Nicky Cappuccio. Taking along wife Gina and son Vincent, Carmine enters the federal witness relocation program and is given a new home and a new identity. Now known as The Cheeseman Family from Omaha, Nebraska, these former East Coast mobsters are relocated into the middle of a quiet, straight laced Mormon community in Utah where much to Carmine's frustration; he can't even find a decent cup of coffee let alone a horse track. Life in this small town becomes anything but ordinary once The Cheesemans move in. Many locals are weary, if not outright afraid of these rough around the edges outsiders, while others go annoyingly far out their way to try to embrace them. Despite the efforts of well meaning neighbor Michael Jaymes to help Carmine feel welcome, Carmine can't help but wonder if being this much of a fish out of water -- is actually...",
      "rating":       "PG",
      "releaseYear":  "2005",
      "trailer":      "https://www.youtube.com/watch?v=N0Kb0scg0jk"
    }
    ,
    {
      "titleDisplay": "A Night at the Museum 2 - Battle of the Smithsonian",
      "titleFilter":  "Night at the Museum 2",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/nightMuseum2.png",
      "genre":        "PG",
      "runTime":      "2:00:00",
      "summary":      "Once the night guard at the Museum of Natural History, Larry Daley (Ben Stiller) is now a successful purveyor of infomercial products. Soon after learning that his museum friends have been shipped to the Smithsonian Institution, Larry receives a distress call from Jedediah, who warns him that four of history's greatest villains have come to life and are planning to take over the Smithsonian first, then the world. Larry joins forces with friends old and new to stop the quartet's nefarious plans.",
      "rating":       "PG",
      "releaseYear":  "2009",
      "trailer":      "https://www.youtube.com/watch?v=UQyrz5V7Vuw"
    }
    ,
    {
      "titleDisplay": "The Other Side of Heaven",
      "titleFilter":  "Other Side of Heaven, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/otherSideofHeaven.png",
      "genre":        "Doc/Rel, Comedy, Drama",
      "runTime":      "1:53:00",
      "summary":      "John H. Groberg, a middle class kid from Idaho Falls, crosses the Pacific to become a Mormon missionary in the remote and exotic Tongan island kingdom during the 1950's. He leaves behind a loving family and the true love of his life, Jean. Through letters and musings across the miles, John shares his humbling and sometimes hilarious adventures with 'the girl back home', and her letters buoy up his spirits in difficult times. John must struggle to overcome language barriers, physical hardship and deep-rooted suspicion to earn the trust and love of the Tongan people he has come to serve. Throughout his adventure-filled three years on the islands, he discovers friends and wisdom in the most unlikely places. John H. Groberg's Tongan odyssey will change his life forever.",
      "rating":       "PG",
      "releaseYear":  "2001",
      "trailer":      "https://www.youtube.com/watch?v=5dKsHYzIoUI"
    }
    ,
    {
      "titleDisplay": "The 2nd Singles Ward",
      "titleFilter":  "Singles Ward 2",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/singlesward2.png",
      "genre":        "Doc/Rel, Comedy, Romance",
      "runTime":      "1:27:00",
      "summary":      "When Dalen (Kirby Heyborne) meets the spunky and beautiful Christine (Erin Chambers), it's love at first sight - even though her non-member parents can't see it! When Christine's parents arrive in Utah for the nuptials, Dalen and Christine must keep the peace between her warring parents ... and everyone else!",
      "rating":       "PG",
      "releaseYear":  "2007",
      "trailer":      "https://www.youtube.com/watch?v=XxlX3lTzp48"
    }
    ,
    {
      "titleDisplay": "The Testaments",
      "titleFilter":  "Testaments, The",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/testaments.png",
      "genre":        "Doc/Rel",
      "runTime":      "1:07:00",
      "summary":      "Although in America, Helam witnesses the star heralding the birth of Christ, and 33 years later he faithfully awaits the promised coming of The Messiah despite persecution for this belief. Helam's son, Jacob, is interested more in the ways of the world, including the lovely Laneah, and when his abilities as an artisan bring an offer to work for the wealthy and powerful Kohor, he jumps at the chance and is estranged from his father's house. Kohor is plotting to destabilize the existing government and become the absolute ruler. In contrast, Amaron, a holy man, preaches to people of Christ, whose ministry and miracles are concurrently taking place across the seas in The Holy Land. As Jacob becomes more immersed in the secular life of Kohor's house, Laneah becomes more interested in the humble faith he is forsaking. Her conversion to Christ, and the death of Amaron at the hand of Kohor's men, brings Jacob to his senses, but he knows of Kohor's plans and is imprisoned when he refuses to ...",
      "rating":       "PG",
      "releaseYear":  "2000",
      "trailer":      "https://www.youtube.com/watch?v=gUEkox4QeXk"
    }
    ,
    {
      "titleDisplay": "Tron",
      "titleFilter":  "Tron 1",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/tronOld.png",
      "genre":        "Fantasy, Action",
      "runTime":      "1:36:00",
      "summary":      "When talented computer engineer Kevin Flynn (Jeff Bridges) finds out that Ed Dillinger (David Warner), an executive at his company, has been stealing his work, he tries to hack into the system. However, Flynn is transported into the digital world, where he has to face off against Dillinger's computerized likeness, Sark, and the imposing Master Control Program. Aided by Tron (Bruce Boxleitner) and Yori (Cindy Morgan), Flynn becomes a freedom fighter for the oppressed programs of the grid.",
      "rating":       "PG",
      "releaseYear":  "1982",
      "trailer":      "https://www.youtube.com/watch?v=3efV2wqEjEY"
    }
    ,
    {
      "titleDisplay": "Tron: Legacy",
      "titleFilter":  "Tron 2",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/tronNew.png",
      "genre":        "Fantasy, Action",
      "runTime":      "2:07:00",
      "summary":      "Sam (Garrett Hedlund), the son of famous video-game developer Kevin Flynn (Jeff Bridges), has been haunted for a long time by his father's mysterious disappearance. A strange signal draws Sam to Flynn's Arcade, and he is pulled into the same cyberworld in which his father, its creator, has been trapped for 20 years. With fearless warrior Quorra (Olivia Wilde), Kevin and Sam seek to escape from a universe that, while magnificent, is far more advanced and dangerous than Kevin had ever imagined.",
      "rating":       "PG",
      "releaseYear":  "2010",
      "trailer":      "www.youtube.com/watch?v=QpsVtgAFjLA"
    }
    ,
    {
      "titleDisplay": "War Games",
      "titleFilter":  "War Games",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/warGames.png",
      "genre":        "Action",
      "runTime":      "1:54:00",
      "summary":      "High school student David Lightman (Matthew Broderick) unwittingly hacks into a military supercomputer while searching for new video games. After starting a game of Global Thermonuclear War, Lightman leads the supercomputer to activate the nation's nuclear arsenal in response to his simulated threat as the Soviet Union. Once the clueless hacker comes to his senses, Lightman, with help from his girlfriend (Ally Sheedy), must find a way to alert the authorities to stop the onset of World War III.",
      "rating":       "PG",
      "releaseYear":  "1983",
      "trailer":      "https://www.youtube.com/watch?v=tAcEzhQ7oqA"
    }
    ,
    {
      "titleDisplay": "Kung Fu Panda",
      "titleFilter":  "Kung Fu Panda",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/kungFu.png",
      "genre":        "Disney, Comedy",
      "runTime":      "1:35:00",
      "summary":      "Po the panda (Jack Black) works in his family's noodle shop and dreams of becoming a kung-fu master. His dream becomes a reality when, unexpectedly, he must fulfill an ancient prophecy and study the skills with his idols, the Furious Five. Po needs all the wisdom, strength and ability he can muster to protect his people from an evil snow leopard.",
      "rating":       "PG",
      "releaseYear":  "2008",
      "trailer":      "https://www.youtube.com/watch?v=PXi3Mv6KMzY"
    }
    ,
    {
      "titleDisplay": "Astroboy",
      "titleFilter":  "Astroboy",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Astroboy.png",
      "genre":        "Disney, Comedy",
      "runTime":      "1:35:00",
      "summary":      "In futuristic Metro City, a brilliant scientist named Tenma builds Astro Boy (Freddie Highmore), a robotic child with superstrength, X-ray vision and the ability to fly. Astro Boy sets out to explore the world and find acceptance, learning what being human is all about in the process. Finding that his friends and family in Metro City are in danger, he uses his incredible powers to save all that he loves.",
      "rating":       "PG",
      "releaseYear":  "2009",
      "trailer":      "https://www.youtube.com/watch?v=1AhqOHom9BY"
    }
    ,
    {
      "titleDisplay": "Bedtime Stories",
      "titleFilter":  "Bedtime Stories",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/bedtimeStories.png",
      "genre":        "Comedy, Fantasy",
      "runTime":      "1:39:00",
      "summary":      "Hotel handyman Skeeter Bronson (Adam Sandler) gets an unexpected surprise when he discovers that the tall tales he has been telling his niece and nephew are somehow coming true. Hoping to make the most of the mysterious phenomenon, Skeeter spins one outlandish yarn after another, but the children's unexpected contributions to the stories turn Skeeter's life upside down.",
      "rating":       "PG",
      "releaseYear":  "2008",
      "trailer":      "https://www.youtube.com/watch?v=IaMLPiKP1fs"
    }
    ,
    {
      "titleDisplay": "Darby O'Gill and the Little People",
      "titleFilter":  "Darby O'Gill and the Little People",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/darbyGill.png",
      "genre":        "Drama, Comedy",
      "runTime":      "1:33:00",
      "summary":      "Just-fired Darby O'Gill (Albert Sharpe) does not want to tell his daughter, Katie (Janet Munro), that his position has been taken by a dashing younger man (Sean Connery). Then, on his way home, Darby slips through a portal to the land of the little people. There he meets the leprechaun king, Brian (Jimmy O'Dea), and winds up accidentally bringing the little monarch home with him. Darby then demands Brian grant him three wishes, but the request brings Darby bittersweet, and unexpected, results.",
      "rating":       "G",
      "releaseYear":  "1959",
      "trailer":      "https://www.youtube.com/watch?v=WFN-y5AB6fs"
    }
    ,
    {
      "titleDisplay": "The Chronicles of Narnia - Voyage of the Dawn Treader",
      "titleFilter":  "Chronicles of Narnia - Voyage of the Dawn Treader",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/treader.png",
      "genre":        "Drama, Action, Fantasy",
      "runTime":      "1:55:00",
      "summary":      "Visiting their annoying cousin, Eustace, Lucy (Georgie Henley) and Edmund Pevensie (Skandar Keynes) come across a painting of a majestic ship called the Dawn Treader. Suddenly, the painting comes to life and draws the youths into Narnia, where they meet their old friend, King Caspian (Ben Barnes). Caspian is on a quest to find the seven lost Lords of Telmar, whose swords will save Narnia from an evil green mist that enslaves men's minds and bodies.",
      "rating":       "PG",
      "releaseYear":  "2010",
      "trailer":      "https://www.youtube.com/watch?v=hrJQDPpIK6I"
    }
    ,
    {
      "titleDisplay": "Angels in the Outfield",
      "titleFilter":  "Angels in the Outfield",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/angelsOutfield.png",
      "genre":        "Drama",
      "runTime":      "1:43:00",
      "summary":      "Foster kid Roger (Joseph Gordon-Levitt) loves the Anaheim Angels, even though they're the worst team in the major leagues. His estranged dad promises to reunite the family if the Angels make it to the World Series, so Roger decides to ask for some divine help and prays that his favorite team will turn things around. Soon, a real angel named Al (Christopher Lloyd) shows up in response to Roger's prayers, and Anaheim's hopeless coach (Danny Glover) is shocked to see his team on a winning streak.",
      "rating":       "PG",
      "releaseYear":  "1994",
      "trailer":      "https://www.youtube.com/watch?v=wok7pG9_vX8"
    }
    ,
    {
      "titleDisplay": "Honey, I Shrunk the Kids",
      "titleFilter":  "Honey, I Shrunk the Kids",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/honeyShrunk.png",
      "genre":        "Disney, Comedy",
      "runTime":      "1:41:00",
      "summary":      "When kids sneak into inventor Wayne Szalinski's (Rick Moranis) upstairs lab to retrieve an errant baseball, his experimental shrink ray miniaturizes them. When Szalinski returns home, he destroys the device -- which he thinks is a failure -- and dumps it in the trash, throwing out the kids along with it. The four children, now 1/4-inch tall, must survive the journey back to the house through a yard where sprinklers bring treacherous storms and garden-variety ants stampede like elephants.",
      "rating":       "PG",
      "releaseYear":  "1989",
      "trailer":      "www.youtube.com/watch?v=AMGZwxc9VqI"
    }
    ,
    {
      "titleDisplay": "Swiss Family Robinson",
      "titleFilter":  "Swiss Family Robinson",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/swissFamily.png",
      "genre":        "Drama, Action",
      "runTime":      "2:06:00",
      "summary":      "In this family film, the Robinson clan -- mother (Dorothy McGuire), father (John Mills) and their three sons, Fritz, Ernst and Francis -- flee the reign of Napoleon to start afresh in New Guinea. When their ship gets damaged en route, the family takes refuge on a deserted island. The Robinsons learn to live in the wild, have various adventures and build an impressive house in a tree. However, while island life is full excitement, the question of whether to return to civilization looms.",
      "rating":       "PG",
      "releaseYear":  "1960",
      "trailer":      "https://www.youtube.com/watch?v=B2b9MQ7vGL4"
    }
    ,
    {
      "titleDisplay": "High School Musical",
      "titleFilter":  "High School Musical",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/highSchoolMusical.png",
      "genre":        "Music, Comedy, Romance",
      "runTime":      "1:38:00",
      "summary":      "Troy Bolton (Zac Efron), the star athlete at a small-town high school, falls for nerdy beauty Gabriella Montez (Vanessa Anne Hudgens) at a holiday karaoke party. When they return to campus, Troy and Gabriella audition for the upcoming school musical. Meanwhile, the jealous Sharpay Evans (Ashley Tisdale) conspires to squelch their chances. The two must struggle to make it to auditions while also meeting their existing obligations to the basketball team and the academic decathlon.",
      "rating":       "G",
      "releaseYear":  "2006",
      "trailer":      "https://www.youtube.com/watch?v=U3G1BogR-68"
    }
    ,
    {
      "titleDisplay": "Kindergarten Cop",
      "titleFilter":  "Kindergarten Cop",
      "editedFlag":   false,
      "toEditFlag":   true,
      "imgPath":      "img/kindergatenCop.png",
      "genre":        "Comedy, Action",
      "runTime":      "1:51:00",
      "summary":      "In this action-comedy, unusual circumstances find big, brawny cop John Kimble (Arnold Schwarzenegger) posing as a kindergarten teacher in order to apprehend major drug lord Cullen Crisp (Richard Tyson), as well as his ruthless accomplice and mother, Eleanor (Carroll Baker). While pretending to be a kid-friendly instructor, Kimble falls for pretty fellow teacher Joyce Palmieri (Penelope Ann Miller) as he battles both unruly children and dangerous bad guys.",
      "rating":       "PG-13",
      "releaseYear":  "1990",
      "trailer":      "https://www.youtube.com/watch?v=DUK69AM6Mv4"
    }
    ,
    {
      "titleDisplay": "Bee Movie",
      "titleFilter":  "Bee Movie",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/beeMovie.png",
      "genre":        "Disney, Comedy",
      "runTime":      "1:35:00",
      "summary":      "Fresh out of college, Barry the Bee (Jerry Seinfeld) finds the prospect of working with honey uninspiring. He flies outside the hive for the first time and talks to a human (Renée Zellweger), breaking a cardinal rule of his species. Barry learns that humans have been stealing and eating honey for centuries, and he realizes that his true calling is to obtain justice for his kind by suing humanity for theft.",
      "rating":       "PG",
      "releaseYear":  "2007",
      "trailer":      "www.youtube.com/watch?v=g7TZgXm7r34"
    }
    ,
    {
      "titleDisplay": "A Bug's Life",
      "titleFilter":  "A Bug's Life",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/bugsLife.png",
      "genre":        "Disney",
      "runTime":      "1:35:00",
      "summary":      "Flik (Dave Foley) is an inventive ant who's always messing things up for his colony. His latest mishap was destroying the food stores that were supposed to be used to pay off grasshopper Hopper (Kevin Spacey). Now the strong-arming insect is demanding that the ants gather double the food -- or face annihilation. To avert disaster, Flik goes on a journey to recruit fighters to defend the colony. When he meets a band of high-flying circus insects, he thinks he's found his salvation.",
      "rating":       "G",
      "releaseYear":  "1998",
      "trailer":      "https://www.youtube.com/watch?v=vhGlMv3UCXA"
    }
    ,
    {
      "titleDisplay": "Alice in Wonderland",
      "titleFilter":  "Alice in Wonderland",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/aliceWonderland1999.png",
      "genre":        "Disney, Fantasy",
      "runTime":      "1:48:00",
      "summary":      "A young girl when she first visited magical Underland, Alice Kingsleigh (Mia Wasikowska) is now a teenager with no memory of the place -- except in her dreams. Her life takes a turn for the unexpected when, at a garden party for her fiance and herself, she spots a certain white rabbit and tumbles down a hole after him. Reunited with her friends the Mad Hatter (Johnny Depp), the Cheshire Cat and others, Alice learns it is her destiny to end the Red Queen's (Helena Bonham Carter) reign of terror.",
      "rating":       "PG",
      "releaseYear":  "2010",
      "trailer":      "https://www.youtube.com/watch?v=9POCgSRVvf0"
    }
    ,
    {
      "titleDisplay": "Bambi",
      "titleFilter":  "Bambi",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/bambi.png",
      "genre":        "Disney",
      "runTime":      "1:10:00",
      "summary":      "In a classic Disney animation, a fawn named Bambi joins his new friends, a young rabbit named Thumper and a skunk kit named Flower in happily exploring the woods. Bambi is captivated with a young doe named Faline, and he learns from his doting mother and his father -- the Great Prince of the Forest -- that besides the delights of the forest, there is danger in open meadows where hunters can see them. Though fear and tragedy touch Bambi's life, another spring brings renewal.",
      "rating":       "G",
      "releaseYear":  "1942",
      "trailer":      "https://www.youtube.com/watch?v=nLvX-erABqY"
    }
    ,
    {
      "titleDisplay": "Beauty and the Beast",
      "titleFilter":  "Beauty and the Beast",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/beatyBeast.png",
      "genre":        "Disney",
      "runTime":      "1:50:00",
      "summary":      "An arrogant young prince (Robby Benson) and his castle's servants fall under the spell of a wicked enchantress, who turns him into the hideous Beast until he learns to love and be loved in return. The spirited, headstrong village girl Belle (Paige O'Hara) enters the Beast's castle after he imprisons her father Maurice (Rex Everhart). With the help of his enchanted servants, including the matronly Mrs. Potts (Angela Lansbury), Belle begins to draw the cold-hearted Beast out of his isolation.",
      "rating":       "G",
      "releaseYear":  "1991",
      "trailer":      "https://www.youtube.com/watch?v=c38r-SAnTWM"
    }
    ,
    {
      "titleDisplay": "Bedknobs and Broomsticks",
      "titleFilter":  "Bedknobs and Broomsticks",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/bedknobs.png",
      "genre":        "Disney",
      "runTime":      "2:19:00",
      "summary":      "During the Battle of Britain, Miss Eglantine Price (Angela Lansbury), a cunning witch-in-training, decides to use her supernatural powers to defeat the Nazi menace. She sets out to accomplish this task with the aid of three inventive children who have been evacuated from the London Blitz. Joined by Emelius Brown (David Tomlinson), the head of Miss Price's witchcraft training correspondence school, the crew uses an enchanted bed to travel into a fantasy land and foil encroaching German troops.",
      "rating":       "G",
      "releaseYear":  "1971",
      "trailer":      "https://www.youtube.com/watch?v=8xHM7TNxg3s"
    }
    ,
    {
      "titleDisplay": "Hunchback of Notre Dame",
      "titleFilter":  "Hunchback of Notre Dame",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/hunchback.png",
      "genre":        "Disney",
      "runTime":      "1:35:00",
      "summary":      "An animated Disney adventure follows disfigured Quasimodo (Tom Hulce), the bell-ringer of Notre Dame Cathedral, who bides his time locked away in a tower. With only gargoyles to keep him company, Quasimodo longs to be with other people, leading to his chance encounter with the enchanting Gypsy Esmeralda (Demi Moore). When the beautiful young woman catches the attention of Quasimodo's guardian, sinister Frollo (Tony Jay), Quasimodo must help to keep her out of his clutches.",
      "rating":       "G",
      "releaseYear":  "1996",
      "trailer":      "https://www.youtube.com/watch?v=DezyFYB2MMk"
    }
    ,
    {
      "titleDisplay": "Lady and the tramp",
      "titleFilter":  "Lady and the tramp",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/ladyTramp.png",
      "genre":        "Disney",
      "runTime":      "1:16:00",
      "summary":      "This Disney animated classic follows a pampered cocker spaniel named Lady (Barbara Luddy) whose comfortable life slips away once her owners have a baby. When, after some tense circumstances, Lady finds herself on the loose and out on the street, she is befriended and protected by the tough stray mutt Tramp (Larry Roberts). A romance begins to blossom between the two dogs, but their many differences, along with more drama at Lady's household, threaten to keep them apart.",
      "rating":       "G",
      "releaseYear":  "1955",
      "trailer":      "https://www.youtube.com/watch?v=LZmVm6qv1Lk"
    }
    ,
    {
      "titleDisplay": "Lilo and Stitch",
      "titleFilter":  "Lilo and Stitch",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/liloStitch.png",
      "genre":        "Disney",
      "runTime":      "1:25:00",
      "summary":      "A tale of a young girl's close encounter with the galaxy's most wanted extraterrestrial. Lilo is a lonely Hawaiian girl who adopts a small ugly 'dog,' whom she names Stitch. Stitch would be the perfect pet if he weren't in reality a genetic experiment who has escaped from an alien planet and crash-landed on Earth. Through her love, faith and unwavering belief in ohana, the Hawaiian concept of family, Lilo helps unlock Stitch's heart and gives him the ability to care for someone else.",
      "rating":       "PG",
      "releaseYear":  "2002",
      "trailer":      "https://www.youtube.com/watch?v=hu9bERy7XGY"
    }
    ,
    {
      "titleDisplay": "Mary Poppins",
      "titleFilter":  "Mary Poppins",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/maryPoppins.png",
      "genre":        "Disney",
      "runTime":      "2:20:00",
      "summary":      "When Jane (Karen Dotrice) and Michael (Matthew Garber), the children of the wealthy and uptight Banks family, are faced with the prospect of a new nanny, they are pleasantly surprised by the arrival of the magical Mary Poppins (Julie Andrews). Embarking on a series of fantastical adventures with Mary and her Cockney performer friend, Bert (Dick Van Dyke), the siblings try to pass on some of their nanny's sunny attitude to their preoccupied parents (David Tomlinson, Glynis Johns).",
      "rating":       "G",
      "releaseYear":  "1964",
      "trailer":      "www.youtube.com/watch?v=9kKXYjOD-AI"
    }
    ,
    {
      "titleDisplay": "Saints and Soldiers",
      "titleFilter":  "Saints and Soldiers",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/saintsSoldiers.png",
      "genre":        "Drama, Doc/Rel, Action",
      "runTime":      "1:30:00",
      "summary":      "After Nazis ambush a brigade of Allied soldiers in Belgium, the few remaining survivors, including the sniper, Deacon (Corbin Allred), and Pvt. Kendrick (Lawrence Bagby), take cover in a nearby forest. There, they meet stranded British intelligence officer Oberon (Kirby Heyborne), who has time-sensitive information of vital importance to the Allied effort. Despite the various inner conflicts each of the soldiers carry, they band together to get Oberon safely back into Allied territory.",
      "rating":       "PG-13",
      "releaseYear":  "2003",
      "trailer":      "https://www.youtube.com/watch?v=us-0akvhbFE"
    }
    ,
    {
      "titleDisplay": "Bolt",
      "titleFilter":  "Bolt",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/bolt.png",
      "genre":        "Disney, Comedy",
      "runTime":      "1:37:00",
      "summary":      "The days of canine superstar Bolt (John Travolta) are filled with danger and intrigue ... until the cameras stop rolling. But Bolt doesn't know that he's on a TV show; he thinks his amazing powers are real. When Bolt is accidentally shipped from his Hollywood soundstage to the mean streets of New York, he begins his most-amazing adventure: Armed only with his delusions and accompanied by a cat and a hamster, he sets out to to find his owner, Penny (Miley Cyrus).",
      "rating":       "PG",
      "releaseYear":  "2008",
      "trailer":      "https://www.youtube.com/watch?v=zm51H0dIzYQ"
    }
    ,
    {
      "titleDisplay": "Dinosaur",
      "titleFilter":  "Dinosaur",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Dinosaur.png",
      "genre":        "Disney",
      "runTime":      "1:23:00",
      "summary":      "This is the story of Aladar (D.B. Sweeney), an iguanodon dinosaur raised by a family of lemurs. Their world is turned upside-down however, when meteors strike, turning their green world into a desert wasteland. Teaming up with a herd of other herbivores, the trek is on to find the 'Nesting Ground' where water and vegetation is bountiful... but with carnivores behind them and nothing but desert around for miles, it doesn't look promising!",
      "rating":       "PG",
      "releaseYear":  "2000",
      "trailer":      "www.youtube.com/watch?v=wsDx_ScRXZc"
    }
    ,
    {
      "titleDisplay": "Peter Pan",
      "titleFilter":  "Peter Pan",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/peterPan.png",
      "genre":        "Disney",
      "runTime":      "1:17:00",
      "summary":      "In this Disney animated film, Wendy (Kathryn Beaumont) and her two brothers are amazed when a magical boy named Peter Pan (Bobby Driscoll) flies into their bedroom, supposedly in pursuit of his rebellious shadow. He and his fairy friend, Tinkerbell, come from a far-off place called Neverland, where children stay perpetually young. Enchanted, the kids follow him back. But when Pan's nemesis, the pirate Captain Hook (Hans Conried), causes trouble, the kids begin to miss their old life.",
      "rating":       "G",
      "releaseYear":  "1953",
      "trailer":      "https://www.youtube.com/watch?v=4GVdbBpVVoc"
    }
    ,
    {
      "titleDisplay": "Pooh's Heffalump Movie",
      "titleFilter":  "Pooh's Heffalump Movie",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/pooh.png",
      "genre":        "Disney",
      "runTime":      "1:08:00",
      "summary":      "Winnie the Pooh (Jim Cummings), Piglet (John Fiedler), Tigger and Roo (Nikita Hopkins) search for a mysterious and fearsome creature.",
      "rating":       "G",
      "releaseYear":  "2005",
      "trailer":      "https://www.youtube.com/watch?v=PgCkeQ8oZQM"
    }
    ,
    {
      "titleDisplay": "Sword in the Stone",
      "titleFilter":  "Sword in the Stone",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/swordStone.png",
      "genre":        "Disney",
      "runTime":      "1:19:00",
      "summary":      "This Disney adaptation of the classic fable chronicles King Arthur's humble beginnings. As an orphaned child, Arthur, who was then known as Wart, wants to help his foster brother, Kay, succeed in becoming a knight. While helping Kay train, Wart stumbles upon a cabin belonging to Merlin, a bumbling but talented wizard. Merlin does his best to convince the boy that he is bound for greatness, and when Wart and Kay travel to London to attend a jousting contest, they learn that Merlin was right.",
      "rating":       "G",
      "releaseYear":  "1963",
      "trailer":      "https://www.youtube.com/watch?v=KnL0rYFKuL4"
    }
    ,
    {
      "titleDisplay": "Thumbelina",
      "titleFilter":  "Thumbelina",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/thumbelina.png",
      "genre":        "Dinsey",
      "runTime":      "1:26:00",
      "summary":      "A girl no bigger than her mother's thumb feels all alone in the world knowing she is the only person her size. Her wish for a companion at last comes true when the prince of the fairy's arrives at her window sill. However, the naive Thumbelina's life goes downward from there when a toad kidnaps her. While she tries to find a way home, she begins to grow up and learns about hope with the help of the friends she always wanted.",
      "rating":       "G",
      "releaseYear":  "1994",
      "trailer":      "https://www.youtube.com/watch?v=Qe9ARKT-JAo"
    }
    ,
    {
      "titleDisplay": "Presto",
      "titleFilter":  "Presto",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/presto.png",
      "genre":        "Disney",
      "runTime":      "0:00:05",
      "summary":      "Presto is a 2008 American Pixar computer-animated short film shown in theaters before their feature-length film WALL-E. The short is about a magician trying to perform a show with his uncooperative rabbit and is a gag-filled homage to classic cartoons such as Tom and Jerry and Looney Tunes. Presto was directed by veteran Pixar animator Doug Sweetland, in his directorial debut.  The original idea for the short was a magician who incorporated a rabbit into his act who suffered from stage fright. This was considered to be too long and complicated, and the idea was reworked. To design the theater featured in Presto, the filmmakers visited several opera houses and theaters for set design ideas. Problems arose when trying to animate the theater's audience of 2,500 patrons—which was deemed too expensive—and was solved by showing the back of the audience.",
      "rating":       "G",
      "releaseYear":  "2008",
      "trailer":      ""
    }
    ,
    {
      "titleDisplay": "Robin Hood",
      "titleFilter":  "Robin Hood Z",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/robinHoodDisney.png",
      "genre":        "Disney",
      "runTime":      "1:23:00",
      "summary":      "An amiable rooster called Alan-a-Dale (Roger Miller) tells stories and sings songs of the heroic Robin Hood (Brian Bedford) and his trusty sidekick, Little John (Phil Harris), in this animated animal-themed adaptation of the legendary story. When evil Prince John (Peter Ustinov) deputizes the Sheriff of Nottingham (Pat Buttram) to collect unreasonable taxes from the animals of Sherwood Forest, Robin, Little John and the other merry men wage a lighthearted battle against their evil foes.",
      "rating":       "G",
      "releaseYear":  "1973",
      "trailer":      "https://www.youtube.com/watch?v=c5Qph47c2uE"
    }
    ,
    {
      "titleDisplay": "TMNT",
      "titleFilter":  "TMNT",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/tmnt.png",
      "genre":        "Comedy, Action, Fantasy",
      "runTime":      "1:30:00",
      "summary":      "Splinter, the rat sensei, senses something amiss in New York City. His disciples, Leonardo, Donatello, Raphael and Michelangelo have grown apart since their last adventure. The teenage terrapins must somehow renew and strengthen their bond if they are to have any hope of defeating an evil industrialist's army of ancient monsters.",
      "rating":       "PG",
      "releaseYear":  "2007",
      "trailer":      "https://www.youtube.com/watch?v=gisFzhNu63Y"
    }
    ,
    {
      "titleDisplay": "Happy Feet",
      "titleFilter":  "Happy Feet",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/happyFeet.png",
      "genre":        "Disney, Comedy, Music",
      "runTime":      "1:48:00",
      "summary":      "Mumble (Elijah Wood), a young emperor penguin, lives in Antarctica. Like others of his kind, he needs to be able to sing to attract a mate, but he has a terrible voice. Instead, Mumble must express himself, and lure a female through his amazing talent for tap-dancing.",
      "rating":       "PG",
      "releaseYear":  "2006",
      "trailer":      "https://www.youtube.com/watch?v=hFUC5adf8FE"
    }
    ,
    {
      "titleDisplay": "Everyone's Hero",
      "titleFilter":  "Everyone's Hero",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/everyonesHero.png",
      "genre":        "Comedy, Disney",
      "runTime":      "1:30:00",
      "summary":      "A boy (Jake T. Austin) comes to a turning point in his life when he faces a critical decision: Should he take a chance and possibly become a hero, or should he play it safe? Though the odds are stacked against him, he begins a cross-country adventure to return Babe Ruth's baseball bat before the deciding game of the 1932 World Series.",
      "rating":       "G",
      "releaseYear":  "2006",
      "trailer":      "https://www.youtube.com/watch?v=FB4rJ0qn250"
    }
    ,
    {
      "titleDisplay": "Igor",
      "titleFilter":  "Igor",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/igor.png",
      "genre":        "Disney, Comedy",
      "runTime":      "1:28:00",
      "summary":      "Lab assistant Igor (John Cusack) dreams of becoming a mad scientist like his master, Dr. Glickenstein. When the doctor runs afoul of his own invention, Igor seizes the chance. With the help of his friends Scamper (Steve Buscemi) and Brain (Sean Hayes), Igor plans to win the kingdom's annual science fair by building the most-evil monster ever. The problem is that Eve (Molly Shannon), as the monster is called, is sweeter than sugar and would rather be an actress.",
      "rating":       "PG",
      "releaseYear":  "2008",
      "trailer":      "https://www.youtube.com/watch?v=SrSX8NYN2x4"
    }
    ,
    {
      "titleDisplay": "Open Season",
      "titleFilter":  "Open Season",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/openseason.png",
      "genre":        "Comedy, Disney",
      "runTime":      "1:39:00",
      "summary":      "Boog (Martin Lawrence), a 900-pound grizzly bear, is content entertaining tourists and living in park ranger Beth's (Debra Messing) barn. His life takes a drastic turn when he rescues a one-horned mule deer named Elliot (Ashton Kutcher) from a hunter (Gary Sinise), and is subsequently tranquilized and returned to the wild. Elliot and Boog recruit the other animals, notably a Scottish squirrel (Billy Connolly) and a beaver foreman, to help turn the tables on the hunters to make the woods safe.",
      "rating":       "PG",
      "releaseYear":  "2006",
      "trailer":      "www.youtube.com/watch?v=1KFSjLvEfts"
    }
    ,
    {
      "titleDisplay": "Tinkerbell",
      "titleFilter":  "Tinkerbell 1",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/tink1.png",
      "genre":        "Disney",
      "runTime":      "1:18:00",
      "summary":      "Newly born fairy Tinker Bell (Mae Whitman) is transported by the wind to Pixie Hollow on the island of Neverland and learns that, as a tinker, her job is to repair broken items. When Tinker meets some new friends -- water fairy Silvermist (Lucy Liu), garden fairy Rosetta (Kristin Chenoweth) and animal fairy Fawn (America Ferrera) -- she realizes that she will not travel to the mainland to help bring about spring. Sad and upset, Tinker struggles with who she is and who she wants to be.",
      "rating":       "G",
      "releaseYear":  "2008",
      "trailer":      "www.youtube.com/watch?v=4QdXiuaBbcg"
    }
    ,
    {
      "titleDisplay": "Toy Story",
      "titleFilter":  "Toy Story 1",
      "imgPath":      "img/toyStory1.png",
      "genre":        "Disney, Fantasy",
      "runTime":      "1:21:00",
      "summary":      "Woody (Tom Hanks), a good-hearted cowboy doll who belongs to a young boy named Andy (John Morris), sees his position as Andy's favorite toy jeopardized when his parents buy him a Buzz Lightyear (Tim Allen) action figure. Even worse, the arrogant Buzz thinks he's a real spaceman on a mission to return to his home planet. When Andy's family moves to a new house, Woody and Buzz must escape the clutches of maladjusted neighbor Sid Phillips (Erik von Detten) and reunite with their boy.",
      "rating":       "G",
      "releaseYear":  "1995",
      "trailer":      "https://www.youtube.com/watch?v=KYz2wyBy3kc"
    }
    ,
    {
      "titleDisplay": "Toy Story 3",
      "titleFilter":  "Toy Story 3",
      "imgPath":      "img/toyStory3.png",
      "genre":        "Disney",
      "runTime":      "1:43:00",
      "summary":      "With their beloved Andy preparing to leave for college, Woody (Tom Hanks), Buzz Lightyear (Tim Allen), Jessie (Joan Cusack), and the rest of the toys find themselves headed for the attic but mistakenly wind up on the curb with the trash. Woody's quick thinking saves the gang, but all but Woody end up being donated to a day-care center. Unfortunately, the uncontrollable kids do not play nice, so Woody and the gang make plans for a great escape.",
      "rating":       "G",
      "releaseYear":  "2010",
      "trailer":      "https://www.youtube.com/watch?v=JcpWXaA2qeg"
    }
    ,
    {
      "titleDisplay": "Tinkerbell and the Lost Treasure",
      "titleFilter":  "Tinkerbell 2",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/tink2.png",
      "genre":        "Disney",
      "runTime":      "1:22:00",
      "summary":      "Friendly fairy Tinker Bell (Mae Whitman) means well but often gets into trouble. All the same, Pixie Hollow has entrusted her with making sure their magical moonstone keeps their pixie dust in plentiful supply. But tragedy strikes when Tinker Bell fumbles this important task -- accidentally breaking the moonstone. In order to get it back into one piece, Tinker Bell will have to find an enchanted mirror and accept a little assistance from pestering pixie Terence (Jesse McCartney).",
      "rating":       "G",
      "releaseYear":  "2009",
      "trailer":      "https://www.youtube.com/watch?v=rp6Yhjht0hM"
    }
    ,
    {
      "titleDisplay": "Tinkerbell and the Great Fairy Rescue",
      "titleFilter":  "Tinkerbell 3",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/tink3.png",
      "genre":        "Disney",
      "runTime":      "1:19:00",
      "summary":      "Tinker Bell (Mae Whitman) visits the meadows of England in summer and develops a special bond with a child in need of a friend. When the other fairies launch a daring rescue, Tinker Bell has to take a huge risk to keep all of fairykind safe.",
      "rating":       "G",
      "releaseYear":  "2010",
      "trailer":      "https://www.youtube.com/watch?v=M1B7dGlmres"
    }
    ,
    {
      "titleDisplay": "The Lion King 2 - Simba'S Pride",
      "titleFilter":  "Lion King 2",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/lion2.png",
      "genre":        "Disney",
      "runTime":      "1:21:00",
      "summary":      "Kiara, the daughter of Simba and Nala, loves the son of exiled lioness Zira, who is out for revenge.",
      "rating":       "G",
      "releaseYear":  "1998",
      "trailer":      "https://www.youtube.com/watch?v=aylCi6thmHM"
    }
    ,
    {
      "titleDisplay": "Ice Age 3 - Dawn Of The Dinosaurs",
      "titleFilter":  "Ice Age 3",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/iceAge3.png",
      "genre":        "Disney, Comedy",
      "runTime":      "1:34:00",
      "summary":      "After Sid (John Leguizamo) pilfers some dinosaur eggs, Manny (Ray Romano), Diego (Denis Leary) and the rest of their prehistoric pals enter a mysterious, underground world to rescue the hapless sloth. During the course of their mission, the gang encounters many creatures great and small, including hungry carnivores and a relentless, dinosaur-hunting weasel named Buck.",
      "rating":       "PG",
      "releaseYear":  "2009",
      "trailer":      "www.youtube.com/watch?v=DxgYZXSppqI"
    }
    ,
    {
      "titleDisplay": "Madagascar 2 - Escape from Africa",
      "titleFilter":  "Madagascar 2",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/madagascar2.png",
      "genre":        "Disney, Comedy",
      "runTime":      "1:29:00",
      "summary":      "Alex (Ben Stiller), Morty (Chris Rock) and other zoo animals find a way to escape from Madagascar when the penguins reassemble a wrecked airplane. The precariously repaired craft stays airborne just long enough to make it to the African continent. There the New Yorkers encounter members of their own species for the first time. Africa proves to be a wild place, but Alex and company wonder if it is better than their Central Park home.",
      "rating":       "PG",
      "releaseYear":  "2008",
      "trailer":      "https://www.youtube.com/watch?v=A45jv8uhZwo"
    }
    ,
    {
      "titleDisplay": "Gnomeo and Julie",
      "titleFilter":  "Gnomeo and Julie",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/gnomeo.png",
      "genre":        "Disney",
      "runTime":      "1:24:00",
      "summary":      "In Stratford-Upon-Avon, birthplace of William Shakespeare, Miss Capulet and Mr. Montague feud over whose garden is the better. Garden gnomes that decorate each neighbor's flower beds continue the rivalry when the humans aren't looking, and gnomes from the Red Gardens don't get along with those of the Blue Gardens. Then Gnomeo (James McAvoy), a Blue, and Juliet (Emily Blunt), a Red, fall in love, leaving many obstacles to overcome.",
      "rating":       "G",
      "releaseYear":  "2011",
      "trailer":      "https://www.youtube.com/watch?v=tgO03BFtvSc"
    }
    ,
    {
      "titleDisplay": "Horton Hears a Who",
      "titleFilter":  "Horton Hears a Who",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/horton.png",
      "genre":        "Disney",
      "runTime":      "1:28:00",
      "summary":      "Animated elephant Horton (Jim Carrey) finds a speck of dust floating in the Jungle of Nool. Upon investigation of the speck, Horton discovers the tiny city of Who-ville and its residents, the Whos, which he can hear but cannot see. Horton forms a friendship with the mayor of Who-ville, Ned McDodd (Steve Carell), and promises to transport Who-ville to safety. However, Horton encounters opposition from his jungle neighbors, who don't want to believe in the existence of Who-ville.",
      "rating":       "G",
      "releaseYear":  "2008",
      "trailer":      "https://www.youtube.com/watch?v=MIQFTBsGccA"
    }
    ,
    {
      "titleDisplay": "Ice Age 4 - Continental Drift",
      "titleFilter":  "Ice Age 4",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/iceAge4.png",
      "genre":        "Disney, Comedy",
      "runTime":      "1:34:00",
      "summary":      "Scrat's continuous pursuit of an infernal acorn has world-changing consequences for Manny (Ray Romano), Sid (John Leguizamo) and Diego (Denis Leary) when the continents split apart. The continental crack-up separates Manny and his friends from the rest of the herd, including Manny's mate, Ellie (Jennifer Lopez) and rebellious daughter Peaches (Keke Palmer). The pals are desperate to return home, but a pirate (Peter Dinklage) and his ragtag crew stand in their way.",
      "rating":       "PG",
      "releaseYear":  "2012",
      "trailer":      "https://www.youtube.com/watch?v=hzixp8s4pyg"
    }
    ,
    {
      "titleDisplay": "Home Alone 2 - Lost in New York",
      "titleFilter":  "Home Alone 2",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/homeAlone2.png",
      "genre":        "Comedy, Holiday",
      "runTime":      "2:01:00",
      "summary":      "After snarky youth Kevin McCallister (Macaulay Culkin) loses track of his father at the airport, he mistakenly gets on a plane headed for New York City -- while the rest of the McCallisters fly to Florida. Now alone in the Big Apple, Kevin cons his way into a room at the Plaza Hotel and begins his usual antics. But when Kevin discovers that the Sticky Bandits (Joe Pesci, Daniel Stern) are on the loose, he struggles to stop them from robbing an elderly man's toy store just before Christmas.",
      "rating":       "PG",
      "releaseYear":  "1992",
      "trailer":      "www.youtube.com/watch?v=wph0t0-f5K8"
    }
    ,
    {
      "titleDisplay": "Hook",
      "titleFilter":  "Hook",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/Hook.png",
      "genre":        "Comedy, Action, Fantasy",
      "runTime":      "2:24:00",
      "summary":      "When his young children are abducted by his old nemesis, Capt. Hook (Dustin Hoffman), middle-aged lawyer Peter Banning (Robin Williams) returns to his magical origins as Peter Pan. Peter must revisit a foggy past in which he abandoned Neverland for family life, leaving Tinkerbell (Julia Roberts) and the Lost Boys to fend for themselves. Given their bitterness toward Peter for growing up -- and their allegiance to their new leader, Rufio -- the old gang may not be happy to see him.",
      "rating":       "PG",
      "releaseYear":  "1991",
      "trailer":      "https://www.youtube.com/watch?v=LxnR9e7M8Vw"
    }
    ,
    {
      "titleDisplay": "Chicken Run",
      "titleFilter":  "Chicken Run",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/chickenRun.png",
      "genre":        "Disney, Comedy",
      "runTime":      "1:24:00",
      "summary":      "This engaging stop-motion, claymation adventure tells the story of an American rooster who falls in love with a gorgeous hen on a British farm. The couple decides to run away from the farm, but they must first contend with the evil farmer who is intent on keeping them under her control. The chickens decide to attempt an escape so they don't get turned into chicken pot pies.",
      "rating":       "G",
      "releaseYear":  "2000",
      "trailer":      "https://www.youtube.com/watch?v=jVdlxwX6A7g"
    }
    ,
    {
      "titleDisplay": "Newsies",
      "titleFilter":  "Newsies",
      "editedFlag":   false,
      "toEditFlag":   false,
      "imgPath":      "img/newsies.png",
      "genre":        "Comedy, Drama, Music",
      "runTime":      "2:01:00",
      "summary":      "In this musical, homeless New York City newsboy Jack 'Cowboy' Kelly (Christian Bale) befriends two newcomers to his trade, brothers David (David Moscow) and Les Jacobs (Luke Edwards). When publisher Joseph Pulitzer (Robert Duvall) sets new rules that make it harder for the young newspaper salesmen to make a buck, the boys go on strike. Bryan Denton (Bill Pullman), a journalist who's sympathetic to their plight, gives them some tips in public relations, as the newsboys' battle grips the city.",
      "rating":       "PG",
      "releaseYear":  "1992",
      "trailer":      "https://www.youtube.com/watch?v=lqPuGMgT6yw"
    }